{
  "preRequisites:11": [
    678743056
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§o网络的核心，类似于可视化流程图，能够放置模块并将其连接到不同的模块。要制作一个最基本的从A到B的程序，你必须将一个“触发器”模块放置到布局上。触发器模块是“运行”脚本的起点，并且它的触发方式非常灵活，可设定为不同模式，例如每5秒触发一次、由红石控制等等。\n\n线缆用于扩展管理器的连接范围。将其与将要实现自动化的方块相邻放置，以将这些方块连接到管理器。\n\n然后，你可以放置一个“输入”模块，指定目标机器、方块实体、箱子等作为输入端，并指定输入面。同样地，放置“输出”模块来指定输出目标和输出面。如此这般，你就可以建立一个基本的输入输出系统。\n\n以下是各管理器组件的功能简述：\n\n*创建触发器*\n用于启动连接在其底部的模块链。可配置为定时触发，或通过网络中“红石信号接收端”的红石信号触发。\n\n*创建输入*\n将箱子、方块实体、机器等设为“输入端”，从中提取物品并输送至其他地方。\n\n*创建输出*\n将箱子、方块实体、机器等设为“输出端”，接收来自输入模块或其他来源的物品。\n\n输入和输出模块均支持过滤功能。可通过**右键点击**过滤槽中的物品进行额外配置，如限定输出物品数量，类似末影接口的限制物品过滤器。\n\n*创建流控制*\n可为单个或多个“输入”模块分配不同输出路径。例如将煤炭输送至熔炉侧面，矿石输送至顶部。通过“连接”选项卡切换不同模式。其节点兼容多数模块，不仅限于输入/输出。\n\n*创建流体输入&流体输出*\n功能与输入/输出模块类似，但针对流体储罐操作。同样可指定输出流体量。\n\n*自动合成器*\n通过指令实现自动化合成！使用该模块配置所需原版工作台配方，触发时自动执行。可设置“溢出”容器用于存放多余产物，并自动回收使用过的容器（如桶）。\n\n*告示牌更新器*\n触发时将预设文本写入告示牌。可指定更新局部内容，保留空白区域或固定文本。\n\n*伪装*\n触发时改变线缆伪装方块的外观。\n\n\n---\n高级：\n\n*条件判断*\n执行真/假判断的强力模块。可监测指定容器的物品状态（整体库存或过滤物品）。若条件为真，则激活左侧“真”分支；为假，则激活右侧“假”分支。可借此实现基于物品存在的分支逻辑（如检测指定箱子是否含特定物品）。\n\n*红石信号发射端*\n该模块需连接至管理器连接的“红石发射器”方块。可配置任意面的信号类型、强度及模式。\n\n*红石条件判断*\n该模块需连接至管理器连接的“红石接收器”方块。功能类似基础条件模块，但专用于检测配置的红石信号特征（如强度、方向等），实现红石触发的逻辑判断。（注：触发器模块也可配置为由红石信号接收端控制）\n\n*变量*\n将网络中的方块或条件定义为指定颜色的变量。如将多个输出容器统一设为蓝色变量。此后在触发器>输入>输出流程中，可直接指定输出至“蓝色变量”组。声明态的变量无需与模块连接，可置于布局角落。\n\n若设为标准态（而非声明态），模块将出现触发点供其他模块连接。触发时可对网络中的变量进行增删改操作。\n\n*遍历循环*\n允许在变量间循环以实现不同效果。虽然这个概念有些令人困惑，但你可以通过它将基础空变量转换为能与已定义变量配合工作的形式。\n\n*命令组*\n将多个模块压缩为单一的组模块。需配合“组节点”使用：组内可配置最多5个输入和5个输出节点，外部模块通过这些节点与组内模块交互。\n\n*告示牌更新器*\n触发时更新网络中连接的告示牌更新器方块及其链接的告示牌。\n\n*伪装*\n触发时更新线缆伪装方块的外观。\n\n",
      "icon:10": {
        "Count:3": 1,
        "id:8": "superfactorymanager:manager"
      },
      "name:8": "工厂管理器"
    }
  },
  "questID:3": 62754235,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "superfactorymanager:manager"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "superfactorymanager:cable"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}