{
  "preRequisites:11": [
    63
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oMany of the recipes in this pack are recursive, meaning that once you have crafted an item for the first time, you can use these special recipes to duplicate it.\nSome recursive recipes will consume the item, some won\u0027t.\n\nIf this is the first time you encounter recursive recipes (some other modpacks use them), you should read this example on how to deal with them.\n\nThe normal basic table recipe can only be performed in a vanilla crafting table, and it will not work with any smart crafting system like applied energistics.\n\nTo craft your next basic table, you should use the recursive recipe (the one that contains a basic table as an ingredient) instead of the basic one.\n\n1. Make a crafter from RFTools (others can work but this is the easiest). This table will require energy to run.\n\n2. Set the recursive recipe in the crafter using the + button from JEI. Or set the recipe manually I guess I\u0027m not your boss...\n\n3. Set the recipe to \u0027All\u0027 and \u0027ExtC\u0027. This will make it so the input table will always be in the input.\n\n4. Place your basic table in the input, and click the R button to remember the input slot for the table.\n",
      "icon:10": {
        "Count:3": 1,
        "id:8": "extendedcrafting:table_basic"
      },
      "name:8": "Recursive Recipes"
    }
  },
  "questID:3": 1293,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 8,
          "id:8": "extendedcrafting:material"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "rftools:crafter1"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:recursive_recipes"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}