{
  "preRequisites:11": [
    31
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oThere are many skills and abilities that can be levelled up!\n\nEach different skill has its own way of obtaining levels, but all skills past level 15 can be levelled using skill crystals!\n\n§fHere\u0027s another interesting case of magic! \nAs was recently discovered on Earth (man I miss it so much, especially pizza) the \u0027weight of the soul\u0027 many spoke of does hold some scientific veracity. This is what we call essence, a substance that is directly tied to the emergent property of life. Anything that is alive, and is capable of a will, even in the form of an instinct, can produce essence.\nOn earth, the main application for essence became animal farming. The ethics of it were questionable at best, but it ended up being a fairly environmentally friendly solution, and capitalism went with it!\nBut I\u0027m getting sidetracked; essence is not the only emergent substance of life, or at least here. \nThis is something I have not felt before, but since I arrived here I feel something else. Is this magic of the type that agrees to the laws of nature, or is it something that transcends them, the mythic type?\nI\u0027ll start categorizing it, and hopefully I\u0027ll stumble into some truths.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "aoa3:medium_skill_crystal"
      },
      "name:8": "Skillful"
    }
  },
  "questID:3": 15,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "aoa3:small_skill_crystal"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "aoa3:medium_skill_crystal"
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "aoa3:large_skill_crystal"
        },
        "3:10": {
          "Count:3": 1,
          "id:8": "aoa3:giant_skill_crystal"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "minecraft:rotten_flesh"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}