{
  "preRequisites:11": [
    272
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Among many other peces of advice provided by the Bees of Rhenia, they shared some information about the strange nature of some of the worlds I have encountered, the ones that do not belong to a planet, and are instead outside of the three dimensions of space.\nReality, even for higher-dimensional beings, exists in the normal three dimensions that every being is capable of perceiving. Outside of these, matter is not naturally present, but fields are; this includes phenomena like magnetism, and aura. \nBeings that naturally perceive these higher dimensions can move things in and out of them, but they cannot directly bring entire spaces short of by transporting ordinary stuff.\nTo create full worlds in these higher dimensions, much more power is required. This power, from what the bees know, exploits a fundamental principle of magic. They did not call it that, but I strongly suspect it may be recursion, based on my own research. \nThe ability to generate these spaces is limited to a select few, such as the elder beings of the abyssal worlds, the Aesir, and, most importantly, the Twilight Horde and the Shyre Empire. ",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:spatial_phaser"
      },
      "name:8": "Higher-Dimensional Phasing"
    }
  },
  "questID:3": 1818,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 16,
          "id:8": "contenttweaker:intense_meatball_pasta"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:spatial_phaser"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:puzzle_solution_spatialphaser"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}