{
  "preRequisites:11": [
    271
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Someone else, likely long ago, truggled against the Shyre Empire in the Deeplands. Whoever this person was, they were not successful, but they nevertheless left a useful legacy.\nThis warrior seemes to have wielded a powerful type of metal-manipulation magic, which allowed them to shape, move, and even fuse magnetic matter. This being likely ascended in a way similar to the wizard of Iceika, but successfully, and was able to shape the world around themselves into creature that are themselves capable of some degree of metal-manipulation. These are the grottols now wondering the Deeplands; they likely travelled through the portal their master opened to the Shyre Empire, found themselves in a favorable habitat, and eventually became a staple of the local fauna.\nAfter the Shyre Empire did their thing, though, this once-foe was twisted into madness, and was left as a husk, aimlessly wandering through the Deeplands. The Empire likely wanted to manipulate them into servitude, but could not, and instead just broke its mind, and, tot meing able to use their power, went on ignoring them.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:wrought_summoner"
      },
      "name:8": "Wrought Summoning"
    }
  },
  "questID:3": 1965,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 100,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 100,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:deep_metamorphic_rock"
            },
            "TrophyName:8": "Deep Metamorphosis",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:wrought_summoner"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:puzzle_solution_deepmetamorphic"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}