{
  "preRequisites:11": [
    2127
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "...And indeed it is that there is someone else serving the Meatball Man and leading the dread. \nThe dread queen is powerful, very powerful. Her powers revolve around directly rising corpses as intelligent and independent agents, capable of full-fledged sentience.\nHer control over the dread is based purely on the willingness of the dread to be governed; if they refuse to comply, they are eliminated, if they accept to join the Efforts of the Meatball Man, they are deployed in a a variety of hotspots as the eyes and ears of the leader of the undead.\nWhile the alliance between the Dread Queen and the Meatball Man is one out of convenience, there seems to be some sense of mutual understanding between the two.\n\"You don\u0027t know the weight the master bore, everyone gets fed up of serving, sooner or later\"\n\"Eternity is a long time, and it is a matter of time before one tries to excape their destiny\"\nIt seems like both of them may have run away from some task or assigment. I am inclined to think the Meatball Man used to be some sort of jailer of the damned, and I want to believe the Dread Queen was too, but something, some happening pushed them over the edge.\nWhat this task may be, I am not sure, but I strongly suspect it may be what started the conflict with the arbiter.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:dread_crown"
      },
      "name:8": "The Dread Queen"
    }
  },
  "questID:3": 2129,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 100,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 100,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:dread_crown"
            },
            "TrophyName:8": "Yas (Dread) Queen",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:dreadful_shard"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:dreadful_prison_key"
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:dread_crown"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:puzzle_solution_icydreadshard"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}