{
  "preRequisites:11": [
    202
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oMake this to find locations in the twilight forest.\nThe normal progression gating in the dimension is disabled, but the quests will have a thematic order.\n\n§fThe Twilight Forest, a tidally locked planet in a far (far) away system. This is where Terra crabs are from. Oh and the crimson cult too, well, I think? They are a mysterious bunch, and they aren\u0027t too keen on sharing details.\nAnyhow, the nature of this planet is very peculiar. Being tidally locked, like the moon of earth, part of the planet is always illuminated, and part of it is always in darkness. Worlds like this one have been observed extensively by many space telescopes, but it feels unreal to be actually here. Do I miss my family, my friends back on Earth? Absolutely, but I guess I am happy I got to see this place, so different, so beautiful, and a part of me is glad I got to experience this, even if it meant losing my loved ones.\nWhile the bright and dark of the planet are likely too hot and too cold to be survivable, there exist areas of eternal twilight, neither day nor night, where the climate is favorable, and where life can flourish.\n",
      "icon:10": {
        "Count:3": 1,
        "id:8": "twilightforest:magic_map_empty"
      },
      "name:8": "Magic Map"
    }
  },
  "questID:3": 216,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "twilightforest:twilight_sapling"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 1,
          "id:8": "twilightforest:twilight_sapling"
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 2,
          "id:8": "twilightforest:twilight_sapling"
        },
        "3:10": {
          "Count:3": 1,
          "Damage:2": 3,
          "id:8": "twilightforest:twilight_sapling"
        },
        "4:10": {
          "Count:3": 1,
          "Damage:2": 4,
          "id:8": "twilightforest:twilight_sapling"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "twilightforest:magic_map_empty"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}