{
  "preRequisites:11": [
    260
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "As the transformation started, as the Crimson Cult unveiled their true intents, an oath was forged. \nA powerful bee, who had the magical ability to open up portals into new worlds, decided to to devote herself to help out the dwindling forces of the Twilight forest. Opening a portal to bring in a champion from a different world, one that would not be affected by the transformation spell.\nThe oath was forged, and the portal setup, and yet, mere moments before it opened, the Crimson Cult came in, and put an end to the ritual.\nBees, from what I have seen, have a very strong code of honor. It was probably her who led the now transformed crabs to Terra.\nEven now, corrupted and turned into a creature of darkness, the one who was in charge of performing the ritual, still held on to the ritual materials. If this being alone could remain faithful to this mission, so I too will persevere.\nThis immortality I have, this recursive cycle of life and death, is a way to right the wrongs I see around me, to fight for those that could not keep up with the shameful masters of their fate.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:broken_oath"
      },
      "name:8": "Failures and Oaths"
    }
  },
  "questID:3": 2228,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:broken_oath"
            },
            "TrophyName:8": "Almost Isekai",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:broken_oath"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:crepuscular_callstone"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}