{
  "preRequisites:11": [
    243
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oFound on the bottom level of the mazes in swamp biomes. The maze map may help you at finding it.\n\n§fThe surface of the Twilight Forest, as I previously noted, exhibits the signs of a once-prosperous society fallen to ruin. Well, the underground of this world may give a bit more insight. I was able to locate the entries to many underground mazes (again, what\u0027s with these people and building mazes), and they are more well-preserved than the surface structures.\nWell-preserved, and well-inhabited. Minotaurs, actual minotaurs inhabit these mazes, how fitting! Oh and giant bugs too!\nAre they related to the ones from the Erebus world? Maybe? It feels safe to assume that the crabs of Terra somehow stunbled into portals to escape the twilight forest, so I would not exclude the same happening for ending up into this strangely melancholic world.\nMy gut tells me that\u0027s not the case, though. The maze is clearly built with a purpose, to hide, and to imprison, and if I were a maze builder I would definitely want to keep those bugs as entrapped as possible. Although it is still possible that these bugs are just part of colonies formed by a few that initially stumbled there by accident.\nRegardless, the maze was built to imprison the mushroomy beast found in its core. What came first, I wonder, the monster, or the labyrinth?",
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 6,
        "id:8": "twilightforest:trophy"
      },
      "name:8": "Into the Maze?"
    }
  },
  "questID:3": 251,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "twilightforest:minotaur_axe"
            },
            "TrophyName:8": "Minoshroom Slayer",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 6,
          "id:8": "twilightforest:trophy"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}