{
  "preRequisites:11": [
    251
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oFound in the center of the fire swamp biome.\n\n§fA fire-spewing hydra! Yes, I love it! The fact that I think this is cool is not problematic at all, trust me!\nThis encounter does provide more information about the possible nature of whatever \u0027accident\u0027 left this world in its current state. \nUnlike the other monsters I fought, this one is not encased by an architectural barrier. Instead, it is surrounded by pure destruction. There are no signs of an attempt to contain it, which was the case of the lich and for the minotaurs. This leaves two possible explanations, as far as I am concerned. It could be that the \u0027prison\u0027 built for this creature was so weak it got completely annhilated, or it could be that the coming (or the creation) of this beast was unforseen.\nSeeing so many other containment structures built to entrap monsters suggest that the builders of said structures were somewhat \u0027ready\u0027 to face them. Building a large tower takes time, resources, supply chains, people, and many other things. The people of the twilight forest were ready to face the other monsters I have met so far. \nNot this one, so it probably means the hydra was one of the first to show up. \nOr I may just be grossly misconstructing things.\n",
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 2,
        "id:8": "twilightforest:trophy"
      },
      "name:8": "Fire!"
    }
  },
  "questID:3": 253,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "twilightforest:fiery_blood"
            },
            "TrophyName:8": "Fiery Hydra Slayer",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 2,
          "id:8": "twilightforest:trophy"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}