{
  "preRequisites:11": [
    258
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oFound in the skies around the thornlands.\n\n§fSomeone tried to fight back, to stop the spread of the mythological transformation. Deep in the caves, hidden massive giant boulders, I found the Lamp of Cinders. This artifact is somehow capable of breaking through the properties of the powder by burning it. The unfortunate side effect? Burning things does have a tendency to kill them, or at least hurt them. \nWhatever the plan to use this artifact may have been, it is safe to assume it did not succeed. It\u0027s range is quite limited, and it does require manual operation, so could it be that the powder spread fast enough that in that time only one lamp was built? \nOr was it something else completely? I was only able to find this because the soil felt \u0027different\u0027 there. It does feel strange that all other \u0027prisons\u0027 in this world have a recognizable landmark on the surface, while this one does not. \nThe Crimson Cult dominates the skies now, is it possible that this lamp was hidden from them? Was the Crimson Cult around back then?\nAnd yes, I am definitely feeling more mythical! Giants bearing my image now roam the land. I am not sure what to make of it.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "twilightforest:giant_pickaxe"
      },
      "name:8": "Giant Stuff"
    }
  },
  "questID:3": 259,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "thaumadditions:mithrillium_ingot"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "twilightforest:giant_pickaxe"
            },
            "TrophyName:8": "Giant Me Slayer",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "twilightforest:lamp_of_cinders"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}