{
  "preRequisites:11": [
    260
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oUse the harbinger callstone to summon the dungeon!\n\n§fThe Crimson Cult are truly a dreadful group. An entire world, filled with curious people, annhilated by their schemes.\nThey are a religious cult, and they worship the figure of the Crimson Emperor, who seems to be an actual person; probably a wizard powerful enough to surround themselves with enough power to ensnare others.\nHow do I know this? Well, I think I found what the people of the Twilight Forest were protecting in their last stand. Saplings of a very special type, infused of incredible magical power, and capable of changing the world around them. Very similar to the lore of the Tree of Life from medieval Christian tradition. \nThe Crimson Cult was holding these sapling in one of their fortresses, as if they were the results of their own blood, sweat, and tears.\nSadly enough, it seems to be the truth. Not only the people of the Twilight Forest were powerless in their attempt to protect the fruit of their labor (with the exception of the Lamp of Cinders), they were powerless in protecting their own free will.\nThe Crimson Cult had long infiltrated this society by the time they had even started their alchemical experiments. \nIt was all part of the plan, convince them to study alchemy, which is a science forbidden by the cult, gude their studies towards their own self destruction, and take the fruits of their labor afterwards. \nJust like that, a whole people traded for a bunch of trees. I do wonder if the invaders of Terra feel the same way about the Testificates.\nWell actually, some were able to escape, even under the everpresent eye of the cult. The crabs left, even as unintelligent creatures, who knows after how many years of exile, they brought me here, and I fought the cult.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:harbinger_callstone"
      },
      "name:8": "The End of a World"
    }
  },
  "questID:3": 261,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:starfield_gem"
            },
            "TrophyName:8": "More Crimson Cult Encounters",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:harbinger_callstone"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 8,
          "id:8": "twilightforest:twilight_sapling"
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 7,
          "id:8": "twilightforest:twilight_sapling"
        },
        "3:10": {
          "Count:3": 1,
          "Damage:2": 5,
          "id:8": "twilightforest:twilight_sapling"
        },
        "4:10": {
          "Count:3": 1,
          "Damage:2": 6,
          "id:8": "twilightforest:twilight_sapling"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}