{
  "preRequisites:11": [
    278
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "I cannot believe that none of my enemies have approached magic and Recursion with a Technology and Engineering mindset! And yet, it seems like I may be the first here to achieve mythic machinery! \nBut what is mythic machinery? Well, I am still figuring out the details, but the fact that Mythic and Recursive fields permeate various forms of matter can be used to make finely tuned machinery that maintains these attributes.\nThis is a great leap! The mythic void resource miners I built until now are like batteries built out of potatoes, a hint of what is possible, but limited in capability; the machinery I can produce now, though, that is like the industrial revolution! Mass production, standardization, and efficiecy!\nWell, there is one difference, the industrial revolution was brought forth by a fairly good understanding of electricity, magnetism, and how they interact; on the other hand, I still don\u0027t fully understand Recursion, I just use the effects it causes on the world.\nAnd to be fair, I am hardly the first one to build mythic machinery, the use of Fluix to produce matter-energy networks seems to come from the Arbiter. They seem to be gone, though, so I do not think I will be able to ask them questions for more insight...",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:mythic_machine_case"
      },
      "name:8": "Incredible Technology"
    }
  },
  "questID:3": 279,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:mythic_machine_case"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:mythic_machine_case"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}