{
  "preRequisites:11": [
    281
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "A lot of the mythic excavation I have been doing until now has been fairly accidental. Trial and error, that is all it was. Sure I tried to come up with my own theories, but they were based on quite limited information; at one point, I even thought alchemy was behind mythic magic.\nThanks to all the new materials I have collected, I was able to form a more cohesive theory, one that actually enstablishes a hierarchy between the various magic fields; because, yes, such a hierarchy exists.\nAll the fields of magic are emergent from more fundamental properties, just like the ability of living beings to produce offspring is an emergent property of chemistry. Not all molecules cannot produce more of themselves, but some that are complex enough can, and that is what we call life.\nSimilarly, magic emerges from a singular field. As part of this process, other forces of nature, existing at various level of complexity, ranging from simple electricity to complex weather patterns, become intertwined with these new emerging fields, and can be controlled through them.\nIf a magician is powerful enough, as I finally am, they can use these bonds between magic and natural phenomena to consciously alter their rules. This is mythic magic, the tool that will enable a new industrial revolution!",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:mythic_excavation_engine"
      },
      "name:8": "A new age?"
    }
  },
  "questID:3": 282,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:mythic_excavation_engine"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:mythic_excavation_engine"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:spinel_ring"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}