{
  "preRequisites:11": [
    283
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Simple attempts at repeating my feat of jumping from the Eden into Apalachia did not work out. Regardless of what traces I felt, all the wormhole threads I opened in Woldwood kept leading me back to Wildwood.\nAfter many failed attempts, it dawned on me. \nSpace, when observed as a field, which is what relativity does, exhibits all of the properties of mathematical functions, continuous and discontinuous alike. It has simple continuity (normal everyday space), singularities (those are black holes), jumps (those are wormholes), removable discontinuities (worlds like Arcana or Eden that exist separately from the rest of reality, I\u0027m calling these plane worlds), and asymptotic convergence (the boundary that separates Eden and Wildwood).\nBut that\u0027s not all, if these types of mathematical phenomena indeed exist in reality, it is plausible that others will too.\nAnd that\u0027s when I thought of essential discontinuities, waves that become more and more frequent, continuously changing value, yet unable to go beyond a certain point.\nThis is how the next world of the Twilight Horde was hidden. Infinite folds, each denser and more frequent than its predecessor, increasing in number faster and faster, and yet bound by a barrier.\nA barrier I can now cross. Onwards to Apalachia!",
      "icon:10": {
        "Count:3": 1,
        "id:8": "divinerpg:wildwood_block"
      },
      "name:8": "A Fold within a Fold, within a Fold"
    }
  },
  "questID:3": 284,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 4,
          "id:8": "contenttweaker:wildwood_star"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "divinerpg:wildwood_block"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}