{
  "preRequisites:11": [
    284
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Recursion, as I have said many times now, is bizzarre. \nAt its basis, it does not originate from any other, more fundamental concept or force. Recursion, to my knowledge so far, just exists independtly of anything else, and while the entirety of magic appears to originate from it, the field of recursion cannot directly be extrapolated from its \u0027children\u0027 fields like vis, will, or mana. \nRecursion, as a fundamental force of the universe, became evident to me only after encountering it directly by witnessing beings and objects that are permeated by it. For all intents and purposes, this seems to be the way most have come by this power.\nAs soon as the process of atomic fission was discovered, multiple parties started rushing to turn it into a weapon, the atom bomb; this seems to follow a similar pattern. When a certain truth becomes evident, those seeking a certain type of knowledge will gravitate towards a particular path, independently of each other.\nConceptually, to make sense of Recursion, you need to have seen it in practice first. The discovery of Recursion is a recursive process itself. Having encountered recursion, even in insignifacant ways, is a requirement for ascending. The recursive abilities of the WIthers come from Testificate magic that originated after using Fluix, the Recursive properties of which come from the Arbiter, a Recursive being itself. Same for many of my friends and foes; their mastery over recursion originates from having encountered it by mistake, or by design of already-recursive beings. \nStill, there are some \u0027geniuses\u0027 who discovered it on their own. The power of the Queen of all Bees, I was told, was a completely new discovery, and that is why Terra\u0027s enemies took it away, in the only recorded event of them doing something together.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:apalachia_core"
      },
      "name:8": "Apalachia Falls"
    }
  },
  "questID:3": 285,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:eternal_shoulder"
            },
            "TrophyName:8": "Eternal Archer Slayer",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:apalachia_core"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}