{
  "preRequisites:11": [
    280
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The question about the motivation beind the Meatball Man\u0027s alliance with the arthropods makes a bit more sense now. The magic of the Erebus does have something useful to offer.\nThere seem to be restrictions, but a special species of insects, infused by powerful magic, is capable of absorbing and replicating materials in ways similar to bees and chickens.\nThe Meatball Man clearly wants to use them for some purpose, to mass produce something...\nI have no idea what that could be, but I better keep my eyes open, I could discover something useful, either a new powerful material, or an insight on what the mission of the Meatball Man could be.\nIt is clear he sees me as some sort of \"chosen one\" for something; what puzzles me is that he is the one that gave me powers in the first place, and he is now refusing to meet me face to face. If he did not bind me, I would not have been even capable of doing what I am doing now, which is fighting him.\nThat faithful moment when I entered the wormhole, was that what marked me, or was it something that came long before that?",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:branch_of_life"
      },
      "name:8": "Branch of Life"
    }
  },
  "questID:3": 471,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 4,
          "id:8": "extrautils2:compressedcobblestone"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:branch_of_life"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:puzzle_solution_branchoflife"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}