{
  "preRequisites:11": [
    492
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Yes, I was correct. Voxxulon was the one behind the nitrate-based artificial life in Creeponia. A once \u0027normal\u0027 world, an entire biological framework and ecosystem, has been morphed and forever changed by a single being.\nAfter seeing so many of these types of world-wide transformation, though, I think I finally understand more about the rules of this type of magic, of this type of recursive power. Yes there are rules.\nA transformation of this type can only happen in two ways.\nThe first, accident; one who seeks to ascend, to gain control over recursion in some way, needs to have a cartain amount of knowledge and control, and lots of it. If that is lacking, the unleashed recursion has nowhere to go, and it latches on to whatever is around, changing it forever. Given the massive amount of magical power required to start this process to begin with, it going wrong generally means the end of a planet. Iceika is an examples of this. \nThe second, an agreement. To be changed into something that you are not by a recursive being, you need to accept it, you need to be willing to follow. Thankfully, these types of transformations cannot be used as a weapon against enemies, as they will not be willing to follow. Creeponia is an example of this. I do wonder what was promised to the, though.\nThe people of Barathos and Precasia followed because they had met their deities; is this what convinced Creeponia tu turn into a people of suicide bombers? Blindly zealous religion has been used by the Syre Empire, so I would not put it past them.\nNow that I think of it, there are other people that seem too \u0027attuned\u0027. The Testificates are incredibly in touch with magic and worship the Arbiter; the Realmshifters have incredibly unique dimensional-warping abilities and worship a Trinity; did they agree to be changed by similar powers too? ",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:vox_ponds_garnet"
      },
      "name:8": "Vox Ponds Garnet"
    }
  },
  "questID:3": 491,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 4,
          "id:8": "contenttweaker:vox_ponds_garnet"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:vox_ponds_garnet"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:vox_wormhole"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}