{
  "preRequisites:11": [
    272
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oIs that a One Piece reference?!?\n\n§fIt seems like I am not the first \u0027champion of the bees\u0027 that has come to this planet. And my predecessor has left a weapon.\nIn typical Bee fashion, they did not whish to reveal this right away, I had to prove my worthiness, but after passing this new trial, I was given some useful information.\nThe powers of my enemies are some of the mightiest in the whole universe; while this is quite terrifying in and of itself, it also means that encounters with these powers have been thoroughly documented through encounters over the ages. With the data of thousands of matchups from various magic and technological wars, some clear trends emerged.\nWhoever wants to compete face on with true universal power like the one from the Twilight Horde has to gain comparable power themselves, there is no way around it. Might, in the vast majority of documented encounters, has always trumped inventiveness and strategy. \nTo achieve this type of might, also according to these extensive records, specific steps need to be followed. The first of them, the Bees of Rhenia told me, is the recursive immortality I possess. The second is a powerful weapon, capable of cutting through recursion. The next ones, I will discover later.\nThe bewitched bow from the lore of Terra is capable of doing this, but to face truly mighty recursive beings, other weapons will be necessary. One of such weapons, they told me, is the one left by their, now fallen, ally of old.\nIt will not be enough to get to the end of this war, but it is a necessary step to achieve higher heights, or so I was told.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "extrautils2:lawsword"
      },
      "name:8": "Relic of a Past Warrior"
    }
  },
  "questID:3": 510,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "minecraft:enchanted_book",
          "tag:10": {
            "StoredEnchantments:9": {
              "0:10": {
                "id:3": 101,
                "lvl:2": 3
              }
            }
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "extrautils2:lawsword"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:puzzle_solution_kikoku"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}