{
  "preRequisites:11": [
    1597993732
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "While I was focused on the invaders of Terra, their armies, and their flamboyancy, I should\u0027ve spent more time looking at politics. If the knowledge of a single leap in destructive power, the atom bomb, was enough to throw earth into a crazed period of cold war, with all of its subterfuge and spying, one could assume that similar things may happen if much larger powers were to be discovered, or encountered in others\u0027 hands.\nThe \u0027big players\u0027 like the Shyre Empire know they are the strongest, so they showcase their powers, knowing that very few can match it. This doesn\u0027t necessarily explain what\u0027s going on with their campaign on Terra, and I am sure they too are playing some sort of political game, but that\u0027s another discussion. What interests me are the \u0027medium players\u0027, those that don\u0027t show their hand right away. The Crimson Cult and J\u0027zahar are good examples of that. How powerful are they? Could they rival the Twilight Horde? Are they actually powerful? Or are they just influential?\nKeeping an aura of mystery appears to be the way the game of power is played in this universe. You want to let your enemies know you are powerful, to avoid direct confrontation, but your exact reach and capabilities should remain hidden, in case your enemy is indeed stronger than you.\nThe Gun Devil, the hand that rules over Falacer, is good at playing this game, so much so that the bees have complied with him, not knowing what this creature would be capable of.\nAnd what about the Meatball Man? He has been open during all of our interactions, and yet, I can\u0027t shake off the feeling there\u0027s something more. He too is playing this game, which may be a good sign.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:falacer_spinel"
      },
      "name:8": "Secrets of Falacer"
    }
  },
  "questID:3": 714,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 100,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 100,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:falacer_spinel"
            },
            "TrophyName:8": "Queen of the Gun Devil",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        },
        "1:10": {
          "Count:3": 4,
          "id:8": "contenttweaker:falacer_spinel"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:falacer_spinel"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:puzzle_solution_falacer"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}