{
  "preRequisites:11": [
    1597993732
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "A world of mushrooms, cows and, demons! Nice!\nAt some point in Terra history, the testificated screwed up (never heard that before), and their negligence summoned forth a horde of demons.\nThe bees of the past, though, were able to banish these demons, and imprisoned them to Haumea, where they are now being kept, until someone would be powerful enough to exorcise them.\nLooking at this event, it is interesting to note how in this story the Testificates were quite weak, and the bees were powerful helpers. While exploring the Deep Dark caves, I have met demons more powerful than the ones on Haumea, and they were properly jailed using \u0027normal\u0027 testificate magic, with no outside help, as far as I know. Bees, on the other hand, while being very resourceful, do not strike me as the mighty type that would start a demon prison on a planet in the outskirts of a star system. \nOne bee in this place surprised me, though. The same \u0027sixth sense\u0027 that made me aware of the dangers of the Meatball Man went off. Not in the same way, but it is evident that bees have, or at least used to have, power. Lots of power.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:haumea_spinel"
      },
      "name:8": "Secrets of Haumea"
    }
  },
  "questID:3": 719,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 100,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 100,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:haumea_spinel"
            },
            "TrophyName:8": "Mark of the Beast",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        },
        "1:10": {
          "Count:3": 4,
          "id:8": "contenttweaker:haumea_spinel"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:haumea_spinel"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:puzzle_solution_haumea"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}