{
  "preRequisites:11": [
    50178
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oSalt reactors are used to process fission fuels and to heat NaK fluids, which can be used to generate power using a heat exchanger and a turbine.\n\nSee the multiblock preview for a preview of the exterior frame of a salt reactor.\n\nTo function, a salt reactor needs cooling, done through NaK fluids, and fuel, all of which follow proximity rules similar to fission reactors.\n\nInside a salt reactor, fluids are transported using coolant heaters (for NaK) and fission vessels (for fuel). These act similarly to fluid pipes, with a few extra rules.\n\nSimpler designs use fuel flowing from end to end, but if fluids can be properly handled, coolants and fission vessels can be placed anywhere within the coolants\u0027 rules. \n\nThe rules for a given coolant vessel depend on the fluid flowing through it and are the same as their solid fuel counterpart, e.g. NaK-Redstone filled coolant heaters have the same placement rules as passive redstone coolers.\n\nRight click each face of a vessel and coolant heater with an empty hand to change its input/output mode. Shift right click lets you change the opposite side.\n\nYou can place a new vessel with a copy of the settings of a previous vessel by shift right clicking it with a vessel to place (this can bug out unfortunately).\n\nThe easiest way to build a salt reactor is to configure a single layer of the interior setup first (starting from the middle block), followed by shift-clicking the next layers, and to build the outside frame at the end.\n\nTo connect two vessels (or coolant heaters) they should have FUEL SPREAD (or COOLANT SPREAD) on their exit face, entering a DEFAULT face. \n\nTouching coolant and fuel lines with different fluids should have DISABLED on touching faces.\n\nTo feed fluids from outside a salt reactor, vessels have to be connected to vents, both on the input and output side. \n\nTo connect a vessel (or coolant heater) to the output vent it should have DEPLETED OUT (or HOT COOLANT OUT) on the face touching the vent.\n\nFor each of the fuel byproducts required in progression, multiblock previews for interior reactor designs are provided. These will show an individual cross section that can be stacked into any length.\n\nIf NaK coolant is absent from inside the reactor, or if fluids cannot freely leave the reactor, it will melt down, making even more radiation. Make sure you are making plenty of coolant, and have a way to circulate it quickly.\n\nUsing a heat exchanger, it is possible to fully recycle NaK fluids, allowing for closed-loop designs.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "nuclearcraft:salt_fission_controller"
      },
      "name:8": "Salt Reactor (OK)"
    }
  },
  "questID:3": 50275,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "nuclearcraft:salt_fission_controller"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "nuclearcraft:salt_fission_wall"
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "nuclearcraft:salt_fission_frame"
        },
        "3:10": {
          "Count:3": 1,
          "id:8": "nuclearcraft:salt_fission_vent"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}