{
  "preRequisites:11": [
    90095
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oEvery Xnet system requires a controller, a connector for each inventory you want to interact with, and network cables to connect them.\n\nThe controller requires power, which should come from an external source (flux point my beloved). Do not power your Xnet controller with an Xnet connector, it will cause lag.\n\nFor conduits and ducts, each individual connection is handled independently. For Xnet, each connection to other inventories in handled by the controller GUI. \n\nAll inventories that have connectors and valid network cable connections will show up on the controller. You can double click an inventory to see its location in-world.\n\nA single Xnet setup can do up to 8 functions at the same time, described by 8 channels, corresponding to the columns in the GUI.\n\nEach channel can be configured to do:\n\nEnergy transfer: set individual inventories as energy inputs or outputs, useful for powering single-block machines that also need item automation.\n\nItem transfer: set individual inventories as inputs or outputs of specific filtered or general items; you can specify what sides to interact with for sided machines like furnaces.\n\nLogic (redstone): you can add sensors (produce redstone if chest has over X amount of item A); additionally, both item and energy channels can receive logic signals to turn on/off their function (move item B if receiving redstone signal); logic (redstone) channels can be colored as well to operate independently.\n\nFluid transfer: it\u0027s bugged, don\u0027t use it\n\nRFTools: combined with the storage interface from RFTools, you can make mini AE2 networks.\n\nComputerCraft Plethora: you can interact with computers.\n\n\n\n",
      "icon:10": {
        "Count:3": 1,
        "id:8": "xnet:controller"
      },
      "name:8": "Controller"
    }
  },
  "questID:3": 90110,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "xnet:controller"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}