{
  "preRequisites:11": [
    310
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The master of Darkness, the cause for so much pain. A person who has secretly manipulated countless civilizations into self-destruction, all for the sake of goals I could not even hear.\nWas it just the desire for power? Influence? Was it just for fun?\nI would not be surprised if the entire existance of the Crimson Emperor was just scheming. \nTo face the Emperor, a being so powerful, influential, and yet so unscrutable, was a strange experience.\nSomeone who has been so succesful at hiding their influence, that I do not even know what they did, or why. I feel like I should have stronger feelings, even from what I know I confronted someone who has committed crimes as grave as the Shyre Empire; and yet not fully knowing brought a strange feeling.\nIt\u0027s not remorse, not quite. \nIt\u0027s that, for basically all of my opponents until now, I knew of the suffering they caused, first hand. I heard the stories. I witnessed the effects of their depraved actions. For this situation, all that I have seen firsthand are the ruins of the Twilight Forest.\nI feel like it should be someone else to enact this vengeance. \nI know the utilitarian in me knows that there are probably many lives I am improving with my actions, but I still feel like an executioner here.\nWell, I hope that this may bring some peace to the lives this wretched monster has ruined.\nOn this day, crimson rivers flow. On this day, the crimes of the Crimson Cult are avenged. On this day, the Crmson Emperor falls.",
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 309,
        "id:8": "contenttweaker:material_part"
      },
      "name:8": "Let the Crimson Rivers Flow"
    }
  },
  "questID:3": 1384,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:akathartos_callstone"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:crimson_ichor"
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 309,
          "id:8": "contenttweaker:material_part"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}