{
  "preRequisites:11": [
    312
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The fear is strong. So, so incredibly strong.\n\nI thought it was my ascension that brought detachment, but that is not the case. Even fractallites can succumb to the Recursion of Fear. Hell, at elast one has ascended as a consequence of the Recursion of Fear.\n\nHere is a fun tidbit. I represent a great power in the universe, possibly one of the greatest powers in the universe. And yet I can still be wrong, and this is an example of it. I am a Fractallite, but being a Fractallite has nothing to do with my detachment from the Recursion of Fear.\n\nWhat sets me apart from this fear, I think, is the journey I have endured; the people I have faced; the wrongs I have witnessed; the crimes I could not avenge. After all of this, fear, no matter how strong, is just fear, just one of many feelings I spent countless hours shutting down, fighting, repressing, accepting, refusing, refuting, embracing...\n\nFear, after all I have seen, makes sense, even in this form.\n\nBecause of my history, I believe to be privileged for being here and not being pushed into a well of madness...\n\nThe Great Snake, on the other hand, did not share my luck. This creature, born of Pauram, witnessed the origin of the Recursion of Fear. It contributed to the birth of Blood Magic, and now, having traversed the path to ascension, all while being victim to the Recursion of Fear, it is likely the most powerful agent that can wield it.\n\nFear, just like all things, eventually ends. And so the Great Snake will end too...",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:hihi_irokane"
      },
      "name:8": "The Greatest of Snakes"
    }
  },
  "questID:3": 1385,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:pauram_callstone"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:droplet_of_the_great_snake"
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:hihi_irokane"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}