{
  "preRequisites:11": [
    1198
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Not being told about the secrets of filling a planet with taint does sting a little bit I won't lie. After what I was told, I believe I am conscientious enough to not use this power; I just want to know more about this universe I am part of. I want to make sense of it.\nI do appreciate that I was told about a way to remove flux, though. Not only it is useful, but the knowledge of this provides good insight about the way the thumic fields operate.\nThey are not an inherent property of space, meaning that not every place in the universe will have aura or flux. In that sense, they operate similarly to how the electromagnetic field operates; to have it you need a source, like a magnet, or something very very hot. \nMost of the universe, though, experiences the fields of aura and flux, and this is because of the ability of these fields to push matter itself into a more stable equilibrium. For reasons that still do not make 100% sense, matter influenced by these fields becomes more 'organized' in some way, and itself it becomes a source of the fields. The process is very slow, and even slower at low field strengths, from what I am seeing, but it makes it so that, starting from a single source of aura for example, the whole universe will eventually turn into a source of aura.\nThis process can be boosted by some properties of nature, and the trees in some forest on Terra seem to be able to do that, but it can also be stopped and even reverted.\nThis sponge I recently been told of is a recursive object, expressing a magic I would call mythic, that can halt the spreading of flux.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "thaumcraft:creative_flux_sponge"
      },
      "name:8": "Flux no more!"
    }
  },
  "questID:3": 1397,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 200,
            "TrophyColorRed:3": 200,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "minecraft:sponge"
            },
            "TrophyName:8": "全部净化！",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "thaumcraft:creative_flux_sponge"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}