{
  "preRequisites:11": [
    2254
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "This world, as it is now, is a trial for the Ascended. The One that is Worthy, likely the fractallite brought forth by the Gallifreyans, is the unseen ruler of this world.\nThe freedom granted to the Ascended, while allowing for a universe that is just, opens up the possibility of evil beings gaining incredible power, as is shown by the actions of the now defunct Shyre Empire and Twilight Horde.\nAs a sort of balancing mechanism to the unstructured nature of fractallite power, Gallifrey exists to place some bounds, albeit limited ones.\nThe ascended are called to this place, but it is up to them, up to us, to heed the call, and to face the trial. The prize of this trial is not power, it is awareness, true conscience of one\u0027s self. Thus, the trial is not just the challenge itself, it is the willingness to face the challenge even when nothing is apparently gained from it.\nAnd that is how a Fractallite\u0027s faithfulness to their mission is tested. This is how the awareness gained in Vethea can be maintained. As I witnessed, the call to give up is everpresent, and it is up to us to keep on the struggle, not despite our humanity, our finiteness, now touching the infinite, but because of our humanity, because of our finiteness.\nThe one who does not abandon the mission, the one who is worthy, is the one who keeps on embracing themselves as they truly are. \nOnly someone who is capable of this can learn their True Name, spoken in the True Tongue where no lies remain hidden. This is the trial of Gallifrey.\nIf I am to succesfully embrace my Mission, I must know who I am, I must fulfill the rest of the prophecy shared between the Arbiter and the Meatball Man.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:true_name"
      },
      "name:8": "True Name"
    }
  },
  "questID:3": 1503761052,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:true_name"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}