{
  "preRequisites:11": [
    1199
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The pact between the Meatball Man\u0027s Undead and the Arthropods was not as even-sided as I thought.\nMany among the bug civilizations were in favor of dealing with the Lord of Gluttony, but few groups, not trusting his word, were opposed to this deal.\nAs a civilization built on collective agreement, neither faction could get the upper hand on this argument, and a clean vote was never reached. This did not deter those that were favorable towards the meatball man, who forced for a favorable vote from the other bugs by allowing undead troops to enter the Erebus.\nAs expected, betrayal hid behind this facade of formality. Recursive barriers, similar to the recursive prison that prevents me from looking for Earth, prevented bugs from performing certain actions that would go against the wishes of their now \u0027allies\u0027.\nA curse that, just like mine, revolves around imprisoning will itself.\nAs an attempt to break this curse, they came up with a way to circumvent its restriction. In a crude and cruel way. \nBy fully removing will, it was possible to empower warriors to be free from the threads of the Meatball Man. Mindless fighters, not too dissimilar from the Cyclops. Hollow warriors, for whom both I and the Meatball Man are enemies.\nFreedom, a right so sacred that the possibility of hurting loved ones becomes freferrable, if it allows for the chance to regain it. \nWill I dare do the same, if it turned out that my prison is as unbreakable as their? That the only way to escape it is to lose myself, and become a mindless weapon, hopefully causing more damage to my enemies than my allies?\nNo, this cannot be the only way. It must not be the only way.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:pale_metal"
      },
      "name:8": "The Hollow Resistance"
    }
  },
  "questID:3": 1701419918,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:hollow_stag_callstone"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:pale_metal"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:puzzle_solution_hollowstag"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}