{
  "preRequisites:11": [
    364
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "A relic. A living relic. \nAnd a new ally.\nThe Time Lords, the long-gone people of Gallifrey were not too dissimilar from the Arbiter\u0027s civilization in Lyndenwyrm.\nShining bright, they formed relationships with many other powerful people, including the bees, with whom they formed long standing relationships.\nNo, not long standing, everlasting, even so long after their fall. A trust, and an admiration spanning for millenia. For their sacrifice was too great for their story to remain untold. A story, that the bees are now willing to share with me. \nAnd with the story, an admonition.\nPower alone, ironically, holds little power. It has not been uncommon in the Universe\u0027s history that Fractallites abandoned their mission. The Soul Fiend, Xxeus, the Meatball Man, why did they rebel? Why would someone granted kinship with the Infinite and up forsaking it?\nThat answer, the Time Lords\u0027 fall says, is the impetus of mortality, the presumption, born from finiteness, that seeking Infinity will ultimately answer all of our question, that it will bring us peace. \nSitting at the top of the Universe, alas, is not enough for our endless thirst. Whether it be knowledge, love, time, pleasure, we always desire more; yes, even when Infinity calls.\nThe fall of the Time Lords, their sacrifice, is one born from unquiet desire, a thrirst so strong to bring one of its members to madness. A madness that, coupled with the knowledge and power of an Ascended people, led to a confrontation that could only end one way. Mutual annhilation.\nThat is the impetus of Worthiness that permeates Gallifrey. The deity of the Gallifreyan tribes, the second sun, come after their fall. The will of the Time Lords, made recursion, lives on, and calls all who hold power to look inward, to become aware of their desire, to acknowledge their humanity, and to reconcile themselves with Infinity.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:strange_stone_callstone"
      },
      "name:8": "Strange Bees, Strange Stone"
    }
  },
  "questID:3": 1979802923,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:strange_stone_callstone"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}