{
  "preRequisites:11": [
    1917606412
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The enemy that brought the Dragonslayers to Mysterium, after all, is not the Shyre Empire itself. Not directly.\nThe Dragonslayers seek to put an end to one of the informants that, while remaining independent, acts as a proxy for the espionage network of Mysterium.\nInformant is not the right word, it makes this demon seem like a simple spy; this creature is a twisted, violent being, who wields blood magic as a weapon. A weapon that, if my understanding is correct, has been wirlded mercilessly against the people the dragonslayers used to be.\nThe demon Alazoneia is not an Elder One, not quite, but it seems to be on its way to become one. It sure is more than willing to scheme, and to enter strange pacts and allieances, who knows for what hidden intentions.\nI came with the intention to face it, to help the Dragonslayers; I surely would appreciate new allies. And yet, I found myself enteringsome sort of strange pact, or a ritual of some sort.\nWhat did Alazoneia gain out of this? I cannot begin to fathom the motivations of this creature. \nWhat did I gain? Surprisingly, I did learn something, some new bits of blood magic.\nHas my standing with the Dragonslayers changed? I am not sure, I have not encountered any of them since defeating the Apostle. \nAre they hiding? Are they scheming? Did they run away?",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:everbloody_flask"
      },
      "name:8": "The Harbinger of Bloodshed"
    }
  },
  "questID:3": 2053473508,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:rite_of_bloodshed"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:marrow_of_alazoneia"
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:everbloody_flask"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}