{
  "preRequisites:11": [
    2141
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "This I did not expect! The truth of the people of Lyndenwyrm, in more ways than one, has everything to do about me it seems.\nCarved on the draconian headstone, the last remaining written document of this civilization as it once were, is the story of the demise of the Testificates, once rulers of Lyndenwyrm.\nYes, this is where the people of the Arbiter came from. This fact was only known to a handful, and because of the history of how this place fell, it was deemed best to forget about it.\nAfter becoming one with chaos, after gaining this uniquely impressive power, the Testificates of Lyndenwyrm were unwillingly catapulted into the politics and wars of the universe as a whole. One cannot shine so bright without being unnoticed, after all.\nDue to this, it became pretty much impossible for them to carry their naturally peaceful lifestyle, and because of this, they turned their chaotic powers towards detremental tools of warfare.\nFor the People of the Arbiter, though, it was already too late. Too many had heard of their powers, and too many were actively seeking it, despite the increasingly more deadly tools of warfare being developed every day.\nUnable to endure the suffering of his people any longer, the Arbiter made the decision to stage an end for the people of Lyndenwyrm, and to open for them a wormhole to their new home, Terra. This was the last recorded act of magic from the Arbiter, the destruction of a now empty Lyndenwyrm, turning it once again into an unremarkable world.\nSome of the dragons followed the Testificates, and while some kept guard over them and their secrets, others eventually evolved to the different conditions of Terra, and regressed into wild beasts.\nOthers yet, remained here, still faithful to the Arbiter, keeping the history of Lyndenwyrm alive.\nBut why did the Arbiter choose Terra? Were they not aware of the dimensional shards there?",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:ancient_wyvern_callstone"
      },
      "name:8": "The Ancient Wyvern"
    }
  },
  "questID:3": 2142,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:ancient_wyvern_callstone"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:headstone"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}