{
  "preRequisites:11": [
    2149
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The Oblivionnaire, the master of memory, ruler of the Abyssal Wastelands, the coralium monster, and the final agent involved in my imprisonment under the Meatball man.\nAs expected from a being with powers over memory, this being is extremely hard to track down, but once I did, I gained priceless knowledge from this monster.\nThe Meatball Man was waiting for me to do something, even after falling under this supposed trap that was laid out for me, and the Oblivionnaire was instructed to stop me from achieving this 'something', which I suspect may be reaching the Proxima Belt. What this tells me, is that I was expected to go off-script, in some way. \nWell, I did go off script, but not even the Oblivionnaire could do anything about this.\nWhat I find puzzling about this is the fact that someone had to absolve this role in stead of the Meatball Man. He is more than powerful enough to handle me, and he is clearly interested in me and what I can do as a potential force for order in the universe, and yet, he has given this seemingly important task to someone much less powerful than him.\nAnd it has backfired, as the Oblivionnaire is now defeated, and I successfully reached the Proxima Belt! My destiny is my own!\nYou hear me Meatball Man! My destiny is my own!",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:oblivionaire_callstone"
      },
      "name:8": "The Spectral Dragon Tamer"
    }
  },
  "questID:3": 2150,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 100,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 100,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:primordial_catalyst"
            },
            "TrophyName:8": "Oblivion Tamer",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:oblivionaire_callstone"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:coralium_eye"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}