{
  "preRequisites:11": [
    2169
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Yes, power over will, power over the priorities of living beings. That is the power of the Experienced Cori, and the glue that holds the Twilight Horde together. Just like ants and bees live to serve their Queen, the beings of the Twilight Horde serve one master, and one master only. A master capable of bringing in more subjects through its mere presence.\nWell, that is not exactly accurate; to be able to affect others\u0027 willpower, the Experienced Cori has to make itself vulnerable in some way, which is why it was hiding within the depths of Terra.\nThanks to this, I was able to stop its ritual, or whatever it was doing to ensnare the Testificates. With regards to \u0027freeing\u0027 the rest of the Horde, though, very little would likely be doable. They are simply too faithful, and have been under this creature\u0027s control for too long. Submission to the Twilight Horde is literally an instinct for the non-sentient beasts of the Twilight Horde.\nAs for the sentient ones, they appear to have restored communications to the world that is beyond Skythern. I guess I am not done with them yet.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:soul_of_colonial_servitude"
      },
      "name:8": "Simp Army OP"
    }
  },
  "questID:3": 2168,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 100,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 100,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:will_ensnaring_fabrial"
            },
            "TrophyName:8": "Squirrel In My Pants!",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:soul_of_colonial_servitude"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:ensnaring_soul"
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:will_ensnaring_fabrial"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}