{
  "preRequisites:11": [
    364
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The nature of this world is strange. After seeing the Mythic Shells, I should not be surprised to see a planet and a whole system that appears to be completely artificial.\nA binary system encircled by an unnaturally large planet, which is in turn encircled by a small black hole. yes, this alone is fascinating.\nThe creation of this place is ancient, coming from a great power, one that is different than the one that currently inhabits it.\nYes, the true people of Gallifray are not the ones who rule here. Despite holding on to unfathomable power, they live in tribal societies, spread out and living in small settlements, each with its own rites and traditions.\nWhat all these tribes share, though, is the cult of worthiness, taking the form of a sun mask.\nGiven the unwillingness of the Gallifreyans to cooperate, I am mostly guessing here, but from what I have seen of their cult, I can try to piece together a story.\nWhile these tribes are not the wielders of this world\u0027s recursion, the power of Worthiness that seems to permeate everything here, they are primarily responsible for its birth. It is their rites that created this system as it is, going from a \u0027normal\u0027, single star system, they brought the sun, literally. A second sun.\nThat is their symbol of worship, the light of their deity, literally brought into the world.\nAnd that light, that is the light of Worthiness, which seems to have inspired many powerful beings to come here just as I have, to face some trial, some challenge.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "mowziesmobs:barako_mask"
      },
      "name:8": "Artificial Sun"
    }
  },
  "questID:3": 2254,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "mowziesmobs:barako_mask"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}