{
  "preRequisites:11": [
    253
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oFound in the stronghold in the dark forest.\n\n§fThe clues are coming together, and a story is starting to emerge, at least in the way I am looking at things in the Twilight Forest. \nIn the depths of the darkest regions of the forest, I found the ruins of large strongholds. While the surface levels are almost completely gone, the catacombs are well-preserved, and full of creatures, including some crabs! These ones adapted to live inside old rusted helmets, and they are extremely cute. The other inhabitants, not so much.\nJust like the lich towers, these strongholds clearly show the signs of an actual society inhabiting their halls. A society that, over the course of time, was taken over by magical transformations, and turned into violent monsters. \nDeep in the catacombs, I found the traces of what could have been one of the first occurrences of this cataclysm. A single room, enclosed by multiple walls and barriers, that the rulers of once mighty fortresses willingly decided to turn into their own prison. The surrounding spaces were used to study their transformation, and to learn how to fight it.\nThis transformation, though, was not something that could be stopped by mere walls, and it took over everything else.\nThis means that the crabs I encountered on terra, the ones I know are from here, were likely once people. And probably were the other bugs too, since they are not unique to the mazes I previously explored.",
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 4,
        "id:8": "twilightforest:trophy"
      },
      "name:8": "Stronghold of Forgotten Spirits"
    }
  },
  "questID:3": 254,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "twilightforest:knightmetal_pickaxe"
            },
            "TrophyName:8": "Phantom Slayer",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 4,
          "id:8": "twilightforest:trophy"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}