{
  "preRequisites:11": [
    275
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "I can\u0027t help but feel like something is very wrong with my perception of my opponents. \nI have been fighting the Twilight Horde and the Shyre Empire for quite a while now, and while I see them both as deadly opponents, my perception of the former has been incommensurably more favorable than the latter.\nThe Twilight Horde has no slavery, no torture, no genetic engineering of civilizations and planets against their will, and they don\u0027t even practice imperialism.\nThis does not excuse them from the campaign they are executing on Terra, and their disproportionate military action against the Testificates, but, after having seen the horrors perpetrated by the Shyre Empire, and all the schemes of the Elder Ones, forceful occupation of foreign resources is a fairly mild crime.\nBut I digress, this has nothing to do with my sympathy (if we can call it that) for the Twilight Horde. Their military does not like me, and they want my demise too, after all.\nIt is interesting how a civilization with its reach does not engage in direct imperialism, though. With their space-warping abilities, it seems, they do not appear to care much about territorial control. Better to have a single well-guarded fortress, as opposed to hundreds of smaller specialized castles, at least when we are talking about powers at this scale.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:wildwood_core"
      },
      "name:8": "Wildwood Falls"
    }
  },
  "questID:3": 277,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:termasect_bark"
            },
            "TrophyName:8": "原始树虫屠戮者",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:wildwood_core"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}