{
  "preRequisites:11": [
    279
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "I am starting to feel like I may be getting involved into too many things. Is this what the life of an immortal is like? Just picking fights over and over? Well, this one is about my freedom, so I am not going to stop here! \nI finally got my hands on more information about the alliance between the Meatball Man and the Elder Ones that have tried to imprison me. The pact was not just between them, it involved the arthropods of teh Erebus too; well, Erebus is their home world, but after forming an alliance with the Meatball Man, they were granted magic capable of opening wormholes.\nThis was their plan with me; J\u0027zahar and and the Primordial Malevolence would bind me to recursion, the bugs, together with the undead of the Meatball Man would capture me, and I would have been their captive. Their plans, though, did not include my retaliation.\nThis still does not answer questions about any of their motivations; well, the arthropods got powerful magic, and were able to take over worlds under the banner of the Meatball Man, and the Elder Ones were likely being promised some control over the Testificates; but why would the Meatball Man want to do this? He is more than capable of defeating me, but instead he is just toying with me, making me angry enough to want to fight, and ignorant enough to want to seek answers. And why me? Isn\u0027t his enemy the Arbiter?\nWell, hopefully Pixonia will provide some more answers. After forming their alliance with the Meatball Man, the bugs of the Erebus used their wormholes to take over the world of Pixonia, and which became a hub for their elite fighters, a center from which invasions, schemes, and conquests would be handled. While I do not have the power to defeat the Meatball Man himself, I am definitely more than capable of handling his forces.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:pixonia_artifact"
      },
      "name:8": "The Bugs and the Meatball Man"
    }
  },
  "questID:3": 280,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:mythic_machine_case"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:pixonia_artifact"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}