{
  "preRequisites:11": [
    282
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oWelcome to chapter 6!\n\n§fThe capabilities of the Twilight Horde never stop to amaze me. Here I was, thinking just power alone would be my key to defeat my opponents for good...\nThankfully, having to face multiple opponents, besides being exhausting, has shown me different ways many of the players of this 'game' (feels weird to say it after so many lives have been lost, but it is indeed an appropriate word, for more than one reason) play it.\nThe Elder Ones, comparatively weak, were still able to gain massive influence thanks to their incredible intelligence-gathering abilities, making themselves indispensible to the bigger players; the Meatball Man has the incredible ability to manipulate others into serving him wether they want it or not; the Shyre Empire has brute forced its way into gathering one of the largest and most diverse armies in the cosmos, the Crimson Cult operates independtly behind the scenes, being almost untouchable due to their secrecy.\nAnd then there's the ace in the sleeve of the Twilight Horde. Their space warping abilities are a game changer, something that, arguably, places them in a leage of their own.\nWho needs subterfuge, influence, or even brute force when you are impossible to even reach and touch?\nWell, impossible is a big word, both me and the Shyre Empire are partially adept to these powers; my other enemies are doing their own space-warping experiments, and I am the first outsider to have actually entered Wildwood.\nThat is the greatness of science, it is replicable; if a truth exist, multiple people can take advantage of it! And I think I may have made another breakthrough! Time to jump into the next Shell! ",
      "frame:8": "GATE",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:wildwood_star"
      },
      "ismain:1": 1,
      "name:8": "Power from Wildwood"
    }
  },
  "questID:3": 283,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 100,
            "TrophyColorGreen:3": 100,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:wildwood_star"
            },
            "TrophyName:8": "原始森林之星圣像",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:wildwood_star"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}