{
  "preRequisites:11": [
    301
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The help is enough for my most basic needs, but still, I am a curious person. Searching for answers is the very thing that got me into this predicament.\nThe mysterious beings that inhabit Vethea and are willing to help me are part of a people not unlike the reamshifters. As a consequence of their nature as hyperspace beings, they are not bound by the same rules that bind me here. They still suffer the damage to their being that generated the twisted creatures that roam this world, and because of this they do not like to spend a long time here.\nSome of them, though, willingly have decided to give themselves to the warping of Vethea, to remain in this place permanently. They are the ones that created the portal that lets me get out. The Hunger is one of these people.\nWhen asked why they were helping me, I could not get straight answers, but a certain word was always brought up. Love. They serve Love.\nIs helping me a manifestation of Love? Is love their religion? Is Love someone? Are they talking about their ruler? Their God?",
      "icon:10": {
        "Count:3": 1,
        "id:8": "divinerpg:teaker_lump"
      },
      "name:8": "Nightmare Ascension: Teaker"
    }
  },
  "questID:3": 302,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "scannable:module_block",
          "tag:10": {
            "block:8": "divinerpg:vermenous_spawner",
            "meta:3": 0
          }
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "scannable:module_block",
          "tag:10": {
            "block:8": "divinerpg:infusion_table",
            "meta:3": 0
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "divinerpg:teaker_lump"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:mysteriousman_summoner"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}