{
  "preRequisites:11": [
    308
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The creation of Dynatos is a strange one, and it is incredibly fascinating.\nThe nature of recursion, in the form of a Fractallite, is a paradox, one where freedom and predestination coexist. \nThis very paradox is one that appears to play a role in the birth of this place. \nHelplessness, that was my first immediate reaction whenever I started understanding what Vethea was. Having a destiny is scary, terrifying. Nothing has made me feel so powerless as that realization. That very moment, I suspect, is what caused countless aspirants to lose themselves to the Nightmare. And yet, I blessedly made it out.\nThe remains of that feeling of helplessness, the feeling of falling towards a set future, sometimes still haunts me. The awareness that it is still up to me to say yes to it is not always present. Doubt is often there, even now.\nThat same feeling, in its purest form of recursion, is what birthed Dynatos from the hands of Nero.\nAn Elder One, possibly the Eldest, the first Fractallite, is at the fulcrum of the influence of Dynatos.\nThat feeling that every Ascended has experienced and will always experience. That feeling that drove all of the Fractallites from forsaking their mission, and causing many of the great anguishes in the universe. That feeling, that is the power of Nero, ruler, master, and creator of Dynatos, and the voice that ever whispers in the ear of every great power that has ever existed in the history of the cosmos.\n",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:recursion_helplessness"
      },
      "name:8": "Recursion of Helplessness"
    }
  },
  "questID:3": 311,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:recursion_helplessness"
            },
            "TrophyName:8": "Conqueror of Helplessness",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:recursion_helplessness"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}