{
  "preRequisites:11": [
    308
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The origins of blood magic. The birth of such a destructive art is tied to the history of Dynatos, out of fear. A deep, deep, fear. One so strong that harm and self-harm became preferrable.\n\nSomething in the past of Pauram caused recursion to directly manifest. Not as a fragment, not as an object imbued with it, not as matter filled with it, not as a person that can use it.\n\nNo, just Recursion. Recursion of Fear. The Recursion of Fear. \n\nThe manifestation of pure fear, born of who knows what incredible act of magic. And one the ripples of which traversed the entirety of the universe. \n\nA fear so strong that it carried on through the entirety of Blood Magic as an art, through all of its users...\n\nThe Blood God, and all the other twisted creatures corrupted by Blood Magic. They are results of this fear; one that, when made evident, is impossible to ignore, and is capable of pushing people into incredibly twisted acts.\n\nJust because of this fear. This gripping, endless fear. \n\nSomething about my journey to Vethea, my ascension, brought on a new awareness of these types of powers. And, to an extent, some immunity. I can see this power, I can see what it does; and because of this, the fear does not grip me as much. I feel some detachment from it.\n\nStill, it is an incredible thing to witness. Words cannot describe this fear, this anguish I know is capable of pushing my entire being into madness by the sheer fact that it exists.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:recursion_fear"
      },
      "name:8": "Recursion of Fear"
    }
  },
  "questID:3": 312,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:recursion_fear"
            },
            "TrophyName:8": "Conqueror of Fear",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:recursion_fear"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}