{
  "preRequisites:11": [
    308
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "I am not surprised to see that, even now, even as I have Ascended, the power of the Meatball Man feels intimidating.\nWhile it is true that a Fractallite can only Ascend toward a single mission, and thus acquire one power alone, the system, as every system, can be cheated. And of course the Meatball Man cheated.\nOut of the countless gluttonous souls under his influence, many were powerful, and many went on and Ascended themselves.\nNot unlike the Shyre Empire, and probably the Twilight Horde (even though the Experienced Cori is the only Twilight Horde Fractallite I have encountered), the power structure of the Undeads of the Meatball Man involves multiple Fractallites.\nThe power that resides over Zoi is one of solitude.\nDuring a time now made nearly inscrutable by the destruction that followed, an advanced civilization lived on Zoi. They had access to Warren magic, which they used to build structures, to travel the cosmos, and to bring the powers gravitite to the rest of the universe. This material seems to play a similar role to how Fluix is tied to the Arbiter and the Testificates; a powerful recursive material that is tied to a people. How it made its way to Diamerisma and to Terra, in times that are geologically far in the past, I cannot say.\nIt is not surprising to know that the people of Zoi opposed the undead, and that is how they fell. What is left are the monuments to their downfall left by the Meatball Man and his agents. Enough finds to show a visitor like me what happened, little enough finds to make a point that annhilation is unequivocal.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:recursion_solitude"
      },
      "name:8": "Recursion of Solitude"
    }
  },
  "questID:3": 313,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:recursion_solitude"
            },
            "TrophyName:8": "Conqueror of Solitude",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:recursion_solitude"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}