{
  "preRequisites:11": [
    315
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "All throughout this journey, a fil rouge has remained, and that is science.\nNo matter how unintuitive or strange the governing laws of a given phenomenon, contraptions, machines, devices, can be engineered, if those laws are understood.\nAnd more contraptions, machines, devices I shall engineer.\nIf magic ir born of recursion, and if recursion is born of infinity, infinity, even with the basic understanding I have of this concept, can be used to manipulate magic in ways that re more fundamental than I could do before. \nNew recursive alloys, not coming from magic, but directly from the source of magic.\nWith a bit of tuning, I should be able to achieve a finer level of control over the properties of these new infinity-made materials. It will surely take some tinkering, and more exploration.\nEven now, though, I have what I need, the final ingredient to break into the final Mythic Shell!\nThe \u0027barrier\u0027 placed by the Twilight Horde, the fractal self-similar shaping of space time, the first of such structures in the history of the universe, the true Fifth Mythic Shell, is quite a bit more advanced, more fundamental, when compared to the defenses placed by the Shyre Empire.\nThe latter is more recent, built out of imperfect knowledge. This reminds me of Earth\u0027s cold war. Once a great power is discovered by someone we cannot control, it becomes paramount to obtain that same power, and to even the odds. The finall wall of the Shyre Empire was a rushed effort, born of espionage and corruption, and motivated by fear, by lack of control.\nI think I can imagine what to expect at the center of the Twilight Horde, likely another land inhabited by powerful beasts. \nWith regards to the Shyre Empire, though, I am not too sure. I have met the rulers of the Empire, I witnessed them command. Is this next place where their true forms are hidden? Or will I meet someone placed even higher in this hierarchy? A ruler?",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:infinity_furnace_bricks"
      },
      "name:8": "Infinite Furnacing"
    }
  },
  "questID:3": 314,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 22,
          "id:8": "contenttweaker:infinity_furnace_bricks"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "modularmachinery:itemblueprint",
          "tag:10": {
            "dynamicmachine:8": "modularmachinery:infinity_furnace"
          }
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}