{
  "preRequisites:11": [
    313,
    310,
    311,
    312
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Recursion, the act of returning, repeating, reproducing, by virtue of its nature, is born of infinity.\nWithout it, the recursion cannot continue, it cannot self-actualize, it cannot exist.\nIf recursion describes the theorems of the universe, infinity is the axiom onto which the theorems are built. Even a rule that self-generates, after all, requires an originator.\nI am now a being of recursion, my magic self-actualizes, and yet I the person who I am, the powers I have, are not from me, they come from histories, from sequence of actions, that exist in a world that is so much larger than me.\nThat is infinity, something so fundamental and yet not fully strutable, even by someone like me, who is nearing the apex of understanding creation.\nIf the attempt at understanding recursion requires itself recursive reasoning, the rules of infinity are different. To an extent, definining infinity is easy, and yet, unlike recursion, I have not fully experienced it in this reality. Just echoes of it, hints, suggestions.\nWarren magic, the manipulation of space-time, seems to hold a special relationship with the concept of infinity. Singularities, black holes and wormholes, after all, exist naturally in this universe, and while their properties are not fully scrutable, they can be studied.\nAnd it is thanks to warren magic that I was capable of observing my first hint of \u0027naked\u0027 infinity. In the form of a catalyst, a catalyst I believe will play an important role into breaking into the final mythic shell.",
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 5,
        "id:8": "avaritia:resource"
      },
      "name:8": "Infinity Catalyst"
    }
  },
  "questID:3": 315,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 5,
          "id:8": "avaritia:resource"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}