{
  "preRequisites:11": [
    314
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The seat of power of the Empire, the infinite golden fortress, the Shyrelands.\nI guess I should not be surprised that the capital of this Empire that treats its subjects the way it does looks like a palace Louis XVI would have ordained built. Rich aristocrats living lofty existences while countless lives are carelessly sacrificed, and while powerful oligarchs do their dirty work.\nWell, not quite, this place is not necessarily unprotected nor defensless. All things considered, though, I will take this over the abominations of Greckon.\nIf I am right, though, and this place is just where the nobility of the Empire resides, I may have to come back to the Fractallites that truly rule over the Shyre armies. I really do not see the fall of this place as strategically meaningful; after all, I hardly believe any of the gilded knights located here to hold any important positions that would damage the chain of command.\nWell, at least I want the satisfaction of meeting this nobility. I want to look in the eyes, or whatever bodies these creatures may have, of those that can so easily allow for a large part of the universe to suffer so that they can live in luxury.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "aoa3:shyrelands_realmstone"
      },
      "name:8": "Shyrelands Realmstone"
    }
  },
  "questID:3": 316,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "scannable:module_block",
          "tag:10": {
            "block:8": "aoa3:craexxeus_altar",
            "meta:3": 0
          }
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "scannable:module_block",
          "tag:10": {
            "block:8": "aoa3:soulscorne_spawner",
            "meta:3": 0
          }
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "scannable:module_block",
          "tag:10": {
            "block:8": "aoa3:arc_wizard_spawner",
            "meta:3": 0
          }
        },
        "3:10": {
          "Count:3": 1,
          "id:8": "scannable:module_block",
          "tag:10": {
            "block:8": "aoa3:shyre_troll_spawner",
            "meta:3": 0
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "aoa3:shyrelands_realmstone"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}