{
  "preRequisites:11": [
    316
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oUse an ancient ring on the Craexxeus altar!\n\n§fTurns out I was wrong, after all. This \u0027lofty nobility\u0027 is not particularly lofty, nor it is powerless.\nThe ruler of the Shyrelands is a knight-king, who does indeed hold military authority, and a Fractallite nonetheless. Well, at least I think so. Xxeus definitely held a lot of magical power, possibly the highest I have seen; and yet, the Shyre ruler did not show even a hint of his power. \nNothing. Not even a single spell. His Lelyetian mount was almost an even bigger threat than him.\nI do not undertand, is this what complacency does to a person? Having so much power and influence that there is no need to fight for anything anymore?\nI thought that by encountering this enemy would bring some sort of closure, but I am struggling at feeling anything but confusion, sadness, and emptiness.\nThe Shyre Empire\u0027s armies lost their ruler, but with how things are playing out, it does not feel like much. \nFirstly, there are the loose ends of the remaining Shyre Fractallites, who seem to still be holding on to whatever control they can muster, and who themselves possess enough power to cause lots of issues.\nSecondly, there is me. I embarked in this campaign with the intention of freeing Terra. The mission, the Ascension. And yet, now I see another truth. The mission was not it, freeing Terra was only part of my motivation. A deeper motivation, one that only my subconscious held; one that is now made obvious by its lack of fullfillment. Vengeance, bloodlust, confrontation. I wanted an enemy someone that may fully challenge me, someone that I could truly hate. I want to hate.\nEven the mission, it was an excuse. No not an excuse, an instrumentalization. Utilitarian mind games where I convinced myself I was self-righteous. ",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:reinforced_shyre_bricks"
      },
      "name:8": "The Shyre Empire Falls"
    }
  },
  "questID:3": 317,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:xxeus_heart"
            },
            "TrophyName:8": "Knockoff Greek Holiday",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:reinforced_shyre_bricks"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "aoa3:ancient_ring"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}