{
  "preRequisites:11": [
    34
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oThere are special mobs that spawn at low Y levels (below Y \u003d 11). Those will drop corrupted shards, as well as other goodies. A dark room at low Y level is recommended!\n\n§fMagic is real, and there seems to be multiple forces playing a role in what effects magic.\nFrom what I\u0027ve seen so far, there seem to be two methods.\nThe first is based off of manipulating the laws of physics to, for example, reinforce arrows shot from a bow just like I learned, or shoot magic missiles, just like the wizards dwelling in towers around the world.\nThis is done by bending \u0027fields\u0027 existing in higher dimensions, that allow for increased power.\nThere are different types of fields to tap magic energy from, but so far I\u0027ve only become able to discern the one that allows me to \u0027enchant\u0027 weapons and armor.\nThe second magic type, which I like to call Mythic, is more esoteric, and it reminds of the way deities were portrayed in folklore.\nThis allows for the \u0027breaking\u0027 of the rules of reality (as opposed to bending them). This power, which emanates an extremely strong aura, seems to permeate many of the creatures on this planet, allowing them to effortlessly appearing out of nothing",
      "icon:10": {
        "Count:3": 1,
        "id:8": "divinerpg:altar_of_corruption"
      },
      "name:8": "Fundamentals of magic"
    }
  },
  "questID:3": 35,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "divinerpg:corrupted_cannon"
        },
        "1:10": {
          "Count:3": 24,
          "id:8": "divinerpg:corrupted_bullet"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "divinerpg:altar_of_corruption"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}
