{
  "preRequisites:11": [
    371
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The fight I craved. The challenge I wanted. \nAnd it is over. \nI fell, well, relieved. Suprisingly. \nFighting to my very limits, using all that I have in my arsenal. That felt good.\nEver since the start of this whole thing, I kept fighting, kept looking for a bigger challenge. A next opponent.\nAs I first faced Xxeus, I thought that hunger for more could never end.\nAnd yet now, I do feel closure, strangely enough. Was it just because of my ego, or was some magic power affecting me? The combination of so many Recursive powers combined could have very plausibly affected me in some way, after all.\nI do not think it is just that, though. I think I may have needed to have a crazy, messy fight.\nFeels strange to say this, to think of the fall of some of the largest powers in the universe as a brawl. And yet it was.\nThe rewards? Satisfaction, closure, peace.\nOh, and Sacred Cinders magic.\nThat was the mission Xxeus bound himself to Ascend, to be the guardian of the Sacred Cinders. A magic that brings life and cleansing. A magic of creation, origination, the fragments of which I saw in the Tree of Life, now free before my eyes.\nThat power, severed from its former ruler, is now accessible to me. That could be my role in the Fractallite pantheon. And yet, I do not think I will take it. \nMy fate is not to create, to bring life over death. After all, my Ascension has been a story of death. No, my power, my mission, knowing what I know, is still out there, waiting for me.\nThat does not mean I will not make use of the magic of Sacred Cinders, it is definitely useful in time for rebuilding. And rebuilding, for now, I shall.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:sacred_callstone"
      },
      "name:8": "Sacred Callstone"
    }
  },
  "questID:3": 372,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 100,
            "TrophyColorRed:3": 100,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:recursion_prison_key"
            },
            "TrophyName:8": "For Recursion!",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "neon"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:sacred_callstone"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}