{
  "preRequisites:11": [
    301
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oCheck uses for each template to see what items can be crafted using the Infusion Table.\n\nFor each recipe, Lumps should be added one by one until you get the exact number!\n\n§fWhile the people that are helping me are definitely appreciated, I can hardly call them good Samaritans. They still expect some level of effort from me. They are willing to help me, but only if I show that I can start helping myself. They gave me access to weapons of nightmare, but I still need to make them myself. I was given food, but I had to pay for it.\nThis is good, I think. At its core, this world is a trial, one that I need to face myself, as I am. What I am, my essence of being, though,has been touched by the lives of so many others; those that believed in me as a scientist back on Earth; my family who sacrificed so many things for my success; the Testificates who accepted me on Terra; the Bees who fought alongside me; the Realmshifters who gave up so much to enter the fight; and now the people of Vethea.\nThe final challenge of this world will still be up to me, but that does not mean I should deny those who want to help me bear its burden. Especially because I am not sure I will be capable of bearing it alone...",
      "icon:10": {
        "Count:3": 1,
        "id:8": "divinerpg:teaker_hammer"
      },
      "name:8": "Dream Infusion Crafting"
    }
  },
  "questID:3": 379,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "divinerpg:disk_template"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "divinerpg:hammer_template"
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "divinerpg:staff_template"
        },
        "3:10": {
          "Count:3": 1,
          "id:8": "divinerpg:claw_template"
        },
        "4:10": {
          "Count:3": 1,
          "id:8": "divinerpg:cannon_template"
        },
        "5:10": {
          "Count:3": 1,
          "id:8": "divinerpg:bow_template"
        },
        "6:10": {
          "Count:3": 1,
          "id:8": "divinerpg:backsword_template"
        },
        "7:10": {
          "Count:3": 1,
          "id:8": "divinerpg:degraded_template"
        },
        "8:10": {
          "Count:3": 1,
          "id:8": "divinerpg:finished_template"
        },
        "9:10": {
          "Count:3": 1,
          "id:8": "divinerpg:glistening_template"
        },
        "10:10": {
          "Count:3": 1,
          "id:8": "divinerpg:demonized_template"
        },
        "11:10": {
          "Count:3": 1,
          "id:8": "divinerpg:tormented_template"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}