{
  "preRequisites:11": [
    395
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The fracture between dimensions, that is the truth about the nature of space.\nAs I said, I did not know what answers this wretched creature would provide, but I definitely did not expect a lesson in physics.\nThere is a reason why most beings in the universe can only perceive three dimensions of space. It has to do with a fracture, one that was, long ago, put in place through Warren magic, as a way to separate a portion of reality from the rest.\nAn uncountable amount of time ago, when the Old Ones were still young, this fracture was not present, and it was much more common for beings, whatever they must have looked like back then, to be able to perceive the full space of Strings.\nAccess to this space is what allowed for the discovery of the Eldritch Recursive field, the origin of Abyssal magic, which resided in interaction existing only in some dimensions. To prevent the spread of this power, which created what are now the Elder Ones, from taking over, the ancestors of the Realmshifters forged a way to separate the dimensions, giving birth to the nightmare worlds of the Abyssal Ones, but at the same time curbing their influence.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:cosmic_fracture"
      },
      "name:8": "Cosmic Fracture"
    }
  },
  "questID:3": 398,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 100,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 100,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:cosmic_fracture"
            },
            "TrophyName:8": "恐怖屋子",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:cosmic_fracture"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}