{
  "preRequisites:11": [
    279
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Here is a very cool technological application of Recursion and Mythic powers. Infinite energy!\nThe system has its limitations, of course, but the right combination of recursive materials can move the potential energy of Recursion through a series of transformations into other fields that eventually leads to electricity.\nThis is an incredible achievement in so many different ways!\nBesides the obvious benefit of having large amounts of energy, this shines an unexpected beacon of light on the nature of recursion. The universe has an inherent amount of potential energy that exists even in vacuum; recursion is everywhere! There seem to be factors that change its density in various places, and it can be bound and harnessed in particularly high concentrations through recursive objects and beings. Regardless of this, even low levels of recursion correspond to incredibly high amounts of energy.\nWhat I am pulling out of my Arc Reactors is just a trickle of what is actually available, so much so that these reactors can run for a near-infinite amount of time.\nThat\u0027s why recursion is the key to universe-scale warfare, it\u0027s basically unlimited energy that can be used for magic, technology, and who knows what else...",
      "icon:10": {
        "Count:3": 1,
        "id:8": "modularmachinery:itemblueprint",
        "tag:10": {
          "dynamicmachine:8": "modularmachinery:arc_reactor"
        }
      },
      "name:8": "Ex Nihilo, VIS!"
    }
  },
  "questID:3": 463,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 32,
          "Damage:2": 2,
          "id:8": "techreborn:machine_frame"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:arc_reactor_coil"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "modularmachinery:itemblueprint",
          "tag:10": {
            "dynamicmachine:8": "modularmachinery:arc_reactor"
          }
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}