{
  "preRequisites:11": [
    280
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "While I still not fully understand the powers of the Meatball Man, I am starting to see some patterns into how his dominion over undeath is handled. Not all that die can fall under his control; what makes someone suitable to his powers seems to be a matter of greed and gluttony. Only those that compulsively desire in life can be made to serve in death. \nThose who used people to obtain things, those who wanted more despite having no use for it, those who wielded power only for themselves, they are the ones that the Meatball Man leads in undeath. \nI have to say, there is something quite poetic in this. In many mythological traditions, characters given this role of \"jailers of the damned\" were considered to be an essential part of the balance of the world. If you are bad while in life, punishment will come to you in death, and if you have used others to serve yourself, you shall now serve.\nFolklore and myths, though, never mentioned such jailer characters having personal ambitions, nor an affinity for meatballs. \nThe power over a near-infinite army of evil people, all ready to serve you, is definitely a strong temptation, so it does make sense that the Meatball Man would be a crazed ruler. He definitely fits the charcterization of someone who uses people and desires things, so if he were to be defeated by someone with his same ability, would he be enslaved too?",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:gem_of_midas"
      },
      "name:8": "Gem of Midas"
    }
  },
  "questID:3": 468,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 16,
          "id:8": "contenttweaker:living_gold"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:gem_of_midas"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}