{
  "preRequisites:11": [
    487
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oUse petals on a vinocorne shrine to summon Vinocorne.\n\n§fThe logistics of Gardencia's empire-feeding endeavor is a surpisingly sustainable one.\nThe beings that roam this planet go through their daily activities pretty much undisturbed, but whenever they produce fruits, excess roots, or stems, they 'get a trim' from Shyre agents, which store the resulting produce, and send it to other territories as they need them.\nThe sustainable nature of this process has to do with the natural biological evolution of this place; no genetic engineering here. \nGardencia used to have a more complex food chain, with animals both herbivorous and carnivorous. As it sometimes happens in nature, evolution produced a somewhat unstable behavior, where animals would reproduce more easily, leading to more plants getting eaten, leading to plants producing more fruit, leading to more food abundance, leading to more animals eating more plants. This cycle kept going and going, producing an overpopulated world, both by plants and animals.\nUntil the cycle broke. Plants had become so good at producing more of themselves that they had gained other abilities, including walking, thinking, and, most importantly, to do magic. One of these magic-wielding plants, Vinocorne, was then able to ascend, in a world-shaking event not unlike Iceika, and in mere moments all animal life was gone from Gardencia.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:gardencia_cap"
      },
      "name:8": "Gardencia Falls"
    }
  },
  "questID:3": 486,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "simple_trophies:trophy",
          "tag:10": {
            "TrophyColorBlue:3": 0,
            "TrophyColorGreen:3": 0,
            "TrophyColorRed:3": 0,
            "TrophyItem:10": {
              "Count:1": 1,
              "Damage:2": 0,
              "id:8": "contenttweaker:vinocorne_petal"
            },
            "TrophyName:8": "Vinocorne Slayer",
            "TrophyShowsTooltip:1": 1,
            "TrophyVariant:8": "classic"
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:gardencia_cap"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}