{
  "preRequisites:11": [
    274
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Gardencia! Not unlike many other Shyre worlds, it is admittedly very beautiful, and not unlike many other Shyre worlds, it is very dangerous too.\nI am sure that it selves its military purpose quite well, but the Empire\u0027s main purpose for this green lush planet does not lie in its warring abilities; rather, what makes Gardencia so incredibly interesting, and useful to my enemies, is the unique evolutionary path this place has experienced. \nKnowing what I know now, there may have been some genetic engineering, but it is nevertheless remarkable how thermodynamically efficient the life on this place is.\nThe moving creature of this world are plants, capable of photosynthesis, but they have become so good at making energy to be able to develop movement while remaining fully capable of movement. Assuming this \u0027evolution\u0027 was not obtained through external means, this is likely linked to the fact that Gardencia is a tidally-locked planet, where the sun always shines over half of the world. Thanks to this, there is no \u0027down time\u0027 for photosynthesis, and all the excess energy that is not used to move around and fight me is instead put to use to directly produce fruits and vegetables in large, very large amounts.\nThat is how the Shyre Empire effortlessly feeds itself. They don\u0027t need agriculture, nor alchemy, they just have tons of Carrotops!",
      "icon:10": {
        "Count:3": 1,
        "id:8": "aoa3:gardencia_realmstone"
      },
      "name:8": "More Evil Plants!"
    }
  },
  "questID:3": 487,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "scannable:module_block",
          "tag:10": {
            "block:8": "aoa3:vinocorne_shrine",
            "meta:3": 0
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "aoa3:gardencia_realmstone"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}