{
  "preRequisites:11": [
    274
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "It's not just the Meatball Man, the Shyre Empire is interested in Nukes too. And in chemical warfare. I guess that in a world of magic and recursion, scientific weapons can still play a role, otherwise my foes would not be so interested.\nIt is interesting to note, though, how humanity, all things considered, was able to discover these weapons so 'early' in the development of its civilization. Access to magic can really push development without having to touch lots of science. This could be a trategic advantage for me, to be fair; if the Shyre Empire got to nukes only after climbing the Kardashev scale so high, it is very possible I may know more than they do about some things.\nAnyhow, besides these strategic considerations, the Vox Ponds are interested in more than one way. Similar to Vibe and Furatto, it is a world that has experienced planet-wide destruction first hand. Laser chickens, Taint, and a cocktail of Nukes and chemical weapons can easily put an end to an entire world. Unlike these other places, though, the Vox Ponds are not in this state because of war; rather, they have been used for testing for so long that not a single part of the planet is now intact. Radiation, viruses, bagteria, gases,its inhabitants are immune to basically every scientific weapon out there, and they continue with their experiments of mass destruction as if they were no more than simple everyday tasks.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "aoa3:vox_ponds_realmstone"
      },
      "name:8": "Relics of a Forgotton World"
    }
  },
  "questID:3": 493,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "scannable:module_block",
          "tag:10": {
            "block:8": "aoa3:enigma_table",
            "meta:3": 0
          }
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "scannable:module_block",
          "tag:10": {
            "block:8": "aoa3:voxxulon_altar",
            "meta:3": 0
          }
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "minecraft:paper",
          "tag:10": {
            "display:10": {
              "Name:8": "y=21 good"
            }
          }
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "aoa3:vox_ponds_realmstone"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "aoa3:hazmat_helmet"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "aoa3:hazmat_chestplate"
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "aoa3:hazmat_legs"
        },
        "3:10": {
          "Count:3": 1,
          "id:8": "aoa3:hazmat_boots"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}