{
  "preRequisites:11": [
    272
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "And here is what my enemies wanted to get. Projector Gems are a recursive material hidden in the depths of Rhenia.\nThe bees do not know where it comes from, it was there in this world before their coming, and despite being aware of it, they never found a use for it.\nTo be fair, though, preventing the invaders of Terra from Getting their hand on it, that is already plenty useful!\nThe way the bees protect this world is quite interesting. It is a next level scorched earth (well, scorched Rhenia) strategy.\nBees, thanks to their adaptations, are capable of surviving in incredibly extreme conditions. To bring an army comparable to the ones on Terra here would require quite a bit of infrastructure to do safely. For starters, every potential invader would require some sort of respiration device (or magic survival tool) to even survive. And with bees capable of piercing through pretty much any conventional material, whatever device said potential invaders implement will have to be extremely strong. Additionally, the surface of the planet has been emptied of any resource that could aid life that\u0027s not a bee, requiring massive supply chain infrastructure for anyone who wanted to conduct war in such a place.\nGiven all these challenges, the bees of Rhenia made it so anyone who wants to attack this world will have to invest more resources into infrastructure and armaments than the potential gain of getting their hands on some Projector Gems.\nIf this were about Dimensional Shards, I suspect such a strategy would not work, but the recursive matter on Rhenia seems to be low impact enough to not being worth the hassle.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:holographic_ore"
      },
      "name:8": "Projections of Recursion"
    }
  },
  "questID:3": 507,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 16,
          "id:8": "contenttweaker:holographic_ore"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:holographic_ore"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:core_sample_hand_drill"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}