{
  "preRequisites:11": [
    513
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "While solid-state fusion reactors are nice, they do not deal with energy-negative reactions well.\nHeating things and supending them with electromagnetic coils is an inefficient method. Lasers, very powerful ones, can definitely do this better and faster!\nAn inertial confinement reactor, that's what I need to get much higher yields.\nThis technology, back on Earth, played a pivotal role in the struggle to energetic independence. As opposed to trying for self-sustaining heat-positive reactions through magnetic confinement in a Tokamak fusion reactor, inertial confinement, which never became self-sustaining, allowed to fuse elements heavier than iron, sich as tin, into a plasma. \nWhile this fusion reactor requires quite a lot of energy, it also releases a bunch of heat, both through cooling and the decay of the unstable plasma into its original components, so thanks to the efficient thermodynamic cycles and heat exchanging methods developed for salt reactors, it was possible to produce an energy-positive cycle.\nI am not going to do that here, but using inertial confinement fusion to produce heavy metals is indeed useful for my purposes.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "contenttweaker:hohlraum"
      },
      "name:8": "Hohlraum",
      "tasklogic:8": "OR"
    }
  },
  "questID:3": 515,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 3,
          "Damage:2": 202,
          "id:8": "contenttweaker:material_part"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:hohlraum"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "modularmachinery:itemblueprint",
          "tag:10": {
            "dynamicmachine:8": "modularmachinery:inertial_confinement_reactor"
          }
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}