{
  "preRequisites:11": [
    520
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Despite the squabbles between my archetypal enemies (yes I am equating this war to a myth of old), I can't help but be impressed at what the Aesir were capable of hiding after their defeat.\nI know the Shyre Empire did not know of this. They possessed the information to come to this conclusion, but they were not able to get the final step of this mystery.\nUsing magic to infuse stone into ore is a fairly mundane thing, all things considered. Useful in many cases, but in many others the bees and the chickens can do a better job.\nBut what the Aesir did was hiding their own powerful recursive material into this mundane, and honestly easy to ignore and snob, piece of botanical magic. Most of the products of the Orechid are fairly worthless, but Arkenstone, the seed of the power of the Asgard, is a gamechanger.\nWhoever did this must have been one of the final survivors of the Aesir. Instead of giving away the recursive material of Asgard, they infused into a magic that would be ignored by powerful foes like the ones they were facing, thus protecting it from their enemies' greed.\nTo whoever did this, thank you, you have given me a weapon I can use against the same enemies that put an end to your world!",
      "icon:10": {
        "Count:3": 1,
        "id:8": "botania:specialflower",
        "tag:10": {
          "type:8": "orechid"
        }
      },
      "name:8": "Orechid"
    }
  },
  "questID:3": 518,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:arkenstone"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "botania:specialflower",
          "tag:10": {
            "type:8": "orechid"
          }
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:puzzle_solution_first_shell"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}