{
  "preRequisites:11": [
    529
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oAnd a great butt!\n\n§fYes, yes it was. It was worth it. \nDo I whish my motives had been more selfless? Yes, but now I know this about myself. I know how I work. I know why I work. And it is not too late to change. I have an entire eternity ahead of myself to become a better person. To be the hero others see me as.\nI am not alone, I have allies, the Bubbell alliance believes in me. They see something in me I do not. They trust me.\nAnd with this knowledge, came power, the power of someone who as seem themselves for what they truly are, the power of someone who has let themselves go, and who has truly seen what is out there. \nAt the cost of discovering the madness of my intents, I gained an extremely deep understanding on the refraction of magical fields.\nForce fields like vis or demonic will can be 'bent' and reshaped through recursion because they come from recursion. That is the force that sits at the bottom of the pyramid of magic. This is what guides the existance of the fields to begin with.\nRecursion is magic, magic is recursion. There are no other fields, they are just varying manifestations of the same fundamental force. And I can see it all.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "modularmachinery:itemblueprint",
        "tag:10": {
          "dynamicmachine:8": "modularmachinery:shadow_fracturer"
        }
      },
      "name:8": "...But I have Power!"
    }
  },
  "questID:3": 532,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:warped_stone"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "contenttweaker:warped_stone"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "index:3": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "modularmachinery:itemblueprint",
          "tag:10": {
            "dynamicmachine:8": "modularmachinery:shadow_fracturer"
          }
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  }
}