mods.jei.JEI.addDescription(<botania:terraplate>,
[
    "放置在3x3的基座中心，其中以X形放置5块活石，4块青金石块填补空隙",
    "在中心丢入一个魔力钢锭，一个魔力珍珠，以及一个魔力钻石来制作泰拉钢",
    "制作需消耗半魔力池魔力，确保魔力供应充足！"
]);


mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "spectrolus"}),
[
    "以特定顺序消耗特定颜色的羊毛产生魔力",
    "可用森林法杖查看所需羊毛的颜色"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "omniviolet"}),
[
    "消耗书产生魔力",
    "类似附魔台，可用书架增强产魔能力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "stonesia"}),
[
    "消耗石头和矿物产生魔力，矿物越稀有，产魔越多"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "dandelifeon"}),
[
    "在以启命英为中心25x25的范围内，遵循康威生命游戏的规则产生魔力",
    "最佳产能花，但是最难使用！"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "endoflame"}),
[
    "消耗附近掉落的熔炉燃料产生魔力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "moonbless"}),
[
    "在夜间产生魔力",
    "会自然枯萎"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "bellflower"}),
[
    "被动产生魔力，高度越高产魔越高",
    "会自然枯萎"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "hydroangeas"}),
[
    "吸收3x3范围内的水产生魔力",
    "会自然枯萎"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "shulk_me_not"}),
[
    "在附近有生物被潜影贝弹射物攻击时产生魔力，但仅在内部魔力缓存为空时工作"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "reikarlily"}),
[
    "从雷击中产生魔力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "rafflowsia"}),
[
    "消耗人工合成的植魔花产生魔力，花的种类越丰富，产魔越高"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "arcanerose"}),
[
    "吸收经验产生魔力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "entropinnyum"}),
[
    "吸收TNT爆炸产生魔力，但仅在内部魔力缓存为空时工作"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "narslimmus"}),
[
    "消耗史莱姆产生魔力，仅在史莱姆区块中工作"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "edelweiss"}),
[
    "消耗雪傀儡产生魔力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "kekimurus"}),
[
    "通过吃附近的蛋糕来产生魔力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "munchdew"}),
[
    "消耗附近放置的树叶产生魔力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "bloodyenchantress"}),
[
    "伤害附近生物产生魔力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "geminiorchid"}),
[
    "在斜对角放置熔岩和水来被动产生魔力",
    "会自然枯萎"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "tinkle"}),
[
    "玩家在附近移动时产生魔力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "gourmaryllis"}),
[
    "消耗附近掉落的食物产生魔力",
    "连续消耗同种食物会导致产魔减少"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "thermalily"}),
[
    "消耗3x3范围内的熔岩产生魔力",
    "有冷却时间，冷却时仍会吸收熔岩，但不产生魔力"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "sunbless"}),
[
    "在白天产生魔力",
    "会自然枯萎"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "beegonia"}),
[
    "通过附近掉落的林业蜜蜂产生魔力"
]);

mods.jei.JEI.addDescription(<bloodmagic:ritual_controller:1>,
[
    "在上方放置以下方块产生不同效果，右击激活：",
    "",
    "青金石块：跳过白天",
    "",
    "水：变为雷雨天",
    "",
    "煤炭块：生成僵尸"
]);

mods.jei.JEI.addDescription(<bloodmagic:ritual_controller:0>,
[
    "以下仪式需要基础的仪式推测杖（在任务书中查看每种仪式的信息）：",
    "",
    "盛宴之歌",
    "",
    "磁引仪式",
    "",
    "牵引仪式",
    "",
    "和风之召",
    "",
    "抑液仪式",
    "",
    "日之仪式",
    "",
    "和平灵魂仪式",
    "",
    "自然汲取仪式",
    "",
    "铺设仪式",
    "",
    "高跳仪式",
    "",
    "坚定之心仪式",
    "",
    "制止仪式",
    "",
    "绿丛仪式",
    "",
    "伐林仪式",
    "",
    "极寒火山",
    "",
    "涌泉仪式",
    "",
    "下界夜曲"
]);

mods.jei.JEI.addDescription(<bloodmagic:ritual_controller:0>,
[
    "以下仪式需要仪式推测杖 [薄暮]（在任务书中查看每种仪式的信息）：",
    "",
    "灌注仪式",
    "",
    "燃血仪式",
    "",
    "坠星标位",
    "",
    "祭坛集结号",
    "",
    "崇敬之鹰",
    "",
    "永魂之泣",
    "",
    "净化仪式",
    "",
    "邪恶面纱",
    "",
    "沉重灵魂的忏悔",
    "",
    "净灵之音",
    "",
    "驱逐氛场",
    "",
    "束灵进化",
    "",
    "重生仪式",
    "",
    "孤魂集会",
    "",
    "碎晶裂纹",
    "",
    "拆解仪式",
    "",
    "羽刀仪式",
    "",
    "羽地仪式",
    "",
    "苦难之井",
    "",
    "剔除仪式",
    "",
    "克隆之魂仪式",
    "",
    "椭球的焦点",
    "",
    "神圣守护",
    "",
    "猩红之瓮仪式",
    "",
    "机械祭坛仪式",
    "",
    "丰收之月",
    "",
    "结晶共鸣",
    "",
    "邪术意志仪式",
    "",
    "挖掘仪式",
    "",
    "牧养仪式",
    "",
    "折域之门",
    "",
    "月之仪式",
    "",
    "接地仪式",
    "",
    "速移仪式",
    "",
    "虹吸圣曲"
]);

mods.jei.JEI.addDescription(<bloodmagic:ritual_diviner:1>,
[
    "以下仪式需要仪式推测杖 [薄暮]（在任务书中查看每种仪式的信息）：",
    "",
    "灌注仪式",
    "",
    "燃血仪式",
    "",
    "坠星标位",
    "",
    "祭坛集结号",
    "",
    "崇敬之鹰",
    "",
    "永魂之泣",
    "",
    "净化仪式",
    "",
    "邪恶面纱",
    "",
    "沉重灵魂的忏悔",
    "",
    "净灵之音",
    "",
    "驱逐氛场",
    "",
    "束灵进化",
    "",
    "重生仪式",
    "",
    "孤魂集会",
    "",
    "碎晶裂纹",
    "",
    "拆解仪式",
    "",
    "羽刀仪式",
    "",
    "羽地仪式",
    "",
    "苦难之井",
    "",
    "剔除仪式",
    "",
    "克隆之魂仪式",
    "",
    "椭球的焦点",
    "",
    "神圣守护",
    "",
    "猩红之瓮仪式",
    "",
    "机械祭坛仪式",
    "",
    "丰收之月",
    "",
    "结晶共鸣",
    "",
    "邪术意志仪式",
    "",
    "挖掘仪式",
    "",
    "牧养仪式",
    "",
    "折域之门",
    "",
    "月之仪式",
    "",
    "接地仪式",
    "",
    "速移仪式",
    "",
    "虹吸圣曲"
]);


mods.jei.JEI.addDescription(<bloodmagic:ritual_diviner:0>,
[
    "以下仪式需要基础的仪式推测杖（在任务书中查看每种仪式的信息）：",
    "",
    "盛宴之歌",
    "",
    "磁引仪式",
    "",
    "牵引仪式",
    "",
    "和风之召",
    "",
    "抑液仪式",
    "",
    "日之仪式",
    "",
    "和平灵魂仪式",
    "",
    "自然汲取仪式",
    "",
    "铺设仪式",
    "",
    "高跳仪式",
    "",
    "坚定之心仪式",
    "",
    "制止仪式",
    "",
    "绿丛仪式",
    "",
    "伐林仪式",
    "",
    "极寒火山",
    "",
    "涌泉仪式",
    "",
    "下界夜曲"
]);


mods.jei.JEI.addDescription(<thaumcraft:thaumonomicon>,
[
    "进行以下步骤以获得该物品：",
    "",
    "1. 挖掘一些源质结晶，达成需求时聊天栏会出现一条信息",
    "",
    "2. 睡觉，会在物品栏中获得一本特殊的书",
    "",
    "3. 制作世界盐",
    "",
    "4. 使用世界盐对原版书架右击"
]);

mods.jei.JEI.addDescription(<extrautils2:ingredients:10>,
[
    "使用邪恶点滴右击泥土来将其转变为诅咒之土。",
    "",
    "诅咒之土可增加敌对生物生成率。几乎无视原版数量限制。",
    "",
    "只要所在区块处于加载状态，就会生成怪物！",
    "",
    "主世界的最佳放置地点为Y=2处。",
    "",
    "若想在下界用诅咒之土建刷怪场，确保在上面铺满线。如此可防火！"
]);

mods.jei.JEI.addDescription([<contenttweaker:quarry>,
                            <rftools:builder>,
                            <rftools:shape_card:2>,
                            <rftools:shape_card:3>,
                            <rftools:shape_card:4>,
                            <rftools:shape_card:5>,
                            <rftools:shape_card:6>,
                            <rftools:shape_card:7>],
[
    "采石场是对自动挖矿手段的统称！",
    "",
    "RFTools模组的建造机配合塑形卡（采掘）可自动挖空指定区域！",
    "",
    "使用塑形卡Shift右击来设定挖掘区域。",
    "",
    "在建造机上放置容器来自动收集掉落物！末影箱是个好选择 ;)"
]);




mods.jei.JEI.addDescription(<contenttweaker:ore_processing>,
[
    "使用磨粉机和红石炉来实现大部分矿物的双倍产出！核电工艺的小制造机更快，但是也更难做。",
    "",
    "为红石炉安装通量阳极电镀升级可直接产出双倍产物！",
    "",
    "为感应炉安装炽焱高温裂解升级可产出三倍产物！",
    "",
    "神圣RPG和虚无世界模组的矿物可使用冶炼炉或工业磨粉机进行处理！"
]);

mods.jei.JEI.addDescription(<iceandfire:fire_dragon_heart>,
[
    "龙心循环是前期获得EMC的最佳手段！",
    "",
    "4根烈焰棒的EMC总和为6144，1个钻石的EMC值为8192！",
    "",
    "RFTools模组的自动合成机可以自动用烈焰棒制作钻石！确保选择ExtC模式来将龙心保持在输入栏！",
    "",
    "钻石可以运输到能量凝聚器 MK2，从而制作更多烈焰棒！",
    "",
    "将凝聚器里的烈焰棒运输回自动合成机，从而实现循环！",
    "",
    "将多余的烈焰棒运输到另一个能量凝聚器中来制作设定好的EMC物品！",
    "",
    "物品传输速度、能量凝聚速度、自动合成速度越快，EMC产出越高。"
]);

mods.jei.JEI.addDescription(<draconicevolution:celestial_manipulator>,
[
    "本整合包中主要有两种手段跳过白天！",
    "",
    "使用青金石配合血魔法模组的不完善的仪式石可以手动跳过白天。",
    "",
    "龙之进化模组的苍穹变换器可以通过红石控制自动跳过白天。"
]);

mods.jei.JEI.addDescription(<minecraft:lapis_block>,
[
    "本整合包中主要有两种手段跳过白天！",
    "",
    "使用青金石配合血魔法模组的不完善的仪式石可以手动跳过白天。",
    "",
    "龙之进化模组的苍穹变换器可以通过红石控制自动跳过白天。"
]);

mods.jei.JEI.addDescription(<contenttweaker:make_it_night>,
[
    "本整合包中主要有两种手段跳过白天！",
    "",
    "使用青金石配合血魔法模组的不完善的仪式石可以手动跳过白天。",
    "",
    "龙之进化模组的苍穹变换器可以通过红石控制自动跳过白天。"
]);

mods.jei.JEI.addDescription(<contenttweaker:hammock>,
[
    "本整合包中主要有两种手段跳过白天！",
    "",
    "使用青金石配合血魔法模组的不完善的仪式石可以手动跳过白天。",
    "",
    "龙之进化模组的苍穹变换器可以通过红石控制自动跳过白天。"
]);

mods.jei.JEI.addDescription(<contenttweaker:skip_day>,
[
    "本整合包中主要有两种手段跳过白天！",
    "",
    "使用青金石配合血魔法模组的不完善的仪式石可以手动跳过白天。",
    "",
    "龙之进化模组的苍穹变换器可以通过红石控制自动跳过白天。"
]);

mods.jei.JEI.addDescription([<buildcraftsilicon:assembly_table>, <buildcraftsilicon:laser>],
[
    "装配台只能使用Buildcraft模组的镭射器供能！镭射器越多，速度越快！",
    "",
    "镭射器可使用任意兼容RF的线缆供能，但是有些可能会出bug断连，请使用能量导管！",
    "",
    "镭射器与装配台之间不能有障碍物！"
]);



mods.jei.JEI.addDescription(<extrabees:hive:0>,
[
    "发现于海洋和河流！掉落水生公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<extrabees:hive:1>,
[
    "发现于地下！山脉群系最多！掉落石头公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<extrabees:hive:3>,
[
    "发现于村民居所！掉落大理石公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<forestry:beehives:0>,
[
    "发现于森林！掉落森林公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<forestry:beehives:1>,
[
    "发现于平原！掉落草原公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<forestry:beehives:2>,
[
    "发现于沙漠！掉落温和公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<forestry:beehives:3>,
[
    "发现于丛林！掉落热带公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<forestry:beehives:6>,
[
    "发现于沼泽！掉落沼泽公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<forestry:beehives:5>,
[
    "发现于寒冷群系！掉落凛冬公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<forestry:beehives:4>,
[
    "发现于末地！掉落末影公主蜂和雄蜂，有概率掉落勇者蜂！"
]);

mods.jei.JEI.addDescription(<extrabees:hive:2>,
[
    "发现于下界！掉落激怒公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<magicbees:hiveblock:0>,
[
    "发现于森林！掉落神秘公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<magicbees:hiveblock:1>,
[
    "发现于平原和河流！掉落非凡公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<magicbees:hiveblock:2>,
[
    "发现于沙漠和高原！掉落巫术公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<magicbees:hiveblock:3>,
[
    "发现于地下！掉落谐振公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<magicbees:hiveblock:4>,
[
    "发现于下界！掉落地狱公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription(<magicbees:hiveblock:5>,
[
    "发现于末地！掉落湮没公主蜂和雄蜂！"
]);

mods.jei.JEI.addDescription([<tce:tce_torch_lvl1>, <tce:tce_compressed_torch_lvl1>],
[
    "加速火把可以加速附近的方块！",
    "",
    "右击打开GUI。",
    "",
    "可设置红石控制。"
]);

mods.jei.JEI.addDescription([<advancedrocketry:launchpad>,<advancedrocketry:structuretower>,<contenttweaker:launchpad>],
[
    "要发射火箭、卫星或者空间站，需要发射台多方块结构！需要在主世界搭建！",
    "",
    "放置方形的发射台，尺寸任意。发射台越大，可建造的火箭就越大！",
    "",
    "在放射台旁放置结构塔。结构塔越高，可建造的火箭就越大！",
    "",
    "组装机需要放置在发射台上方，与发射台相邻！"
]);



mods.jei.JEI.addDescription([<contenttweaker:rocket>,<advancedrocketry:rocketmotor>,<advancedrocketry:advrocketmotor>,<advancedrocketry:fueltank>,<advancedrocketry:guidancecomputer>,<advancedrocketry:seat>,<advancedrocketry:rocketbuilder>,<advancedrocketry:planetidchip>],
[
    "火箭需要发射台多方块结构！需要在主世界搭建！",
    "",
    "火箭可以由放置在发射台空间范围内任意方块构成！",
    "",
    "火箭需要引擎来推进。高级火箭发动机是最好选择！",
    "",
    "需要燃料箱来存储燃料！",
    "",
    "控制火箭需要使用导航电脑！",
    "",
    "需要座位来容纳玩家！",
    "",
    "火箭组装机可显示火箭是否满足发射条件！建造好后点击建造按钮！",
    "",
    "Shift右击导航电脑来打开火箭GUI。在导航电脑中放入星球ID芯片。使用选择界面左上角的PlanetList按钮来选择目的地！",
    "",
    "使用火箭燃料桶右击火箭为其装填燃料，或使用燃油站进行装填（放置在发射台旁，比发射台高一格）。",
    "",
    "确保太空服或附有真空密封的盔甲内有氧气！"
]);


mods.jei.JEI.addDescription([<contenttweaker:space_station>,<advancedrocketry:monitoringstation>,<advancedrocketry:spacestationchip>,<advancedrocketry:loader:1>,<advancedrocketry:stationbuilder>],
[
    "空间站需要发射台多方块结构！需要在主世界搭建！",
    "",
    "空间站可以由放置在发射台空间范围内任意方块构成！",
    "",
    "太空站组装机可显示空间站是否有效！",
    "",
    "需要空间站ID芯片和卫星仓来组装太空站！",
    "",
    "复制多份芯片以在卫星建造机中使用！",
    "",
    "建造一个有卫星仓的有效火箭，将空间站容器放入卫星仓中。",
    "",
    "将一个ID芯片放入导航电脑。",
    "",
    "进入火箭，发射！火箭将在新成型的空间站着陆！",
    "",
    "如果丢失空间站信息，可使用剩余的ID芯片搭乘其他火箭来返回空间站！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:warp_drive>,
    <advancedrocketry:warpcore>,
    <advancedrocketry:warpmonitor>],
[
    "跃迁引擎需要在空间站内构建！",
    "",
    "组装跃迁核心多方块，可使用全息投影器查看预览！",
    "",
    "向跃迁核心输入双锂。",
    "",
    "使用跃迁控制器选择目的地！",
    "",
    "某些星球需要在控制器内放置工件才能到达：",
    "塞德娜",
    "铼界",
    "恐蚁界",
    "光精界",
    "比邻星带",
    "所有强能界星球（孤寂界、茕踽界、晦暗界、惧惮界）",
    "炼金界",
    "",
    "要前往塞德娜，一次可能不够，可以先前往哈乌美亚或法拉瑟作为中转。"
]);

mods.jei.JEI.addDescription(<contenttweaker:mob_farm>,
[
    "建造刷怪场的方法有很多！创造之书中列出了所有可选项，但是推荐按以下流程进行：",
    "工业先锋",
    "Woot",
    "深度怪物学习",
    "终极生物农场",
    "",
    "在早期，刷怪的最佳手段是对泥土使用邪恶点滴来生成诅咒之土，它会像草方块一样蔓延。诅咒之土能增加敌对生物的刷新率！放置的最佳地点是Y=2处！",
    "",
    "生物粉碎机是最方便的杀怪手段。安装范围升级后可覆盖一整片诅咒之土！",
    "",
    "生物粉碎机产出的精华液可在生物复制机中生成特定生物。"
]);

mods.jei.JEI.addDescription(<industrialforegoing:mob_duplicator>,
[
    "建造刷怪场的方法有很多！创造之书中列出了所有可选项，但是推荐按以下流程进行：",
    "工业先锋",
    "Woot",
    "深度怪物学习",
    "终极生物农场",
    "",
    "在早期，刷怪的最佳手段是对泥土使用邪恶点滴来生成诅咒之土，它会像草方块一样蔓延。诅咒之土能增加敌对生物的刷新率！放置的最佳地点是Y=2处！",
    "",
    "生物粉碎机是最方便的杀怪手段。安装范围升级后可覆盖一整片诅咒之土！",
    "",
    "生物粉碎机产出的精华液可在生物复制机中生成特定生物。"
]);

mods.jei.JEI.addDescription(<industrialforegoing:mob_relocator>,
[
    "建造刷怪场的方法有很多！创造之书中列出了所有可选项，但是推荐按以下流程进行：",
    "工业先锋",
    "Woot",
    "深度怪物学习",
    "终极生物农场",
    "",
    "在早期，刷怪的最佳手段是对泥土使用邪恶点滴来生成诅咒之土，它会像草方块一样蔓延。诅咒之土能增加敌对生物的刷新率！放置的最佳地点是Y=2处！",
    "",
    "生物粉碎机是最方便的杀怪手段。安装范围升级后可覆盖一整片诅咒之土！",
    "",
    "生物粉碎机产出的精华液可在生物复制机中生成特定生物。"
]);

mods.jei.JEI.addDescription([<woot:controller>,<woot:factory>,<woot:builder>],
[
    "Woot模组可以在不生成生物的情况下制作刷怪场。注意，工厂结构会很大！",
    "",
    "Woot工厂一共有4级！每级都可掉落对应及更高一级的碎片。",
    "",
    "首先，制作工厂核心和工厂搭建器！工厂搭建器可以选择工厂等级，显示搭建工厂所需材料！使用工厂搭建器右击工厂核心来自动搭建！",
    "",
    "结构完整后，还需要手动放置一些方块。可使用YA锤子右击工厂核心来查看结构是否正确。",
    "",
    "在工厂核心下方最多10格间隔处放置以下方块，顺序从上到下：能量单元、工厂输入设备、工厂输出设备。",
    "",
    "要组成特定生物的Woot工厂，需要绑定对应生物的末影碎片。用末影碎片攻击一下所选生物，接着击杀便可将其绑定至末影碎片（碎片会拥有附魔闪光特效）。",
    "",
    "使用绑定好的碎片制作工厂控制器，将其放置在工厂核心后方方块之上来组成Woot工厂！"
]);



mods.jei.JEI.addDescription(<thaumcraft:causality_collapser>,
[
    "如何完全解锁该物品的研究：",
    "1. 扫描魔力水晶（方块，不是物品）",
    "2. 解锁神秘学中的灵气电池"
]);

mods.jei.JEI.addDescription([<contenttweaker:ritual_of_the_sleeper>, <abyssalcraft:eoa>],
[
    "通过沉睡者仪式获得！",
    "",
    "仪式必须在深渊荒原使用深渊荒原死灵之书进行。在仪式基座上放置以下材料：",
    "4个金锭",
    "1个嬗变宝石",
    "1个液态珊瑚桶",
    "1个附魔台",
    "",
    "仪式需消耗1000PE。",
	"",
	"死灵之书中有更详细信息。"
]);

mods.jei.JEI.addDescription([
    <abyssalcraft:necronomicon>,
    <abyssalcraft:necronomicon_dre>,
    <abyssalcraft:necronomicon_cor>,
    <abyssalcraft:necronomicon_omt>,
    <abyssalcraft:abyssalnomicon>],
[
    "死灵之书是深渊国度版的'法杖'，可用来进行仪式，激活机器。",
    "",
    "一共有5个级别的死灵之书，与模组内的各个维度对应。特定仪式存在等级要求，所以尽快前往模组的新维度。",
    "",
    "死灵之书需要位能（PE）来工作。可通过以下方式获得：",
    "",
    "雕像：放置在世界中，可为附近玩家手中或能量基座上的死灵之书被动充能。雕像可构成权力之地，以避免产生负面效果。查看雕像的多方块预览以了解权力之地。",
    "",
    "献祭祭坛：在祭坛周围杀死生物可为附近玩家手中或能量基座上的死灵之书充能。",
    "",
    "死灵书蜜蜂：使用死灵书蜂窝来完全充能死灵之书。使用吧唧之书来回收零充能的书",
	"",
	"要进行仪式，需要按仪式要求放置特定种类的圆石。查看多方块预览以了解如何放置。使用死灵之书右击中心的圆石来使仪式结构成型。可能会出bug，若未成形，确保仪式结构在同一区块，然后重新登陆。",
	"",
	"仪式等级，JEI中显示了每个维度的具体等级：",
	"主世界，使用原版圆石",
	"深渊荒原，使用深渊圆石",
	"恐惧之地，使用恐惧圆石",
	"奥穆索，使用伊塞斯砖块",
	"黑暗领域，使用暗色伊塞斯砖块"
]);


mods.jei.JEI.addDescription([
    <abyssalcraft:powerstonetracker>],
[
    "蕴能石追踪器与末影之眼类似，可引导你寻找恐惧之地蕴能石。",
	"",
	"蕴能石不容易找到，使用任务书中的扫描模块帮助寻找！"
]);

mods.jei.JEI.addDescription([
    <abyssalcraft:drainstaff:0>,
    <abyssalcraft:drainstaff:1>,
    <abyssalcraft:drainstaff:2>,
    <abyssalcraft:drainstaff:3>,
    <abyssalcraft:staff>],
[
    "法杖用于制作深渊国度模组的精华。",
    "",
    "对深渊国度模组对应维度的怪物右击，消耗其生命来吸收能量。",
	"",
	"达到阈值后，会产出精华。"
]);


mods.jei.JEI.addDescription(<contenttweaker:infernal_furnace>,
[
    "炼狱熔炉是一个3x3x3大小的多方块。在JEI中查看结构预览。",
    "",
    "使用世界盐右击结构来使熔炉成型。",
    "",
    "该多方块会产出咒波，想自动化的话请确保有清除咒波的手段！",
    "",
    "从上方丢入物品来进行烧炼。锭有概率产出额外粒，肉有概率产出额外肉粒！"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:chunk:0>,
    <thaumcraft:chunk:1>,
    <thaumcraft:chunk:2>,
    <thaumcraft:chunk:3>,
    <thaumcraft:chunk:4>,
    <thaumcraft:chunk:5>],
[
    "炼狱熔炉是一个3x3x3大小的多方块。",
    "结构的竖直四角由地狱砖构成。",
    "其中一个侧面的中心为铁栏杆。",
    "二三层中心方块留空。",
    "其余地方放置黑曜石。",
    "立方体中心为熔岩。",
    "使用世界盐右击结构来使熔炉成型。",
    "",
    "从上方丢入物品来进行烧炼。锭有概率产出额外粒，肉有概率产出额外肉粒！"
]);

mods.jei.JEI.addDescription(<techreborn:machine_frame:0>,
[
    "科技复兴模组的机器能接受的能量有上限。可使用变压器升级增加！",
    "",
    "超频升级可提高机器速度！",
    "",
    "储能升级可增加机器能量缓存！"
]);
mods.jei.JEI.addDescription(<techreborn:machine_frame:1>,
[
    "科技复兴模组的机器能接受的能量有上限。可使用变压器升级增加！",
    "",
    "超频升级可提高机器速度！",
    "",
    "储能升级可增加机器能量缓存！"
]);
mods.jei.JEI.addDescription(<techreborn:machine_frame:2>,
[
    "科技复兴模组的机器能接受的能量有上限。可使用变压器升级增加！",
    "",
    "超频升级可提高机器速度！",
    "",
    "储能升级可增加机器能量缓存！"
]);
mods.jei.JEI.addDescription(<techreborn:upgrades:0>,
[
    "科技复兴模组的机器能接受的能量有上限。可使用变压器升级增加！",
    "",
    "超频升级可提高机器速度！",
    "",
    "储能升级可增加机器能量缓存！"
]);
mods.jei.JEI.addDescription(<techreborn:upgrades:1>,
[
    "科技复兴模组的机器能接受的能量有上限。可使用变压器升级增加！",
    "",
    "超频升级可提高机器速度！",
    "",
    "储能升级可增加机器能量缓存！"
]);
mods.jei.JEI.addDescription(<techreborn:upgrades:2>,
[
    "科技复兴模组的机器能接受的能量有上限。可使用变压器升级增加！",
    "",
    "超频升级可提高机器速度！",
    "",
    "储能升级可增加机器能量缓存！"
]);

mods.jei.JEI.addDescription(<techreborn:fusion_control_computer>,
[
    "固态聚变反应堆是一个多方块结构！需要一圈固态聚变线圈和一个固态聚变控制计算机。可使用线圈右击控制器进行自动放置！",
    "",
    "反应堆可以是多种尺寸，但除了钷和钌的配方，均应使用最小尺寸。",
    "",
    "对于负能量配方（查看JEI），反应堆越大能量消耗越大。",
    "",
    "对于正能量配方（钷和钌），反应堆越大产出能量越大。"
]);
mods.jei.JEI.addDescription(<techreborn:fusion_coil>,
[
    "固态聚变反应堆是一个多方块结构！需要一圈固态聚变线圈和一个固态聚变控制计算机。可使用线圈右击控制器进行自动放置！",
    "",
    "反应堆可以是多种尺寸，但除了钷和钌的配方，均应使用最小尺寸。",
    "",
    "对于负能量配方（查看JEI），反应堆越大能量消耗越大。",
    "",
    "对于正能量配方（钷和钌），反应堆越大产出能量越大。"
]);
mods.jei.JEI.addDescription(<contenttweaker:plasma_wood>,
[
    "固态聚变反应堆是一个多方块结构！需要一圈固态聚变线圈和一个固态聚变控制计算机。可使用线圈右击控制器进行自动放置！",
    "",
    "反应堆可以是多种尺寸，但除了钷和钌的配方，均应使用最小尺寸。",
    "",
    "对于负能量配方（查看JEI），反应堆越大能量消耗越大。",
    "",
    "对于正能量配方（钷和钌），反应堆越大产出能量越大。"
]);


mods.jei.JEI.addDescription(<nuclearcraft:fusion_core>,
[
    "磁约束聚变反应堆是由聚变堆核心、大量电磁体以及至少四个聚变连接器构成的多方块结构！",
    "",
    "聚变连接器从聚变堆核心的四个侧面向外沿直线放置。每面至少需要一个。",
    "聚变连接器越长，能量输出越高！四个连接器臂长度需相等！",
    "",
    "电磁体以4个方形环状与连接器相邻放置，查看多方块预览中单个连接器下的建造配置。",
    "",
    "将电磁体与通量接出点或其他能量传输方块连接充能，直到所有电磁体都变为绿色。",
    "",
    "反应堆启动后，温度会逐渐上升直到热量槽充满。在此期间，反应堆会消耗能量。",
    "",
    "热量槽充满后，反应堆会进入操作模式，开始产出能量。在此阶段，反应堆必须被冷却。一旦温度过高，结构将融化。",
    "",
    "要冷却反应堆，在电磁体周围放置液冷器，向液冷器中输送水。",
    "液冷器相对于反应堆核心中心对称时，效率最高。",
    "反应堆在100%效率下产能最大！不能多也不能少。"
]);


mods.jei.JEI.addDescription(<industrialforegoing:tinydryrubber>,
[
    "需要树液提取器和胶乳加工机来制作小块干橡胶！",
    "",
    "树液提取器可缓慢破坏前方木头来产出胶乳。多个提取器可同时对同一块木头工作！",
    "可使用任意方块放置手段（推荐使用者）来自动化！",
    "",
    "胶乳加工机消耗水、胶乳和能量产出小块干橡胶！"
]);

mods.jei.JEI.addDescription(<industrialforegoing:latex_processing_unit>,
[
    "需要树液提取器和胶乳加工机来制作小块干橡胶！",
    "",
    "树液提取器可缓慢破坏前方木头来产出胶乳。多个提取器可同时对同一块木头工作！",
    "可使用任意方块放置手段（推荐使用者）来自动化！",
    "",
    "胶乳加工机消耗水、胶乳和能量产出小块干橡胶！"
]);

mods.jei.JEI.addDescription(<industrialforegoing:tree_fluid_extractor>,
[
    "需要树液提取器和胶乳加工机来制作小块干橡胶！",
    "",
    "树液提取器可缓慢破坏前方木头来产出胶乳。多个提取器可同时对同一块木头工作！",
    "可使用任意方块放置手段（推荐使用者）来自动化！",
    "",
    "胶乳加工机消耗水、胶乳和能量产出小块干橡胶！"
]);

mods.jei.JEI.addDescription(<contenttweaker:early_game_energy>,
[
    "前期推荐按以下流程发电：",
    "1. 热传导发电器（起步）",
    "2. 任意热力膨胀模组的能源炉（多堆量），或者沉浸工程模组的柴油发电机",
    "3. 压缩引擎（用于运行神话采掘机）",
    "4. 极限反应堆模组，使用黄铀",
    "5. 核电工艺"
]);

mods.jei.JEI.addDescription(<astralsorcery:itemwand>,
[
    "需要星能的配方可在星辉魔法的大型神庙中进行！",
    "",
    "在聚能水晶下放置工作台，水晶上方需露天。",
    "",
    "星能配方只可在夜晚进行！"
]);

mods.jei.JEI.addDescription(<astralsorcery:blockaltar:0>,
[
    "需要星能的配方可在星辉魔法的大型神庙中进行！",
    "",
    "在聚能水晶下放置工作台，水晶上方需露天。",
    "",
    "星能配方只可在夜晚进行！"
]);

mods.jei.JEI.addDescription(<appliedenergistics2:part:360>,
[
    "ME合成终端可以访问AE2网络中的所有物品，本身还自带一个工作台！",
    "",
    "可以通过JEI填充配方。若物品在JEI配方预览中显示为蓝色，则可中键点击该物品来自动合成！"
]);

mods.jei.JEI.addDescription(<appliedenergistics2:part:380>,
[
    "ME终端可以访问AE2网络中的所有物品。你应该把它升级为合成终端！"
]);

mods.jei.JEI.addDescription([<appliedenergistics2:part:340>,<appliedenergistics2:part:340>],
[
    "ME样板终端可以编码样板来进行自动合成。",
    "",
    "样板有两种模式：'合成样板'，可用于分子装配室；'处理样板'，可用于和接口相连的机器交互！",
    "",
    "在JEI中对物品按R键将其作为配方添加。从JEI中点击并拖拽物品将其手动添加到配方中！"
]);

mods.jei.JEI.addDescription(<appliedenergistics2:part:480>,
[
    "ME接口终端可查看网络中的所有接口！",
    "",
    "每个接口都可重命名，可以从该终端中直接把样板放入接口！"
]);

mods.jei.JEI.addDescription(<appliedenergistics2:part:520>,
[
    "ME流体终端可查看网络中的所有流体！"
]);

mods.jei.JEI.addDescription(<ae2fc:part_fluid_pattern_terminal>,
[
    "ME流体样板终端与ME样板终端类似，但是可用于流体！"
]);

mods.jei.JEI.addDescription(<erebus:portal_activator>,
[
    "混沌之地传送门的一部分！",
    "",
    "使用石砖建造任意尺寸的传送门框架，在其中放满树叶！",
    "",
    "在传送门6格范围内放置盖亚楔石。",
    "",
    "对楔石使用盖亚权杖来打开传送门。可能会出bug，可改变楔石位置多次尝试！",
    "",
    "需要额外一个盖亚权杖用来返回！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:connector:0>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:connector:1>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:wirecoil:0>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:wirecoil:6>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:connector:2>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:connector:3>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:wirecoil:1>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:wirecoil:7>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:connector:4>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:connector:5>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<immersiveengineering:wirecoil:2>,
[
    "将接线器放置在想要传输能量的方块上，使用线圈右击接线器以相互连接。",
    "",
    "线圈的范围为16格（高压线圈为32格），如果接线端超出范围，需要在中间放置继电器！",
    "",
    "接线器只能与一个接线器连接，继电器则无连接数限制！",
    "",
    "若电流过大，线缆将烧毁！",
    "",
    "非绝缘线圈会在接触时造成伤害！"
]);

mods.jei.JEI.addDescription(<tesslocator:basic_item_tesslocator>,
[
    "在同一方块空间内放置两个超转运体来在二者间传输物品。",
    "",
    "橙色：输出",
    "蓝色：输入",
    "",
    "放入荧石来增加速度。",
    "放入钻石增加每次传输物品的数量。",
    "在满升级状态下，超转运体是本整合包中最快的物品传输手段之一！"
]);

mods.jei.JEI.addDescription(<tesslocator:basic_fluid_tesslocator>,
[
    "在同一方块空间内放置两个超转运体来在二者间传输流体。"
]);

mods.jei.JEI.addDescription(<tesslocator:basic_energy_tesslocator>,
[
    "在同一方块空间内放置两个超转运体来在二者间传输能量。"
]);

mods.jei.JEI.addDescription(<enderio:item_item_conduit>,
[
    "所有类型导管可共享方块空间，在密集型自动化中非常实用！",
    "",
    "空手右击导管接口进行配置，也可使用新月锤Shift左击导管！",
    "",
    "每个连接都可配置输入输出，还可配置红石模式。'始终工作'模式默认关闭！",
    "",
    "导管有频道区分，对应原版中的16中颜色！相同颜色的频道会互相连通。同一根导管中可传输多种频道！",
    "",
    "输入和输出都可使用过滤器进行配置，还有速度升级！在JEI中搜索'导管'来查看所有可用过滤器！"
]);

mods.jei.JEI.addDescription(<enderio:item_liquid_conduit>,
[
    "所有类型导管可共享方块空间，在密集型自动化中非常实用！",
    "",
    "空手右击导管接口进行配置，也可使用新月锤Shift左击导管！",
    "",
    "每个连接都可配置输入输出，还可配置红石模式。'始终工作'模式默认关闭！",
    "",
    "导管有频道区分，对应原版中的16中颜色！相同颜色的频道会互相连通。同一根导管中可传输多种频道！",
    "",
    "输入和输出都可使用过滤器进行配置，还有速度升级！在JEI中搜索'导管'来查看所有可用过滤器！"
]);

mods.jei.JEI.addDescription(<enderio:item_liquid_conduit:1>,
[
    "所有类型导管可共享方块空间，在密集型自动化中非常实用！",
    "",
    "空手右击导管接口进行配置，也可使用新月锤Shift左击导管！",
    "",
    "每个连接都可配置输入输出，还可配置红石模式。'始终工作'模式默认关闭！",
    "",
    "导管有频道区分，对应原版中的16中颜色！相同颜色的频道会互相连通。同一根导管中可传输多种频道！",
    "",
    "输入和输出都可使用过滤器进行配置，还有速度升级！在JEI中搜索'导管'来查看所有可用过滤器！"
]);

mods.jei.JEI.addDescription(<enderio:item_liquid_conduit:2>,
[
     "所有类型导管可共享方块空间，在密集型自动化中非常实用！",
    "",
    "空手右击导管接口进行配置，也可使用新月锤Shift左击导管！",
    "",
    "每个连接都可配置输入输出，还可配置红石模式。'始终工作'模式默认关闭！",
    "",
    "导管有频道区分，对应原版中的16中颜色！相同颜色的频道会互相连通。同一根导管中可传输多种频道！",
    "",
    "输入和输出都可使用过滤器进行配置，还有速度升级！在JEI中搜索'导管'来查看所有可用过滤器！"
]);

mods.jei.JEI.addDescription(<thermaldynamics:servo:0>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "伺服器可以从容器中提取物品或流体并传输到其他容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:servo:1>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "伺服器可以从容器中提取物品或流体并传输到其他容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:servo:2>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "伺服器可以从容器中提取物品或流体并传输到其他容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:servo:3>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "伺服器可以从容器中提取物品或流体并传输到其他容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:servo:4>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "伺服器可以从容器中提取物品或流体并传输到其他容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:filter:0>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "过滤器可选择特定物品或流体，允许/阻止其进入容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:filter:1>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",

    "",
    "过滤器可选择特定物品或流体，允许/阻止其进入容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:filter:2>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "过滤器可选择特定物品或流体，允许/阻止其进入容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:filter:3>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "过滤器可选择特定物品或流体，允许/阻止其进入容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:filter:4>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "过滤器可选择特定物品或流体，允许/阻止其进入容器。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:retriever:0>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "检索器可从其他容器中抽取物品或流体。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:retriever:1>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "检索器可从其他容器中抽取物品或流体。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:retriever:2>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "检索器可从其他容器中抽取物品或流体。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:retriever:3>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "检索器可从其他容器中抽取物品或流体。"
]);

mods.jei.JEI.addDescription(<thermaldynamics:retriever:4>,
[
    "伺服器自带白名单/黑名单，并且有多种红石模式。",
    "",
    "对管道与容器的连接端右击来安装伺服器。使用新月锤来移除！",
    "",
    "检索器可从其他容器中抽取物品或流体。"
]);

mods.jei.JEI.addDescription(<contenttweaker:magic_strategy_technologist>,
[
    "首先发展植物魔法和巫师之路，这可解锁建造机和模块化机械！",
    "之后的每个魔法模组都可进行自动化！",
    "",
    "接着发展血魔法（获得跳过白天的能力），然后是星辉魔法和巫术学！",
    "",
    "最后发展神秘时代和深渊国度！遵循任务书给的发展线路！"
]);

mods.jei.JEI.addDescription(<contenttweaker:magic_strategy_warrior>,
[
    "首先发展巫术学，前期最好的攻击手段！",
    "",
    "接着发展血魔法（获得跳过白天的能力），然后是星辉魔法。",
    "",
    "发展植物魔法和巫师之路来解锁建造机和模块化机械！",
    "",
    "最后发展神秘时代和深渊国度！遵循任务书给的发展线路！"
]);

mods.jei.JEI.addDescription(<contenttweaker:magic_strategy_warped>,
[
    "首先发展血魔法来解锁邪术意志仪式！",
    "",
    "在神秘时代中陷入疯狂，解锁祛邪肥皂。",
    "",
    "在深渊国度那儿得了PTSD！但你能获得奥穆索扭曲净化符咒！",
    "",
    "解锁所有神秘时代研究，解锁秘金盔甲！",
    "",
    "穿过巫师之路和植物魔法，解锁建造机和模块化机械！",
    "",
    "以巫术学和星辉魔法作为结尾。"
]);

mods.jei.JEI.addDescription(<contenttweaker:mining_advice>,
[
    "推荐使用以下思路来获取矿物资源！",
    "",
    "1. 获得基础工具，前往Y=17以下获得足够的卢比锭来制作锹镐斧！",
    "",
    "2. 用锹镐斧在Y=10以下挖掘[虚无]蓝宝石，来制作匠魂的锤头模具！震击是个不错的属性，因为有急迫效果！",
    "",
    "3. 解锁高级合成后，制作毁灭燧石。一开始你得用煤炭充能，但很快就能换成卡莱恩能量之星了！",
    "",
    "4. 在解锁植物魔法后用建造机来自动挖矿！如果有发展过星辉魔法，将建造机与晶金座仪式组合来获得无限矿物！",
    "",
    "5. 环境科技的虚空矿物采掘机！"
]);

mods.jei.JEI.addDescription(<contenttweaker:ae2_base_management>,
[
    "组建AE2网络时，应遵循以下惯例！",
    "",
    "确保整个网络（每根线缆和设备）所在区块处于加载状态！FTB Chunks模组有时不是很可靠，所以最好使用区块和节点载入器！",
    "",
    "不要回接线缆！千万不要！染色线缆和线缆锚是你的好伙伴！",
    "",
    "用单独的子网来存储流体，在终端中隐藏流体，避免使用下单合成处理流体配方。网络中流体值的持续变动会导致卡顿！最好使用其他手段来被动生产流体！",
    "",
    "确保网络能量供应（能源元件）充足！你可能需要在量子网桥的两侧都放一些能源元件！",
    "",
    "关闭高级提示框（F3+H）！可以减少终端界面的卡顿！"
]);


mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_blast_furnace>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "", "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  
    "焦煤块可发现于图书馆结构的屋顶，馆内有鞘翅，还会生成死灵书。",
    "",
    "高炉砖可发现于篝火处的石化食人妖营地，以及由干燥黏土砖构成的瞭望塔中（里面还藏有墨囊黑鸡蛋）！"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_haumea>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "气泡铃建筑内有四个告示牌，代表四种符文，殷钢为奇点！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将殷钢奇点与以下符文结合：幸运、战斗、损毁、净化。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_spatialphaser>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在伊甸有隐藏的板条箱，里面有某些特定物品。将这些物品与正确的方块结合，伊甸中的箱子会显示配方。将合成的物品与惰性空间移相器结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "分别将以下物品与三个石砖结合：钻石、海蓝球、仙人掌绿、铁锭。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_deepmetamorphic>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "深层维度的两种结构将指引你。一个指示配方的形状，另一个指示排列顺序。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "使用该配方制作：",
    "裂纹死岩，天堂石头，赫尔维蒂石头；",
    "圣苔石，深层岩石，松动的石头；",
    "变质雪原圆石（非凿子模组），恐惧圆石（非凿子模组），暮光石头"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_phasinggem>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "需要在正确的维度与正确的群系使用空间移相器，赫尔维蒂维度有你需要的信息！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在蠕变维度中的9x9大小的地下花园（Undergarden）群系使用空间移相器。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_barongem>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "配方的布局可在爵士维度的箱子里发现。其中一个物品需要重命名，爵士维度的一个敌人会告诉你如何重命名。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在工作台内，用红石水晶块环绕被重命名为'Ashari'的爵士方块。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_branchoflife>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "光精界的一种结构里有方块虫子，里面的箱子会告诉你如何制作。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将压缩圆石与以下树苗结合：天青色天堂、卢卡罗斯、鬼魅、蓝色玩具。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_rosidianblend>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "花园维度的板条箱里有很多粉末。他们将告诉你该用什么小堆粉与伊甸果结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将伊甸果与以下小堆粉结合：地狱岩、红宝石、蓝宝石、磷、大理石、闪锌矿、方铅矿、黄铁矿。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_livingmyrmitite>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "传说维度的箱子里有四种强化手册！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将恐蚁金属锭与以下强化手册结合：毁灭光环（等级2）、掠夺农夫（等级4）、经验加成（等级5）、锋利剃刀（等级5）。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_marksamurai>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "需要一件盔甲和8种果实来制作该物品，铼界的箱子和告示牌会告诉你使用何种盔甲与果实。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将惧质武士头盔与以下要素果实结合：Celawynn、Azuwynn、Yeowynn、Geoliirgaz、Armaniis、Fergalaz、Firnalaz、Ordaniis。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_kikoku>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "要制作配方所需精华，将递归粉末与被正确命名的纸结合。铼界的房子会告诉你纸名拼出的单词。从左上角开始，顺时针！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "遵循以下配方：",
    "<C> <H> <A>",
    "<S> <递归粉末> <M>",
    "<E> <R> <B>"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_recursiveimprisonment>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "使用开放式方块模组的正确种类模板压制正确的香料。[虚无]月球维度会告诉你使用何种模板，以及何种植物来制作香料。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将丁香与以下开放式方块模组的模板结合：爬行者脸、竖状条纹、螺旋、箱子。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_runicore>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "附魔山脉会生成多种矿物，使用催化室与异形之石将其处理为奇异矿簇。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将符文矿石与以下奇异矿簇结合：朱砂、金、铅。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_mysterium>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "秘境维度有四种血魔法主题的结构？检查其使用的方块，阅读告示牌！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "配方布局：月球块在中心，上面是宝珠符文，右边是充能符文，左边是牺牲符文，下面是速度符文。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_runandor>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "符境维度有三种结构，里面的箱子装有多种符文。总共是8种符文！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将装满熔融荧银的开放式方块模组的蓄水槽，与以下符文结合：定位、暴风、扭曲、动能、雷鸣、剧毒、火焰、凋灵。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_osiris>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "", "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "黑色金属盔甲，以及秘银锭 :)",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "用秘银锭环绕黑色金属盔甲。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_ptah>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "按U键查看蜂标蜂窝的用途！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将使用以下试剂与蜂标蜂窝制成的浓缩药水结合：风、急速、闪电、获取、磁引。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_hator>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "腐化超空间之心由小Boss掉落，在本世界中找到其他5种材料！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "按以下配方合成：三弧饰在中心，四角放置腐化超空间之心，其余槽位分别为反物质鸡肉、反物质猪肉、反物质蜘蛛眼、反物质骨头。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_europa>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  
    "有七罪宗符文和七种阿兹勒赫瓷砖！它们有什么共同点？9 10 11 12 13 14 15",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "分别用具有相同元数据的阿兹勒赫瓷砖环绕对应的七宗罪符文（欲望、暴食、贪婪、懒惰、暴怒、嫉妒、傲慢）。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_oi>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  
    "本世界会告诉你使用何种同位素，在死亡之水附近寻找！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将亡灵核心与以下同位素结合：锫-248、钚-238、氧化锎-249、氧化镎-237。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_falacer>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "总共要用到8种蜂窝，其中4种来自本世界，4种在气泡铃建筑内的告示牌上！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将褐铁子弹与以下蜂窝结合：纸质、蜕变、平凡、熔融、炸弹、大炮、手枪、狙击步枪。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_orcus>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "有两种不同颜色的剑座，每种总共有四柄剑，对应两种配方！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "两个配方。将注血维度锭与海齿剑、魔化单刃剑、骏鹰爪剑、黑暗木剑结合。",
    "将注血维度锭与腿骨剑、粘骨剑、黄蜂剑、龙骨剑结合。",
    "所有剑都可在奥迦斯找到。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_furnacedim>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "主世界的某栋村民房子里有实用的便携战利品，下界天花板上的某本书会告诉你如何使用！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将装满熔融炎岩的恶魔桶与便携熔炉结合！"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_sedna>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "塞德娜粉不是塞德娜金属粉！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "用引力蜂窝环绕塞德娜粉（不是塞德娜金属粉）。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_first_shell>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "深渊维度有一座危险的神庙，其正面有一些结晶簇……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将诸神黄昏印记与以下结晶簇结合：铜、甲烷、硝酸、氧。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_second_shell>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "原始森林召唤石里有四个刷怪蛋……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将献祭契约与以下生物的灵魂瓶结合：寄生幼虫、火焰棘背兽、赛默、治疗傀儡。",
    "四种生物可在原始森林召唤石中找到！"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_third_shell>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "附魔山脉有个乐透建筑，看看里面的箱子！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将黑暗之书与以下嵌宝旗帜结合：嗜血、远古、暴风、机甲、纳德吉克、符文、召唤、虚空。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_fourth_shell>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "空境召唤石中间肯定存在有趣的形状……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在空境，站在由紫珀块构成的结构顶部，使用图丽石之花。",
    "第一层（0为空，x为紫珀块）:",
    "0 x x x 0",
    "x 0 x 0 x",
    "x x x x x",
    "x 0 x 0 x",
    "0 x x x 0",
    "第二层：",
    "0 x 0 x 0",
    "x 0 0 0 x",
    "0 0 x 0 0",
    "x 0 0 0 x",
    "0 x 0 x 0"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_vethea>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "有些匠魂部件可以用团块制作 ;)",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将投影宝石与以下匠魂部件结合：玉 坚韧手柄、末地烛 蓄电池、钛 枪管、星辉 激光传导器。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_masterwizards>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在地平界有四种特殊南瓜。用对应生物的灵魂瓶，与星辉活化器结合！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将星辉活化器与以下灵魂瓶结合：独眼巨人、恶魂、骷髅、冰霜怪。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_sparkledoak>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "三一召唤石里的基座上有些有趣的东西。将正确的木板与正确的武器结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将神圣橡木木板与首领烟火炮结合。武器在配方中可重复使用！"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_recursion_dungeon>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "检查神庙顶部，有两种配方，左和右！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将神圣橡果与以下职业蜜蜂模组的树皮结合：[混沌之地]桉树、塞尔瑞、柚树、巴西红木、熔融木、橄榄树、雪松、死域。",
    "将神圣橡果与以下职业蜜蜂模组的树皮结合：黑暗木、大绿柄桑木、地狱皮木、暗影木、猴面包树、龙血木、符文木、苍穹木。"
]);

mods.jei.JEI.addDescription(<bloodmagic:altar>,
[
    "祭坛需要生命源质（LP）进行合成，JEI中显示了配方要求的祭坛等级和LP消耗量。",
    "",
    "指示之书可与查看每级祭坛的多方块预览。",
    "",
    "推荐遵循以下流程产出LP：",
    "1a. 使用牺牲匕首伤害自己来产生LP，直到能制作仪式推测杖 [薄暮]",
    "1b. 如果用刀划拉自己让你感觉不舒服，可以使用献祭刀在祭坛附近杀死生物来产生LP",
    "3. 使用剔除仪式配合刷怪场场（任务书中有更多信息）。灵魂碎片可用来制作刷怪速度最快的灵魂笼 ;)",
    "4. 数字化苦难之井"
]);

mods.jei.JEI.addDescription(<bloodmagic:blood_orb>,
[
    "使用气血宝珠来创建LP网络。使用宝珠右击将其与玩家绑定。",
    "",
    "LP网络可为所有仪式供能。",
    "",
    "在血之祭坛上放置气血宝珠来为LP网络提供LP。",
    "",
    "气血宝珠等级越高，LP网络的容量越大。",
    "",
    "容量：",
    "虚弱 5'000",
    "学徒 25'000",
    "法师 150'000",
    "导师 1'000'000",
    "贤者 10'000'000",
    "卓越 30'000'000"
]);


mods.jei.JEI.addDescription(<projectex:stone_table>,
[
    "转化桌可学习和制作拥有EMC值的物品！",
    "",
    "将物品放入转化桌，或者放入有火焰的槽位来学习物品！",
    "",
    "燃烧物品可向网络中增加EMC，所有转化桌共享该网络。",
    "",
    "只要网络中有足够的EMC，就能直接取出已学习的物品！",
    "",
    "卡莱恩能量之星可以用网络的EMC充能，从而为其他消耗EMC的物品供能！"
]);
mods.jei.JEI.addDescription(<projecte:transmutation_table>,
[
    "转化桌可学习和制作拥有EMC值的物品！",
    "",
    "将物品放入转化桌，或者放入有火焰的槽位来学习物品！",
    "",
    "燃烧物品可向网络中增加EMC，所有转化桌共享该网络。",
    "",
    "只要网络中有足够的EMC，就能直接取出已学习的物品！",
    "",
    "卡莱恩能量之星可以用网络的EMC充能，从而为其他消耗EMC的物品供能！"
]);
mods.jei.JEI.addDescription(<projecte:item.pe_transmutation_tablet>,
[
    "转化桌可学习和制作拥有EMC值的物品！",
    "",
    "将物品放入转化桌，或者放入有火焰的槽位来学习物品！",
    "",
    "燃烧物品可向网络中增加EMC，所有转化桌共享该网络。",
    "",
    "只要网络中有足够的EMC，就能直接取出已学习的物品！",
    "",
    "卡莱恩能量之星可以用网络的EMC充能，从而为其他消耗EMC的物品供能！"
]);
mods.jei.JEI.addDescription(<projectex:arcane_tablet>,
[
    "转化桌可学习和制作拥有EMC值的物品！",
    "",
    "将物品放入转化桌，或者放入有火焰的槽位来学习物品！",
    "",
    "燃烧物品可向网络中增加EMC，所有转化桌共享该网络。",
    "",
    "只要网络中有足够的EMC，就能直接取出已学习的物品！",
    "",
    "卡莱恩能量之星可以用网络的EMC充能，从而为其他消耗EMC的物品供能！"
]);

mods.jei.JEI.addDescription(<contenttweaker:mk1_power_flower>,
[
    "使用以下方法来刷取EMC制作拥有中等EMC值（小于100k）的物品。",
    "",
    "使用龙心循环来大量产出EMC！",
    "",
    "对于低EMC值物品，用些能量收集器和反物质继电器就够了！",
    "",
    "在解锁后，应转用力量花盆栽罐和EMC接口！"
]);


mods.jei.JEI.addDescription([<tconstruct:smeltery_controller>, <tconstruct:seared_tank>, <tconstruct:smeltery_io>, <tconstruct:seared>],
[
    "冶炼炉是匠魂模组的主要多方块结构！它能够将矿物和其他金属物品熔炼为熔融流体。",
    "",
    "冶炼炉可以是底面不超过9x9（不含边框）的任意立方体，可以用任意焦黑方块构成。",
    "",
    "结构需要一个冶炼炉控制器，替换任意侧面方块即可！物品可通过控制器输入。",
    "",
    "结构需要至少一个焦黑储罐，替换任意侧面方块即可！通过储罐为冶炼炉输入燃料。熔岩是最易获得的燃料。",
    "",
    "要从冶炼炉中输出流体，需要焦黑排液口。替换任意侧面方块即可！",
    "",
    "可使用流体管道从排液口抽取流体。末影接口的流体导管也可以，但有可能会出bug。"
]);

mods.jei.JEI.addDescription(<ore:cast>,
[
    "要制作铸模，首先需要在部件加工台中制作对应部件。推荐使用例如圆石的廉价材料。",
    "",
    "将部件放入浇筑台，右击浇筑台上方的浇筑口来使用浇筑材料进行浇筑。",
    "",
    "浇筑材料可以是熔融金或熔融铝黄铜！",
    "",
    "制作出铸模后，可将其放入浇筑台中，从而使用金属材料制作部件！"
]);


mods.jei.JEI.addDescription(<gendustry:sampler>,
[
    "使用基因采样机、基因转换机和基因压印机来优化蜜蜂基因。",
    "",
    "基因采样机可以消耗所给蜜蜂，产出其基因样本。",
    "",
    "每种蜜蜂都有值得获取的基因，你可以将多余的雄蜂输入采样机，直到获得想要的基因样本！",
    "",
    "前往创造之书章节查看拥有最佳基因的蜜蜂列表！"
]);

mods.jei.JEI.addDescription(<gendustry:transposer>,
[
    "使用基因采样机、基因转换机和基因压印机来优化蜜蜂基因。",
    "",
    "基因转换机主要有两种功能。",
    "",
    "第一，它可以用于复制基因样本，放入空白基因样本与含有信息的基因样本来进行复制！通过此方法来获得制作加速火把的材料！",
    "",
    "第二，可以在工作台中将基因样本与基因模板合成，从而将其基因添加到模板中，之后可用模板自定义蜜蜂！",
    "",
    "注意：模板不需要具备全部12种基因！"
]);

mods.jei.JEI.addDescription(<gendustry:imprinter>,
[
    "使用基因采样机、基因转换机和基因压印机来优化蜜蜂基因。",
    "",
    "通过制好的基因样板，使用基因压印机来编辑蜜蜂基因。",
    "",
    "警告：蜜蜂有概率变为垃圾基因，放入公主蜂和蜂后时要小心。",
    "",
    "建议压印大量雄蜂，然后不停与同一公主蜂繁殖直到基因完全转移。"
]);

mods.jei.JEI.addDescription(<modularmachinery:itemblueprint>,
[
    "使用钻石凿子来切换不同蓝图！",
    "",
    "以下蓝图可直接合成，并用于转化为其他所有蓝图！",
    "热钢混合器 - 大部分机械！",
    "泰拉神话虚空资源采掘机 - 所有神话采掘机！",
    "中子炮 - 第6章的多方块！",
    "相对论坍缩器 - 第9章的多方块！",
    "神话处理器：合金炉 - 所有神话处理器！",
    "自动奥术工作台 - 所有魔法多方块！"
]);

mods.jei.JEI.addDescription(<contenttweaker:recursive_recipes>,
[
    "有两类递归配方。一些配方的输入物可重复使用，另一些则不可。",
    "",
    "对于两种类型来说，在设置自动合成配方时，被复制的物品都不应被标记为输入物。将配方设置为处理模式，除递归物品之外的材料设为输入物，用接口操作RFTools模组的自动合成台。",
    "",
    "对输入物可重复使用的配方来说：将合成机设置为ExtC模式，并记录输入中可重复使用物品所在槽位。",
    "",
    "对输入物不可重复使用的配方来说：同样将合成机设置为ExtC模式，使用物品导管（可自供给）将不可重复使用的递归物品输送回输入栏。",
    ""
]);

mods.jei.JEI.addDescription([<extrautils2:compressedcobblestone:0>,
    <extrautils2:compressedcobblestone:1>,
    <extrautils2:compressedcobblestone:2>,
    <extrautils2:compressedcobblestone:3>,
    <extrautils2:compressedcobblestone:4>,
    <extrautils2:compressedcobblestone:5>,
    <extrautils2:compressedcobblestone:6>,
    <extrautils2:compressedcobblestone:7>],
[
    "要自动化压缩圆石，首先使用等价交换或核电工艺生产圆石，将其输入到压缩抽屉中。",
    "",
    "一个圆石生产单元由能量凝聚器 MK1及其上方的能量收集器（最好是MK3）构成。每个凝聚器只需要一个收集器。若想要更多圆石，就使用更多单元。",
    "",
    "与EMC设计相比，致密造石机也是可行的选择。",
    "",
    "压缩圆石的最佳手段是压缩抽屉，通过压缩抽屉逐级获得所需重数的压缩圆石。",
    "",
    "超转运体可用于快速运输圆石！"
]);

mods.jei.JEI.addDescription([<contenttweaker:making_will>,
    <bloodmagic:item_demon_crystal:0>],
[
    "需要恶魔坩埚和恶魔结晶坛来制作第一份意志晶体。",
    "",
    "在恶魔坩埚中放置任意种类的地狱魂石。它会吸收魂石中的恶魔意志，将其释放到所在区块。",
    "",
    "在同一区块中放置恶魔结晶坛。最终，其中会生长出意志水晶。将其破坏来获得原生意志晶体！",
    "",
    "灵域测量仪可显示区块中每种意志的含量。",
    "========================"
]);

mods.jei.JEI.addDescription([<contenttweaker:making_colored_will>,
    <bloodmagic:item_demon_crystal:1>,
    <bloodmagic:item_demon_crystal:2>,
    <bloodmagic:item_demon_crystal:3>,
    <bloodmagic:item_demon_crystal:4>],
[
    "使用结晶共鸣仪式来获得第一份特殊意志晶体。",
    "",
    "通过恶魔坩埚或其他手段向区块中释放原生意志，然后在主仪式石上放置恶魔结晶坛，来让原生意志晶体生长。",
    "",
    "只要区块中的原生意志足够，其他种类的意志晶体最终会在仪式上长出。",
    "========================"
]);

mods.jei.JEI.addDescription([<contenttweaker:farming_will>,
    <bloodmagic:item_demon_crystal:0>,
    <bloodmagic:item_demon_crystal:1>,
    <bloodmagic:item_demon_crystal:2>,
    <bloodmagic:item_demon_crystal:3>,
    <bloodmagic:item_demon_crystal:4>],
[
    "可通过以下方法实现意志晶体自动化。",
    "",
    "需要一定数量（10个，20个更安全）的每种意志晶体来启动该过程，启动后不需要消耗晶体运行。",
    "",
    "需要在同区块内运行两个仪式。碎晶裂纹仪式在顶部，孤魂集会仪式在底部。两种仪式的主仪式石可垂直相邻放置（查看多方块预览）。",
    "",
    "在仪式下发建立被动生物刷怪场。动物种类越多，晶体产量越多。",
    "",
    "在仪式同区块上方放置5种意志晶簇。",
    "",
    "在晶簇附近放置5个恶魔坩埚，分别输入5种不同的意志晶体。",
    "",
    "意志晶簇将开始生长，掉落意志晶体。使用物品收集器收集晶体，并输送到坩埚内。",
    "",
    "该设计会产出多余的意志晶体，因为产生的速度比消耗速度快！"
]);

mods.jei.JEI.addDescription([<contenttweaker:ritual_mass_enchanting>],
[
    "可通过该方法突破原版附魔限制，魔咒等级最多可达15级。还可以使正常情况下不兼容的魔咒共存，例如火焰保护和爆炸保护。",
    "",
    "仪式需要基础的深渊国度仪式祭坛，可在任意维度使用深渊荒原死灵之书进行！消耗50000PE。",
    "",
    "在仪式基座上放置8本任意种类的附魔书（必须是8本）。在祭坛上放置可附魔物品（物品本身必须无附魔）。",
    "",
    "相同种类魔咒的等级在这一过程中会叠加，最大上限为15级。"
]);

mods.jei.JEI.addDescription([<thaumcraft:infusion_matrix>],
[
    "神秘时代的注魔是一种通过奥术基座进行的合成机制（查看多方块预览来了解如何搭建）。使用世界盐对符文矩阵右击来使结构成型。",
    "",
    "注魔配方需要在基座上放置正确的物品，使用附近的源质罐子（或注魔供应器）提供源质。",
    "",
    "要开始注魔，在放置好正确的物品之后，使用法师护手对矩阵右击。注魔将自动从附近的源质来源抽取源质以进行。",
    "",
    "所有注魔配方都有一定概率失败并造成负面效果。若符文矩阵处于稳定状态（佩戴揭示之护目镜可查看注魔稳定度），则不会出现上述后果。",
    "",
    "可通过在符文矩阵周围放置特定方块来增加注魔稳定性。",
    "",
    "所有稳定物都应相对于中心祭坛中心对称！",
    "",
    "稳定物种类越多，效果越好！颜色不同会被视为不同方块！",
    "",
    "此外，神秘时代的稳定器还可用来防止某些负面效果。使用红石镶嵌将稳定器与每个基座相连接。也应遵守中心对称规则。",
    "",
    "使用以下列出的稳定物来增加稳定性（每种最多可使用6个）：",
    "烛台,",
    "蜡烛,",
    "怪物头颅"
]);

mods.jei.JEI.addDescription([<minecraft:skull:0>,
    <minecraft:skull:1>,
    <minecraft:skull:2>,
    <minecraft:skull:5>,
    <bewitchment:white_candle>,
    <bewitchment:orange_candle>,
    <bewitchment:magenta_candle>,
    <bewitchment:light_blue_candle>,
    <bewitchment:yellow_candle>,
    <bewitchment:lime_candle>,
    <bewitchment:pink_candle>,
    <bewitchment:gray_candle>,
    <bewitchment:light_gray_candle>,
    <bewitchment:cyan_candle>,
    <bewitchment:purple_candle>,
    <bewitchment:blue_candle>,
    <bewitchment:brown_candle>,
    <bewitchment:green_candle>,
    <bewitchment:red_candle>,
    <bewitchment:black_candle>,
    <thaumcraft:candle_white>,
    <thaumcraft:candle_orange>,
    <thaumcraft:candle_magenta>,
    <thaumcraft:candle_lightblue>,
    <thaumcraft:candle_yellow>,
    <thaumcraft:candle_lime>,
    <thaumcraft:candle_pink>,
    <thaumcraft:candle_gray>,
    <thaumcraft:candle_silver>,
    <thaumcraft:candle_cyan>,
    <thaumcraft:candle_purple>,
    <thaumcraft:candle_blue>,
    <thaumcraft:candle_brown>,
    <thaumcraft:candle_green>,
    <thaumcraft:candle_red>,
    <thaumcraft:candle_black>,
    <bewitchment:candelabra_gold>,
    <bewitchment:candelabra_iron>,
    <bewitchment:candelabra_silver>],
[
    "可通过在符文矩阵周围放置特定方块来增加注魔稳定性。",
    "",
    "所有稳定物都应相对于中心祭坛中心对称！",
    "",
    "稳定物种类越多，效果越好！颜色不同会被视为不同方块！",
    "",
    "此外，神秘时代的稳定器还可用来防止某些负面效果。使用红石镶嵌将稳定器与每个基座相连接。也应遵守中心对称规则。",
    "",
    "使用以下列出的稳定物来增加稳定性（每种最多可使用6个）：",
    "烛台,",
    "蜡烛,",
    "怪物头颅"
]);

mods.jei.JEI.addDescription([<thaumcraft:stabilizer>,
    <thaumcraft:inlay>],
[
    "稳定器可在注魔不稳定时防止某些负面效果。",
    "",
    "使用红石镶嵌将稳定器与每个基座相连接。红石镶嵌与红石类似，最大范围为15格。",
    "",
    "应遵守中心对称规则。"
]);

mods.jei.JEI.addDescription([<forestry:bee_drone_ge>,<forestry:bee_princess_ge>,<forestry:bee_queen_ge>],
[
    "此处只阐述基础知识，查看任务书的创造之书章节来获得更多详细信息！",
    "",
    "要获得蜜蜂的产出物（例如蜂窝），最好将其放入工业蜂箱。使用同品种的公主蜂和雄蜂来产出蜂后。蜂后会渐渐死亡，在此过程中生成产物，最终产出新的公主蜂和更多雄蜂。",
    "",
    "要获得新品种的蜜蜂（除了疯狂科学家蜜蜂），最好使用高级诱变机。它会消耗所需的公主蜂和雄蜂（具体查看JEI）来制作新品种的蜂后。"
]);


mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_sacredmushroom>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "主世界中的某种结构中有神圣橡木。看看那儿的战利品！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将夜光菇培养罐与以下微光蘑菇结合：黑色、青色、蓝色、绿色！"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_radiationsuit>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "未知维度中隐藏着各种盾牌。可能得破坏些方块才能找到。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将惰性诅咒宝石与以下盾牌结合：现石盾、骑士盾、源质钢盾牌、琥珀金盾牌。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "rannuncarpus"}),
[
    "在范围内自动放置方块。提供魔力可增加工作范围。要指定方块放置位置，在花所种植的方块下方放置一个过滤用方块，如此便只会在该种方块上放置提供的方块。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "tangleberrie"}),
[
    "消耗魔力，使工作范围内的生物无法离开。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "fallenKanade"}),
[
    "消耗魔力在工作范围内给予生命恢复效果。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "necrofleur"}),
[
    "伤害并阻止生命值低于一半的生物回复生命。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "stardustlotus"}),
[
    "消耗魔力传送动物。使用存有坐标的坐标读取器右击来设置实体将被传送到的地点。在花上丢一张纸将其激活。操作正确时会出现粒子效果。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "orechidIgnem"}),
[
    "这朵花在后续进度中才能合成。可生产的矿物列表已经过修改。这朵花能通过消耗魔力，将附近的地狱岩转化为矿物。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "hopperhock"}),
[
    "捡拾附近物品并存入相邻容器。可在容器上放置物品展示框来设置白名单。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "marimorphosis"}),
[
    "消耗魔力，将附近的石头转化为变质岩（种类随机）。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "daffomill"}),
[
    "消耗少许魔力，将物品向设定的水平方向推动。使用工作模式下的森林法杖潜行右击来更改方向。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "jiyuulia"}),
[
    "消耗魔力推开生物。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "tigerseye"}),
[
    "阻止爬行者爆炸，并使爬行者远离玩家。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "exoflame"}),
[
    "消耗魔力驱动附近熔炉。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "annoyingflower"}),
[
    "从附近的活石祭坛中产生钓鱼战利品。提供香香鸡可大幅提高工作效率，并有更高概率钓到稀有物品。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "solegnolia"}),
[
    "在工作范围内阻止磁化指环生效。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "hyacidus"}),
[
    "使附近生物中毒。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "bellethorn"}),
[
    "消耗魔力伤害附近生物。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "spectranthemum"}),
[
    "使用绑定模式下的森林法杖与特定方块绑定。掉落在这朵花工作范围内的物品将会被传送到绑定地点。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "agricarnation"}),
[
    "消耗魔力增加植物生长速度。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "bubbell"}),
[
    "消耗魔力清除12格范围内的水。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "clayconia"}),
[
    "消耗魔力将附近的沙子变为粘土块。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "dreadthorn"}),
[
    "消耗魔力伤害成年动物。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "heiseiDream"}),
[
    "消耗魔力使怪物互相敌对。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "jadedAmaranthus"}),
[
    "消耗魔力在附近生成神秘花。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "mirrowtunia"}),
[
    "使附近玩家免疫某些负面效果。不能免疫扭曲。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "pollidisiac"}),
[
    "消耗魔力繁育动物。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "medumone"}),
[
    "消耗魔力抑制附近生物移动。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "manalinkium"}),
[
    "无线传输魔力。使用存有坐标的坐标读取器绑定到目标魔力池。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "loonium"}),
[
    "消耗魔力生成拥有额外掉落物池的怪物。任何原版地牢箱子中的物品都可通过这朵花获得。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "bergamute"}),
[
    "消除动物的噪声。"
]);

mods.jei.JEI.addDescription([<botania:specialflower>.withTag({type: "enchantedorchid"}), <botania:enchantedsoil>],
[
    "消耗丢出的黑莲花和大量魔力，将草方块转化为蕴魔土。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "orechid"}),
[
    "这朵花在后续进度中才能合成。可生产的矿物列表已经过修改。这朵花能通过消耗魔力，将附近的石头转化为矿物。"
]);

mods.jei.JEI.addDescription(<botania:specialflower>.withTag({type: "vinculotus"}),
[
    "阻止末影人传送。"
]);

mods.jei.JEI.addDescription(<contenttweaker:making_unattuned_celestial_crystals>,
[
    "需要星能液、星尘以及水晶石来制作第一块天辉水晶石。",
    "",
    "露天放置一桶星能液，最近最好有聚能水晶。",
    "",
    "将星尘和水晶石丢入星能液中，等待一段时间即可产生天辉水晶簇。",
    "",
    "完全生长后，水晶簇会掉落天辉水晶石。使用链接工具将水晶簇与聚能水晶绑定来加速生长！"
]);

mods.jei.JEI.addDescription(<contenttweaker:farming_unattuned_celestial_crystals>,
[
    "天辉水晶石可使用星能液进行复制。",
    "",
    "若一块天辉水晶石达到最大尺寸（900），丢入星能液后就有概率分裂为两个不同的天辉水晶石。此过程会消耗星能液。",
    "",
    "可使用以下两种方法实现上述过程的自动化：",
    "",
    "1. [有点卡，但是更简单]使用方块放置器使共鸣天辉水晶石始终浸泡在星能液中。使用配置好过滤的虚空箱子收集分裂出的未共鸣的天辉水晶石，将共鸣天辉水晶石留在原地来无限复制未共鸣的天辉水晶石。",
    "",
    "2. 使用方块放置器使单格空间内始终存在星能液，使用循环模组的实体检测器，使其在上述空间内检测到两个实体（也就是两个水晶石）时，向收集器发出红石信号。该系统可被设置为只拾取一个水晶石，或两个都拾取然后将其中之一丢入星能液中。"
]);

mods.jei.JEI.addDescription([<contenttweaker:levelling_up_crystals>,
    <astralsorcery:blockmachine:1>,
    <forge:bucketfilled>.withTag({FluidName: "astralsorcery.liquidstarlight", Amount: 1000})],
[
    "星辉魔法的水晶石有三个决定其品质的属性。数值越高，性能越好。",
    "",
    "满属性的共鸣天辉水晶石存在自定义配方，但是你可能需要手动升级一些以用于其他目的。",
    "",
    "尺寸可使用星能液增加。浸泡在星能液中的水晶石能消耗星能液增加尺寸。",
    "",
    "纯度可通过水晶石分裂增加。满尺寸的水晶石浸泡在星能液有概率会分裂为两块，其中一块会有更高的纯度。",
    "",
    "抛光可使用砂轮增加。每使用一次砂轮，水晶石的抛光都会增加，但尺寸会减少（可通过浸泡星能液再次增加）。"
]);

mods.jei.JEI.addDescription([<contenttweaker:dimension_ids>],
[
    "泰拉（主世界）【Overworld】：0",
    "虚空世界【Void World】：43",
    "压缩空间【Compact Machines】：144",
    "Woot维度【Tartarus】：418",
    "下界【Nether】：-1",
    "末地【End】：1",
    "熔炉世界（泰洛斯）【Telos】：623",
    "暮色森林【Twilight Forest】：7",
    "天境【Aether】：4",
    "混沌之地【Erebus】：66",
    "交错次元【Betweenlands】：20",
    "冰晶雪原【Iceika】：425",
    "秘界【Arcana】：426",
    "深渊荒原【Abyssal wasteland】：50",
    "恐惧之地【Dreadlands】：51",
    "奥穆索【Omothol】：52",
    "黑暗领域【Dark realm】：53",
    "维度门【Dimensional Doors】：684（以及其后的连续数字）",
    "虚域【Emptiness】：14676",
    "漆黑世界【Deep Dark】：-11325",
    "基岩维度【Bedrock Dimension】：19",
    "地平界【Taerrapiatta】：180",
    "地方界【Diamerisma】：181",
    "地盘界【Furatto】：182",
    "谐律界【Vibe】：183",
    "共鸣界【Apichisi】：184",
    "末结地【Finem】：185",
    "[高级火箭]月球【Luna】：145",
    "空间站【Space Station】：-2",
    "奥西里斯【Osiris】：148",
    "普塔【Ptah】：149",
    "哈托尔【Hator】：150",
    "欧罗巴【Europa】：151",
    "奥伊【Oi】：152",
    "法拉瑟【Falacer】：160",
    "奥迦斯【Orcus】：161",
    "哈乌美亚【Haumea】：146",
    "塞德娜【Sedna】：147",
    "伊甸【Eden】：420",
    "传说【Precasia】：818",
    "爵士【Barathos】：802",
    "赫尔维蒂【Lelyetia】：815",
    "蠕变【Creeponia】：805",
    "深层【Deeplands】：807",
    "深渊【Abyss】：800",
    "铼界【Rhenia】：163",
    "恐蚁界【Myrmex】：164",
    "原始森林【Wildwood】：421",
    "糖果【Candyland】：803",
    "花园【Gardencia】：809",
    "玩具【Celeve】：804",
    "晶体【Crystevia】：806",
    "天堂【Haven】：811",
    "黄金【Iromine】：813",
    "秘境【Mysterium】：817",
    "未知【Vox Ponds】：821",
    "光精界【Pixonia】：165",
    "封闭空间【Spatial Storage】：-26",
    "附魔山脉【Apalachia】：422",
    "树龙界【Lyndenwyrm】：162",
    "暴风【L'Borean】：814",
    "符境【Runandor】：819",
    "[虚无]月球维度【Lunalus】：816",
    "比邻星带【Proxima Belt】：166",
    "空境【Skythern】：423",
    "远古神殿【Ancient Cavern】：801",
    "不朽之地【Immortallis】：812",
    "格瑞克【Greckon】：810",
    "异位【Dustopia】：808",
    "梦魇世界【Vethea】：427",
    "孤寂界【Zoi】：171",
    "茕踽界【Nero】：170",
    "晦暗界【Akathartos】：172",
    "惧惮界【Pauram】：173",
    "死域【Mortum】：424",
    "塞尔瑞【Shyrelands】：820",
    "炼金界【Alkemia】：174",
    "地球（失落的城市）【Lost Cities】：111",
    "伽里弗雷【Gallifrey】：624",
    "RFTools维度：900（以及其后的连续数字）",
    "卡尚【Kashan】：190"
]);



mods.jei.JEI.addDescription([<appliedenergistics2:part:460>, <betterp2p:advanced_memory_card>, <appliedenergistics2:certus_quartz_cutting_knife>],
[
    "P2P通道可用于创建物品、红石信号、流体、光照、能量以及AE2频道的连接关系。",
    "",
    "使用以下物品右击通道来改变模式：",
    "桶：流体模式，",
    "箱子：物品模式，",
    "智能线缆：频道模式，",
    "能源元件：能量模式，",
    "红石：红石模式。",
    "",
    "两个或更多的P2P通道可使用高级内存卡连接。P2P通道可使用石英切割刀进行重命名，以便追踪定位！",
    "",
    "通道可使用更少的线缆来传输更多的频道，使基地布线更易于管理。最佳方法是使用一个小型的AE2网络，我们称之为子网，这个网络仅用于创建主控制器与基地其他部分的P2P连接。如此一来，单根致密线缆最多可传输1024个频道。",
    "",
    "多方块预览中显示了P2P通道是如何传输频道的。主网络为白色，子网为紫色。",
    "中间的控制器为主控制器，P2P通道可直接放置在其上，或通过致密线缆连接。此端通道为输入端。",
    "输出端可放置在输入端通道所在子网的任意部分（紫色的网络）。",
    "子网可通过额外的控制器，或者与主网络用石英纤维连接来供能。",
    "注意：除石英纤维外，不要用任何其他线缆将主网络与子网连接。"
]);

mods.jei.JEI.addDescription([<contenttweaker:yellorite_reactor>, <bigreactors:reactorcontroller>, <bigreactors:reactoraccessport>, <bigreactors:reactorcoolantport>, <bigreactors:reactorpowertaprf>],
[
    "要搭建黄铀反应堆，需要若干反应堆外壳（或反应堆玻璃）、一个反应堆控制器、两个反应堆访问端口、一个反应堆RF能源接口和若干反应堆燃料棒、控制杆、冷却剂。",
    "",
    "有多种多方块预览以展示各部件如何工作！反应堆几乎可以是任何尺寸，拥有任意数量的燃料棒和控制杆。空手右击控制器来查看结构是否有效。",
    "",
    "在JEI中搜索'反应堆冷却剂'来查看可使用的冷却剂列表。龙块是最好的冷却剂！",
    "",
    "要运行反应堆，通过访问端口输入黄铀锭，黄铀会被消耗并转化为蓝晶。将另一访问端口设置为输出模式来自动输出蓝晶锭。",
    "",
    "若要搭建蒸汽反应堆，需要将能源接口替换为两个冷却端口，一个用来输入水，另一个输出蒸汽。"
]);

mods.jei.JEI.addDescription([<bigreactors:turbinecontroller>, <bigreactors:turbinefluidport>, <bigreactors:turbinepowertaprf>, <contenttweaker:extreme_turbine>],
[
    "要搭建极限涡轮机，需要若干涡轮机外壳（或涡轮机玻璃）、一个涡轮机控制器、两个涡轮机液体端口、一个涡轮机RF能源接口、一个涡轮机转子轴承和若干涡轮机转轴、叶片和线圈。",
    "",
    "有多种多方块预览以展示各部件如何工作！涡轮机几乎可以是任何尺寸。空手右击控制器来查看结构是否有效。",
    "",
    "在JEI中搜索'涡轮机线圈'来查看可使用的线圈方块。镠块是最好的线圈！",
    "",
    "要运行涡轮机，通过液体端口输入蒸汽，蒸汽会被消耗并转化为水。需要将另一液体端口设置为输出模式来自动输出水。",
    "",
    "蒸汽可通过黄铀反应堆、蒸汽能源炉和锅炉获得。"
]);

mods.jei.JEI.addDescription([<deepmoblearning:simulation_chamber>, <deepmoblearning:extraction_chamber>, <deepmoblearning:polymer_clay>, <deepmoblearning:deep_learner>],
[
    "要使用深度怪物学习（进化）来获取掉落物，需要模拟室、战利品制造器以及稳定的聚合粘土（有EMC值）供应，当然还有数据模型。",
    "",
    "模拟室需要配置为特定生物的数据模型才能工作。",
    "",
    "要配置模型，需要在深度学习器中放入所需生物的数据模型。然后，将深度学习器放入快捷栏，击杀特定数量的对应生物来激活模型。",
    "",
    "击杀的生物数量越多，模型等级越高。等级越高，工作效果越好。",
    "",
    "放入模型后，模拟室会产出原始物质，可在战利品制造器中消耗原始物质来获取特定掉落物。"
]);

mods.jei.JEI.addDescription([<deepmoblearningbm:digital_agonizer>,<deepmoblearningbm:altar_linker>],
[
    "数字化苦难之井是产出生命源质的高效手段。",
    "",
    "在血之祭坛旁放置数字化苦难之井，使用祭坛连接器将二者绑定。",
    "",
    "数字化苦难之井需要数据模型和稳定的物质供应来自动为祭坛产出LP！",
    "",
    "多个数字化苦难之井可绑定至同一祭坛！"
]);

mods.jei.JEI.addDescription([<extrautils2:terraformer:0>,<extrautils2:terraformer:1>,<extrautils2:biomemarker>,<extrautils2:terraformer:2>,<extrautils2:terraformer:3>,<extrautils2:terraformer:4>,<extrautils2:terraformer:5>,<extrautils2:terraformer:6>,<extrautils2:terraformer:7>,<extrautils2:terraformer:8>],
[
    "要使用更多实用设备模组来改变生物群系，需要地形转化仪、生物群系标记器、若干天线以及基于群系的其他方块。",
    "",
    "在地形转化仪中放入生物群系标记器后，GUI将告诉你需要何种方块。",
    "",
    "对于每种所需方块，在其上放置天线，在方块的GUI中点击箭头查看所需材料。",
    "",
    "若配置正确，地形转化仪会自动开始工作！确保范围设置正确！"
]);

mods.jei.JEI.addDescription([
    <astralsorcery:itemperkgem:0>,
    <astralsorcery:itemperkgem:1>,
    <astralsorcery:itemperkgem:2>,
    <contenttweaker:making_dynamism_gems>],
[
    "要制作能力宝石，需要将水晶石和荧石丢入星能液中。",
    "",
    "根据生长完成的时间，会生成不同宝石。",
    "白天 = 烈阳宝石",
    "夜晚 = 皎月宝石",
    "日出/日落 = 天空宝石"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:magic_mushroom_dark>],
[
    "惊怖纤毛菇可解锁所有神秘时代研究，但是会直接填满扭曲条！除非你实在是很喜欢神秘时代的研究，否则最好是制作该物品，因为本整合包中有很多添加了复杂研究的附属模组。",
    "",
    "除了遵循以下步骤，最好也通过其他模组获得永久移除扭曲的手段，不论是在恐惧之地发现的扭曲净化符咒，还是合成获得的奥穆索扭曲净化符咒。",
    "",
    "要制作该物品，你还得先自己进行一些研究。以下步骤是解锁该物品的最短路径。",
    "",
    "1. 基础学：最初的摸索 > 发现：炼金术 > 发现：注魔 > 发现：神秘学",
    "",
    "2. 炼金术：基础炼金术 > 源动之焰 > 金属炼成 > 源质冶炼 > 要素罐子和标签",
    "",
    "3. 奥术注魔：基础注魔 > 注魔 > （可选）注魔稳定性"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:flux_basics>],
[
    "咒波是神秘时代的核心机制之一。",
    "",
    "咒波与辐射类似，每个区块有特定的咒波值。若咒波过高，会发生不好的事情。",
    "",
    "使用魔导透镜可查看当前区块的咒波值（深紫色的条）。潜行以查看具体数值。",
    "",
    "在神秘时代中，以下事情发生时会产生咒波：",
    "1. 坩埚的源质溢出（使用石英碎片来防止）",
    "2. 源质冶炼厂处理物品（秘银及更高等级不会产生咒波）",
    "3. 注魔合成失败"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:remove_flux>],
[
    "有一些移除咒波的方法：",
    "",
    "1. 血魔法的邪术意志仪式（前期推荐）。放置仪式，其会减少3x3区块内的咒波量，并将其转化为恶魔意志。如果9个区块内的意志均为满，仪式会停止清除咒波。使用恶魔结晶坛来确保区块内意志不被充满！",
    "",
    "2. 咒波凝结器（不推荐）。要解锁该物品，需要推进一些神秘时代进度。咒波凝结器上应放置格栅。格栅有概率堵塞，若格栅堵塞，需要破坏并重新放置。该方块需消耗Herba源质才能工作，并且会产出Vitium源质。使用源质管道来输入输出这两种源质。",
    "",
    "3. 纯净之花（长期使用的最佳选择）。纯净之花放置后便可直接吸收所在区块的咒波，没有额外需求！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:eldritch_will_ritual>],
[
    "血魔法的邪术意志仪式是解决咒波的最简单方法之一。放置仪式，其会减少3x3区块内的咒波量，并将其转化为恶魔意志。如果9个区块内的意志均为满，仪式会停止清除咒波。使用恶魔结晶坛来确保区块内意志不被充满！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:aura_basics>],
[
    "灵气是神秘时代的主要机制之一。",
    "",
    "灵气是用于本模组某些物品和方块的魔法能量。",
    "",
    "每个区块都有不同的灵气值。区块内灵气耗尽后，会随时间缓慢恢复至世界种子决定的最大值。",
    "",
    "不论什么存档，魔法森林（Magical Forest）群系的灵气值都比其他群系要高得多。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:thaumcraft_research>,
    <thaumcraft:scribing_tools>,
    <thaumcraft:table_wood>],
[
    "要解锁魔导手册的章节，需要进行研究。",
    "",
    "一共有8种研究，每种都对应一种观测或理论！",
    "",
    "使用魔导透镜来进行观测研究。本整合包中的附属模组可以令你直接扫描箱子中的物品。用鼠标拖动魔导透镜直接从物品上滑过即可！",
    "",
    "理论研究需在研究台中进行，使用笔与墨右击木桌来获得研究台。要解锁研究，在研究同中放置纸，点击选项直至完成一个理论。重复此操作直至所需获得研究。",
    "",
    "除此之外，传世珍品可随机解锁研究！"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:thaumometer>],
[
    "魔导透镜主要有三种用途。",
    "",
    "显示所在区块的灵气场信息：灵气量，咒波量和灵气容量。",
    "",
    "扫描物品和方块（世界中和物品栏中均可）以揭示其含有的源质，并获得相关的神秘学知识。",
    "",
    "显示方块或机器中的源质含量。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:warp_basics>,
    <thaumcraft:sanity_checker>],
[
    "扭曲是神秘时代和深渊国度的一种机制。",
    "",
    "扭曲与玩家直接相关，其来源有很多：",
    "1. 食用僵尸之脑",
    "2. 解锁特定神秘时代研究",
    "3. 与深渊国度的怪物战斗",
    "4. 探索深渊国度的维度",
    "",
    "可使用神志检测仪来查看扭曲值！",
    "",
    "若扭曲值过高，玩家会偶尔获得负面效果，周围有时会生成特定怪物。",
    "",
    "扭曲分为三种类型：临时、粘性和永久。",
    "临时扭曲会随时间自然减少，在神志检测仪中显示为亮粉红色。",
    "粘性扭曲需要用祛邪肥皂或扭曲净化符咒移除，在神志检测仪中显示为紫色。",
    "永久扭曲只能使用恐惧之地和奥穆索扭曲净化符咒移除，在神志检测仪中显示为深紫色。"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:crucible>],
[
    "坩埚使用源质来进行合成。源质是神秘时代中的一种魔法流体，可使用多种方式获得。",
    "",
    "坩埚需要放置在火或者闪耀之光上来正常工作，坩埚内还需放满水。正常工作时，坩埚内的水会冒气泡。",
    "",
    "丢入坩埚的物品会被分解为所具备的源质。将鼠标放在被魔导透镜扫描后的物品上，按住Shift可显示其包含的源质。此外，每种物品具有的源质均可在JEI中查看。",
    "",
    "若佩戴有揭示之护目镜，可直接看到坩埚内的源质。",
    "",
    "若源质组合正确，丢入坩埚内的物品将会被转化。JEI中列出了可用的转化配方。",
    "",
    "坩埚中的源质会缓慢消失，并转化为咒波。向坩埚中丢入石英碎片来收集剩余的源质，避免咒波增长！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:essentia_management>],
[
    "源质是一种魔法流体，可作为许多神秘时代机制的一部分进行创造、移动以及消耗。尽管坩埚可以用于制作源质，但其制作的源质只能用于坩埚合成。",
    "",
    "要创造源质，需要源质冶炼厂，可以像熔炉那样把物品'烧炼'为其包含的源质（在JEI中查看）。",
    "在冶炼厂上方放置蒸馏器以收集输出的源质。若没有蒸馏器，则会产生咒波。",
    "冶炼厂的等级越高，物品产生的源质越多，每次操作产生的咒波越少。秘银及以上等级的冶炼厂不会产生咒波。",
    "",
    "可用安瓿或罐子来存储源质。安瓿类似桶，可用于在容器间移动源质。罐子类似储罐，可放置在世界中。标签可用于过滤罐子，使其只存储指定种类的源质。",
    "",
    "要传输源质，源质析出和注入装置可用于无线传输源质。当然也有源质管道，但最好别用。",
    "源质析出装置可作为机械的输出，自动将源质输出到罐子里。",
    "源质注入装置可作为机械的输入，自动从罐子里抽取源质。"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:phial>],
[
    "安瓿可用于存储源质，和桶差不多。",
    "",
    "一个安瓿可存储10单位源质。",
    "",
    "可使用安瓿右击源质机械或容器，像用桶一样收集或放入源质！"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:jar_normal>,
    <thaumcraft:jar_void>,
    <thaumadditions:jar_brass>,
    <thaumadditions:jar_thaumium>,
    <thaumadditions:jar_eldritch>,
    <thaumadditions:jar_mithrillium>,
    <thaumadditions:jar_adaminite>,
    <thaumadditions:jar_mithminite>,
    <thaumcraft:label>],
[
    "罐子可用于存储源质，和存储流体的储罐差不多。",
    "",
    "可使用安瓿来装填罐子，或直接使用罐子右击源质容器。",
    "",
    "使用标签右击罐子可以将罐子当前存储的源质设为白名单，阻止其他源质进入，即便罐子空了。可用于组建源质存储系统。",
    "",
    "罐子有多个等级，每级的容量不同：",
    "源质罐子：250",
    "虚空罐子：250，附带溢出销毁（产生咒波）",
    "黄铜源质罐子：275",
    "神秘源质罐子：350",
    "邪术源质罐子：500",
    "秘银源质罐子：1000",
    "精金源质罐子：2000（无法存储Vitium）",
    "秘金源质罐子：4000，附带溢出销毁（产生咒波）"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:essentia_input>,
    <thaumcraft:essentia_output>],
[
    "源质析出和注入装置是传输源质的最佳手段！",
    "",
    "将其放置在源质机械上，可以从附近的罐子里自动输入/输出源质。",
    "",
    "析出 = 从机械到罐子",
    "注入 = 从罐子到机械"
]);

mods.jei.JEI.addDescription([
    <botania:pool:0>,
    <botania:pool:1>,
    <botania:pool:2>,
    <botania:pool:3>],
[
    "魔力池可消耗魔力，转化丢入其内的物品。",
    "",
    "同时也是存储魔力的主要手段，可用火花和魔力发射器来传输魔力。"
]);

mods.jei.JEI.addDescription([
    <botania:spreader:0>,
    <botania:spreader:2>,
    <botania:spreader:1>,
    <botania:spreader:3>],
[
    "魔力发射器用于在魔力源或容器间传输魔力。",
    "",
    "森林法杖可将产能花与发射器绑定。确保森林法杖处于绑定模式。首先Shift右击花，然后右击发射器。",
    "",
    "森林法杖可将发射器与魔力池绑定。首先Shift右击发射器，然后右击魔力池。",
    "",
    "要从魔力池中抽取魔力，将魔力发射器直接与魔力池相邻放置。无需绑定。发射器向目标发射魔力脉冲时，将从相邻的魔力池中抽取魔力。"
]);

mods.jei.JEI.addDescription([
    <botania:spark>,
    <botania:sparkupgrade:0>,
    <botania:sparkupgrade:1>,
    <botania:sparkupgrade:2>,
    <botania:sparkupgrade:3>],
[
    "火花用于在魔力池和其他植物魔法物品间传输魔力。使用火花右击魔力池来放置。",
    "",
    "默认状态下，所有放有火花的方块将平等分享魔力，但可使用火花升级来改变优先级。",
    "",
    "聚集：从其他火花中抽取魔力直至魔力池满。",
    "弥散：向玩家传输魔力。",
    "扩散：向其他火花传输魔力。",
    "隔绝：不向其他普通火花传输魔力。"
]);

mods.jei.JEI.addDescription([
    <botania:runealtar>],
[
    "符文祭坛只能从魔力发射器中接收魔力。",
    "",
    "将配方所需材料丢到祭坛顶部。",
    "",
    "若配方正确，发射器将开始发射魔力脉冲，直至祭坛充满。",
    "",
    "一旦祭坛充满魔力，向祭坛上丢出一个活石，使用森林法杖右击祭坛来完成合成。",
    "",
    "在符文祭坛配方中，符文不会消耗。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:crucible_automation>,
    <thaumcraft:thaumatorium>],
[
    "坩埚可转化为神秘炼金塔，相当于升级版本的坩埚，拥有用户界面，可进行自动化。",
    "",
    "要构建神秘炼金塔，在成型的坩埚上方放置两个炼金构材，接着使用世界盐右击。",
    "",
    "神秘炼金塔可从放置在其侧面的源质注入装置处接收源质。可从附近的罐子或源质析出装置中收集源质。",
    "",
    "要选择配方，先放入所需物品，然后点击输出物以将神秘炼金塔与该配方绑定。输入所需物品，将自动抽取源质并将产物在坩埚前方（之前使用世界盐的方向）丢出。使用物品收集器来收集产物。",
    "",
    "默认状态下，神秘炼金塔只能记录一个配方，可通过在其侧面放置记忆矩阵来增加配方数量，最多可额外增加两个配方。"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:smelter_basic>,
    <thaumcraft:smelter_thaumium>,
    <thaumcraft:smelter_void>,
    <thaumadditions:mithrillium_smelter>,
    <thaumadditions:adaminite_smelter>,
    <thaumadditions:mithminite_smelter>],
[
    "冶炼厂可使用物品产出源质。可在JEI中查看物品所产出的源质，或将鼠标悬停在物品上方按住Shift查看。",
    "",
    "冶炼厂与熔炉类似，同样需要燃料，燃料可从底部输入。",
    "",
    "冶炼厂上方需要放置至少一个蒸馏器才能正常工作。如果没有蒸馏器，所有产出的源质都将变为咒波。",
    "",
    "包含源质的物品被烧炼后，会变为源质粘浆，显示在冶炼厂界面左侧的紫色条中。若存在蒸馏器，粘浆会在蒸馏器中被转化为源质。",
    "",
    "可使用安瓿从蒸馏器中收集源质，或放置源质析出装置来自动将源质输入到附近罐子中。",
    "",
    "冶炼厂每完成一次操作都会产生少量咒波，所以要小心！秘银及以上等级的冶炼厂不会产出咒波！"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:sanity_soap>],
[
    "要解锁该物品，需完成以下研究步骤。",
    "",
    "1. 基础学：最初的摸索 > 发现：炼金术",
    "",
    "2. 炼金术：基础炼金术 > 炼金杂项",
    "",
    "3. 获取扭曲，直到得到信息'肯定有什么办法可以遏制这些头疼事！（Surely there must be a way to stop these headaches?）'，探索深渊国度维度是获取扭曲的不错选择",
    "",
    "4. 炼金术：净化浴盐 > 祛邪肥皂"
]);

mods.jei.JEI.addDescription([
    <thaumicenergistics:infusion_provider>],
[
    "注魔供应器就像是AE源质存储网络的延伸，可直接与神秘时代的机械交互。",
    "",
    "如果放置在注魔祭坛附近，供应器会自动从网络中收集源质。",
    "",
    "同样也适用于源质注入装置。可利用该特点使例如神秘炼金塔得机械实现完全自动化。"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:void_siphon>,
    <thaumcraft:void_seed>,
    <thaumcraft:causality_collapser>],
[
    "虚空吸管可从咒波裂隙中获得虚空种子。也可使用悖论物质获得种子，但是不怎么可靠。",
    "",
    "要生成咒波裂隙，需要一个有高咒波值的区块。在远离基地的地方或者直接前往其他维度，向坩埚中丢入大量压缩圆石来达成要求。",
    "",
    "在裂隙附近放置虚空吸管，它会缓慢汲取虚空之力，在附近掉落虚空种子。使用物品收集器等方法收集种子。",
    "",
    "若想使用悖论物质，将其想雪球一样丢向裂隙，接触方块时产生爆炸。若爆炸范围内存在裂隙，裂隙将闭合并掉落随机数量的虚空种子。",
    "",
    "获取最初一批虚空种子之后，可使用虚空芽自动化安全获得虚空种子。"
]);

mods.jei.JEI.addDescription([
    <thaumicaugmentation:rift_seed>],
[
    "咒波种子可用来生成咒波裂隙。",
    "",
    "要使种子生长，在注魔祭坛的外环基座上放置任意数量的虚空种子对咒波种子进行注魔合成。"
]);

mods.jei.JEI.addDescription([
    <thaumicaugmentation:fracture_locator>,
    <thaumicaugmentation:augment_caster_rift_energy_storage>,
    <thaumicaugmentation:gauntlet:0>,
    <thaumicaugmentation:gauntlet:1>],
[
    "要进入虚域，需要使用裂缝定位器寻找裂缝。下界天花板是寻找裂缝的好地方。靠近裂缝时，定位器会发光。",
    "",
    "要打开裂缝，需要使用安装有元动能量电池的满充能神秘或虚空预言者法师护手。靠近咒波裂缝吸收其能量来为护手充能。",
    "",
    "护手充能完毕之后，右击裂缝将其打开！"
]);

mods.jei.JEI.addDescription([
    <thaumcraft:condenser>,
    <thaumcraft:condenser_lattice>],
[
    "咒波凝结器可快速移除咒波，但是不够稳定。",
    "",
    "咒波凝结器上应放置格栅。格栅有概率堵塞，若格栅堵塞，需要破坏并重新放置。",
    "",
    "该方块需消耗Herba源质才能工作，并且会产出Vitium源质。使用源质管道来输入输出这两种源质。"
]);

mods.jei.JEI.addDescription([
    <thaumicaugmentation:impetus_drainer>,
    <thaumicaugmentation:impetus_relay>,
    <thaumicaugmentation:impetus_linker>,
    <thaumicaugmentation:impetus_matrix>,
    <thaumicaugmentation:rift_seed>,
    <thaumicaugmentation:material:3>],
[
    "元动能量是一种基于咒波裂隙的能量系统。",
    "",
    "要生成元动能量。需要在咒波裂隙附近放置元动汲取仪。它会缓慢汲取裂隙能量。生成元动能量！",
    "",
    "要传输元动能量，需要使用元动谐振器和元动中继器。中继器类似传输能量的线缆，谐振器就像是个扳手。使用谐振器Shift右击起始方块，然后右击目标方块，从而在两个元动能量方块之间建立连接。连接成功后，两个方块之间会有连接的视觉效果。",
    "",
    "使用元动矩阵来存储元动能量，其行为和电池类似。将符文矩阵与两个邪术基座组合来构成元动矩阵（查看JEI的预览）。使用世界盐右击矩阵，然后对基座使用元动能量单元，基座每个侧面都可安装1个单元，造多安装8个。使用元动谐振器来连接元动矩阵与其他设备。"
]);

mods.jei.JEI.addDescription([
    <thaumicaugmentation:arcane_terraformer>],
[
    "奥术群系转换仪的功能十分强大，它可以改变单个方块的生物群系。在本整合包中作为解谜和仪式的一环。",
    "",
    "奥术群系转换仪需要用灵气、元动能量，以及源质形式的Ignis、Aer、Aqua、Terra以及Permutatio。阅读元动能量的JEI信息框，并查看奥术群系转换仪的多方块预览，来了解如何输入所有这些资源。Permuatatio可从底部输入，其他源质可从对应颜色的侧面输入。元动能量可通过元动汲取仪直接获得，但最好使用元动中继器来检查元动能量系统。并不需要元动矩阵，它可能会让事情变的过于复杂。",
    "",
    "设置后连接后，在奥术群系转换仪中放入群系核心，选择想要创建的群系半径和形状。本整合包中的某些解谜要求改变单个方块的群系，可使用半径为1的圆形形状（不要选择方形）实现。",
    "",
    "使用升级过的神秘或虚空预言者法师护手右击转换仪中心来开始转换。操作正确时会出现粒子效果。",
    "",
    "由于该模组的一个bug，粒子效果出现后可能什么都不会发生。在这种情况下，重新登陆通常可以解决问题，群系将正常更新。"
]);

mods.jei.JEI.addDescription([
    <botania:alfheimportal>],
[
    "使用活木建造一个5x5的传送门框架（不包括四角），其中底部中心为精灵门核心，其他三边中心为微光活木。",
    "",
    "在精灵门核心三格范围内，水平放置两个魔力池，其上放置自然水晶。这两个魔力池即为精灵门的魔力缓存。若魔力池中没有足够魔力，精灵门将关闭！",
    "",
    "使用森林法杖右击核心来激活精灵门。开启精灵门需要消耗巨量魔力。",
    "",
    "向精灵门丢出物品进行合成。会消耗少量魔力。",
    "",
    "小心，没有配方的物品将会被直接删除！"
]);

mods.jei.JEI.addDescription([
    <ore:bewitchmentAltar>],
[
    "在巫师之路模组中，需要使用女巫祭坛来产生魔力（ME）！",
    "",
    "祭坛结构是一个3x2的桌子，可以用任意种类祭坛方块组成。使用原版地毯右击来使祭坛成型！",
    "",
    "祭坛会被动产生魔力。空手右击祭坛会显示可用魔力及最大魔力。巫师之路的许多机制都需要魔力来运行！",
    "",
    "自然方块（作物、树、花）的种类关乎魔力上限。祭坛周围的植物种类越多，魔力上限越高！",
    "",
    "可以通过祭坛周围放置雕像，或在祭坛上摆放物品，来为ME上限和回复速度提供加成。在JEI中搜索'女巫祭坛'来显示相关物品。"
]);

mods.jei.JEI.addDescription([
    <bewitchment:witches_cauldron>],
[
    "放置在火、熔岩或岩浆块上方，靠近女巫祭坛。",
    "",
    "釜锅的所有配方都需要水。釜锅中的水若放置时间过长，会被蒸发！",
    "",
    "JEI中显示了配方和酿造所需的材料！",
    "",
    "待水烧滚之后，向釜锅中丢入物品来开始合成！若配方正确，产物将自动从中弹出！确保丢入原料的速度够快，否则配方不会完成。",
    "",
    "要酿造药剂，先丢入曼陀罗根，接着丢入药剂所需的物品组合（JEI中有显示）。使用玻璃瓶右击釜锅来收集药剂！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:full_essentia_automation>],
[
    "要完全自动化魔力水晶碎片，推荐使用魔力种子、有机灌注器、源质结晶器以及深度怪物学习。为每种种子准备一台有机灌注器，使用沼泽生物数据模型获得稳定的生铁树原料供应。",
    "取决于有机灌注器速度，可能会需要多个源质结晶器。对于基础速度的灌注器，7到8台结晶器可以处理所有豆荚。",
    "",
    "使用秘银或更高等级的冶炼厂来从魔力水晶碎片中被动产出源质。该等级的冶炼厂不会产出咒波。",
    "推荐使用红石控制以上产线，以避免源质溢出。通过对罐子使用比较器，来实现对自动化系统源质储量的监控，如此可将冶炼厂设置为仅当源质低于特定阈值时运行。",
    "",
    "机械源质冶炼厂也可通过魔力水晶碎片生成源质。该多方块不需要红石控制，因为在源质输出仓满时会自动停止。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:draconic_energy_ball>,
    <draconicevolution:energy_storage_core>,
    <draconicevolution:energy_pylon>,
    <draconicevolution:particle_generator:2>],
[
    "神龙能量核心的占地和能量储量都十分巨大。你真应该做一个！",
    "",
    "首先，放置能量核心。右击核心选择尺寸，然后打开建筑指导。除了最高等级，其他等级均使用红石块和龙块。最高等级会使用觉醒龙块。遵循建筑指导手动建造，或选择组装核心进行自动建造。",
    "",
    "上述结构建造好后，在四周放置能量核心稳定器，距中心16格范围内。1到4级需要4个稳定器，每个侧面一个。更高等级需要36个稳定器，每个侧面9个，按3x3放置。若放置正确，稳定器纹理会发生改变。",
    "",
    "最后，在核心16格范围内放置能量塔，能量塔的上（下）方需放置一块玻璃，若比核心高/低则玻璃需要放在能量塔下/上方，从而实现能量交互。若放置正确，玻璃将变为一个球体。空手右击球体来切换能量塔的输入输出模式。"
]);

mods.jei.JEI.addDescription([
    <nuclearcraft:fission_controller_new_fixed>,
    <nuclearcraft:fission_block>,
    <nuclearcraft:fission_port>,
    <contenttweaker:nuclearcraft_fission_interior>],
[
    "裂变反应堆多方块结构可将燃料处理为新资源，同时还可产出能量。",
    "",
    "反应堆外层由若干裂变反应堆外壳、一个裂变控制器，以及至少一个裂变堆端口（替换侧面任意裂变反应堆外壳）构成。多方块预览展示的是一个5x5x5裂变堆的外层设计示例。",
    "",
    "根据使用的燃料，需设计不同的内部结构。反应堆内部由用于处理燃料的反应堆单元、用于降低热量的不同种类冷却器，以及产生更多热量同时提升燃料效率的减速剂构成。每种方块仅可在特定条件下工作，显示于物品信息框中。若热量过高，反应堆将融解，产生大量辐射并生成堆芯熔融物。",
    "",
    "每种燃料都有可自动建造的多方块结构。查看能量来源章节中每种裂变燃料的配方！",
    "",
    "所有设计都是5x5x5的，应该能满足裂变需求。所有可用设计均使用了leu-235.com中的计算器。如果想自己设计不同尺寸的反应堆，请使用该网站。",
    "",
    "对于某些燃料，提供了主动式和被动式冷却两种建造方案。主动式冷却更快，效率更高，但是需要消耗极寒之凛冰。"
]);

mods.jei.JEI.addDescription([
    <nuclearcraft:buffer>,
    <nuclearcraft:active_cooler>,
    <contenttweaker:active_cryotheum_cooler>],
[
    "液冷器是裂变反应堆相关冷却器的更好版本，但是要消耗流体才能运行。",
    "",
    "用缓存器替换反应堆外壳来向反应堆内部输入流体。所有直接或间接接触缓存器的液冷器都会接收到输入的流体。在多方块预览中查看其工作示例。",
    "",
    "液冷器可接收任何用于制作被动（也就是普通）冷却器的流体，工作条件也相同。",
    "",
    "所有可自动建造的设计均使用极寒之凛冰。",
    "",
    "液冷器也可用于聚变反应堆，查看电磁体的多方块预览与信息框以获得更多信息。"
]);

mods.jei.JEI.addDescription([
    <nuclearcraft:fusion_electromagnet_idle>,
    <nuclearcraft:fusion_electromagnet_transparent_idle>],
[
    "电磁体需要冷却和能量以安全运行，避免融解。",
    "",
    "使用高能量传输速率的线缆与电磁体连接来提供能量。若正确供能，所连接的电磁体将从红色变为绿色。",
    "提供多个能量连接以确保安全！每7个方块可以搭配1个能量输入。",
    "",
    "使用装填水（推荐使用无限水）的液冷器来提供冷却。",
    "在反应堆开始产出能量时，必须进行冷却（加热时也可选择进行）。确保冷却效率在100%，不能多也不能少！"

]);

mods.jei.JEI.addDescription([
    <genetics:lab_machine:4>],
[
    "适应性调整器可以增加蜜蜂的温度和湿度耐性。",
    "",
    "使用以下物品组合来获得对应效果：",
    "烈焰棒或熔岩 = 更高温度",
    "冰或雪球 = 更低温度",
    "水 = 更高湿度",
    "沙子 = 更低湿度"

]);

mods.jei.JEI.addDescription([
    <bewitchment:ritual_chalk>,
    <bewitchment:focal_chalk>,
    <bewitchment:fiery_chalk>,
    <bewitchment:phasing_chalk>],
[
    "粉笔用于绘制仪式，来造成特殊效果、召唤生物或获得物品。",
    "",
    "仪式需要附近有激活的祭坛以运行。",
    "",
    "使用粉笔对地面右击来绘制符文。",
    "",
    "若仪式需要物品，使用所需物品对中心符文右击！",
    "",
    "总共有三种等级的仪式，对应三种颜色的粉笔！",
    "",
    "所有仪式的核心符文均为黄色！右击中心符文来启动仪式！"

]);

mods.jei.JEI.addDescription([
    <bewitchment:boline>],
[
    "检查伯莱恩新月小刀的用途，以查看沧海桑田仪式的仪式圈布局。",
    "",
    "该仪式圈需要设置于特定群系的伯莱恩新月小刀。使用小刀右击与所在群系绑定。风暴之地（Stormland）群系有特殊的配方，之后某个阶段会用得到。"

]);

mods.jei.JEI.addDescription([
    <astralsorcery:blockattunementaltar>],
[
    "该祭坛是多方块结构的一部分。",
    "",
    "使用六分仪右击查看多方块预览！",
    "",
    "副手手持星图看向建造完成的共鸣祭坛结构，特定的方块上会有粒子效果。",
    "",
    "在粒子效果指示的方块上放置星辉转继器来构成星座形状。若转继器放置正确且对应的星座在天空中，会出现新的视觉效果。",
    "",
    "共鸣祭坛可使玩家（站在中心）或水晶石（放入祭坛）与星座共鸣。",
    "",
    "将共鸣水晶石放入仪式祭坛会产生不同效果。"

]);

mods.jei.JEI.addDescription([
    <astralsorcery:blockcelestialcollectorcrystal>],
[
    "聚能水晶有多种用途。",
    "",
    "可与祭坛链接以增加星能水平。",
    "",
    "可与祭坛链接，以增加与共鸣星座相同的仪式效果。",
    "",
    "通过在聚能水晶周围建造多方块结构（查看预览），增幅效果还可进一步提升。"

]);

mods.jei.JEI.addDescription([
    <contenttweaker:buffing_astral_ritual>],
[
    "仪式可被增强，以增加范围和效果！",
    "",
    "要增强仪式，在附近放置共鸣星座与仪式星座相同的聚能水晶，使用链接工具将其与祭坛链接。",
    "",
    "水晶属性越强，增强效果越强。",
    "",
    "在聚能水晶周围建造多方块结构后，其效果会最大化。使用六分仪右击聚能水晶以查看多方块预览。",
    "",
    "要进一步增强仪式效果，可在仪式周围放置透镜。",
    "",
    "祭坛中发出的光束会指示在何处放置透镜。使用链接工具棱镜与水晶链接。接着祭坛会再次发出光束指示在何处放置下一个透镜。",
    "",
    "透镜属性越强，增强效果越强。",
    "",
    "完全增强（满属性水晶和最大数量的满属性透镜）的仪式会产生特殊粒子效果。"

]);

mods.jei.JEI.addDescription([
    <xnet:controller>],
[
    "每个Xnet网络都需要一个控制器，与想要进行交互的容器相连的若干连接器，以及连通连接器的网络线缆。",
    "",
    "控制器需要能量，可使用外部能量源供应（个人最喜欢通量接出点）。不要用控制器给控制器供能，会造成卡顿。",
    "",
    "对导管和管道而言，每个连接均为独立处理。对Xnet而言，每个连接至容器的连接都在控制器界面中处理。",
    "",
    "所有与连接器连接，并且具备有效网络线缆连接的容器，都会在控制器中显示。双击界面中的容器以在世界中显示其位置。",
    "",
    "单个Xnet网络最多可有8种功能，或者说8个频道，对应控制器界面中的8列。",
    "",
    "每个频道都可配置为以下模式：",
    "",
    "能量传输（xnet.energy）：分别将每个容器设为能量输入或输出端，可用于为需要物品自动化的单方块机器供能。",
    "",
    "物品传输（xnet.item）：分别将每个容器设置为物品输入或输出端，可配置过滤选项；可指定互动的具体方向（仅限高级连接器），对像熔炉这样的机器十分有用。",
    "",
    "逻辑（红石）（xnet.logic）：可添加传感器（Sensor，箱子中A物品超过X数量时发出红石信号）；此外，物品和能量频道都可接收逻辑信号来控制功能开关（接收到红石信号时移动B物品）；逻辑（红石）频道可配置颜色来独立工作。",
    "",
    "流体传输（xnet.fluid）：有bug，不要使用",
    "",
    "RFTools（rftools.storage）：: 与RFTools的存储接口类方块（例如存储检测器）组合来制作青春版AE2网络。",
    "",
    "电脑外设（plethora.cc）：可与电脑交互。"

]);

mods.jei.JEI.addDescription([
    <xnet:netcable:0>,
    <xnet:netcable:1>,
    <xnet:netcable:2>,
    <xnet:netcable:3>],
[
    "每个Xnet网络都需要一个控制器，与想要进行交互的容器相连的若干连接器，以及连通连接器的网络线缆。",
    "",
    "线缆可以染色，以避免相邻网络互相连接。"

]);

mods.jei.JEI.addDescription([
    <xnet:connector:0>,
    <xnet:connector:1>,
    <xnet:connector:2>,
    <xnet:connector:3>],
[
    "每个Xnet网络都需要一个控制器，与想要进行交互的容器相连的若干连接器，以及连通连接器的网络线缆。",
    "",
    "与线缆类似，连接器也可染色，以避免相邻网络互相连接。",
    "",
    "连接器应放置在容器与机器旁，可与连接方块的每个面互动（仅限高级连接器）。例如，放置在底部的连接器可以从顶部提取物品（如果机器有侧面IO差异）。可在控制器GUI中指定互动面。"

]);

mods.jei.JEI.addDescription([
    <xnet:redstone_proxy>,
    <xnet:redstone_proxy_upd>],
[
    "红石代理器可将Xnet的逻辑信号转化为可与外部互动的红石信号。",
    "",
    "代理器有两种版本，一种会造成方块更新（就像右击红石矿石那样），另一种则不会。"

]);

mods.jei.JEI.addDescription([
    <xnet:router>],
[
    "路由器可在不同的Xnet网络中共享功能。",
    "",
    "使用同一路由器连接多个不同Xnet网络时，可在其间合并指定频道。",
    "",
    "路由器GUI左侧会列出所有相连接的Xnet网络的频道。两个在路由器中拥有相同标签名的频道，会作为同一频道工作，在不同控制器中分配。"

]);

mods.jei.JEI.addDescription([
    <xnet:netcable:4>,
    <xnet:connector:4>],
[
    "路由网络线缆和路由连接器用于路由器的彼此连接，以使用更多频道进行交互。",
    "",
    "使用路由网络线缆和路由连接器连接的路由器工作方式不变，同样共享GUI右侧的频道。",
    "",
    "本地（左侧）和远程（右侧）频道只要具有相同的标签名，就可以互相连接并相互交互。"

]);

mods.jei.JEI.addDescription([
    <xnet:wireless_router>,
    <xnet:antenna_base>,
    <xnet:antenna_dish>,
    <xnet:antenna>],
[
    "无线路由器和天线可代替路由线缆，无线连接多个路由器。",
    "",
    "与普通路由器类似，但是需要能量。",
    "",
    "天线基座需放置在无线路由器上方。",
    "",
    "天线需放置在天线基座上，以提供短距离无线路由连接。",
    "",
    "天线盘可代替天线，提供的范围更大。"

]);

mods.jei.JEI.addDescription([
    <nuclearcraft:salt_fission_controller>,
    <nuclearcraft:salt_fission_heater>,
    <nuclearcraft:salt_fission_vessel>],
[
    "熔盐反应堆可处理裂变燃料，加热钠钾流体，加热后的钠钾流体可在热交换器和涡轮机中产出能量。",
    "",
    "在多方块预览中查看熔盐反应堆的外层结构。",
    "",
    "熔盐反应堆需要冷却（通过加热钠钾流体）和燃料进行工作，所有这些遵循与裂变反应堆相似的临近规则。",
    "",
    "在熔盐反应堆内部，流体通过熔盐冷却剂加热器（用于钠钾流体）和熔盐裂变容器（用于燃料）进行传输。与流体管道类似，但有一些额外规则。",
    "",
    "较简单的设计直接将燃料从一端输送到另一端，但若能妥善处理流体，冷却剂加热器和裂变容器可以放置在冷却剂规则允许的任何地方。",
    "",
    "冷却剂加热器的放置规则取决于其中流经的流体，与对应的被动冷却器规则相同。例如，装填共晶钠钾-红石混合物的冷却剂加热器的放置规则，与红石冷却器相同。",
    "",
    "空手右击容器和冷却剂加热器的各个面来更改输入/输出模式。Shift右击可更改反面的模式。",
    "",
    "放置新容器（或冷却剂加热器）时对现有容器按住Shift，可复制其侧面配置（不幸的是，可能会出bug）。",
    "",
    "建造熔盐反应器最简单的方法：先配置单层内部结构（从中间方块开始），然后按住Shift依次放置剩余层，最后再建造外部框架。",
    "",
    "要连接两个容器（或冷却剂加热器），应将输出端设置为'燃料分配'（或'冷却液分配'），燃料（冷却剂）输入端设置为'默认'。",
    "",
    "使用不同流体的容器或冷却剂加热器管线接触时，接触面应设置为'禁用'。",
    "",
    "要从熔盐反应堆外部供应流体，容器需连接至熔盐反应堆出入口，输入端和输出端均需连接。",
    "",
    "要将容器（或冷却剂加热器）连接至输出端的出入口，与出入口接触的面应设置为'枯竭输出'（或'热冷却液输出'）。",
    "",
    "对于流程中需要的所有燃料副产物，多方块预览中都提供了相应的反应堆内部设计。以可堆叠为任意高度的横截面形式显示。",
    "",
    "如果内部缺少钠钾冷却剂，或加热流体无法从内部输出，反应堆将融解，产生巨量辐射。确保冷却剂供应充足，并有快速循环的方法。",
    "",
    "使用热交换器来完全循环钠钾流体，以实现闭环设计。"

]);

mods.jei.JEI.addDescription([
    <contenttweaker:peaceful_soul>],
[
    "增加友好生物的刷新率。",
    "",
    "在意志结晶自动化中很有用！"

]);

mods.jei.JEI.addDescription([
    <contenttweaker:gathering_forsaken_souls>],
[
    "通过伤害附近生物，增加恶魔结晶坛中意志晶簇的生长速度。生物种类越多，效果越好！",
    "",
    "与碎晶裂纹仪式组合来建造意志晶体农场！"

]);

mods.jei.JEI.addDescription([
    <contenttweaker:crack_fractured_crystal>],
[
    "意志晶簇生长完成后，自动掉落意志晶体。",
    "",
    "与孤魂集会仪式组合来建造意志晶体农场。"

]);

mods.jei.JEI.addDescription([
    <contenttweaker:faceted_crystal>],
[
    "用于获得第一块特殊意志晶体。",
    "",
    "在主仪式石上放置恶魔结晶坛来收集原生恶魔意志。",
    "",
    "意志晶簇生长完全后，仪式会将其分裂为其他种类的晶簇。"

]);

mods.jei.JEI.addDescription([
    <contenttweaker:ritual_culling>],
[
    "深度怪物学习之前，血之祭坛的最佳自动化方案。",
    "",
    "放置在血之祭坛下方。",
    "",
    "会杀死仪式下方的生物来填充血之祭坛。",
    "",
    "可用任意刷怪场来无限供应LP。",
    "",
    "满级的灵魂笼可用红石控制，是为仪式供应生物的最快手段。"

]);

mods.jei.JEI.addDescription([
    <contenttweaker:mark_fallen_tower>],
[
    "爆炸警告！",
    "",
    "该仪式会召唤含有各种（有时）有用矿物的流星。",
    "",
    "根据仪式激活后，丢在主仪式石上的物品召唤不同流星（需先使用激活水晶）。",
    "铁块：中等尺寸，大部分为低价值矿物",
    "金块：大型尺寸，大部分为低价值矿物",
    "钻石块：小型尺寸，大部分为有用矿物",
    "远古之心之重量：惊喜",
    "貘之心：另一个惊喜"

]);

mods.jei.JEI.addDescription([
    <environmentaltech:solar_cont_6>],
[
    "太阳能阵列是可用多种太阳能板组成的多方块结构。",
    "",
    "控制器与太阳能板等级越高，发电量越大。",
    "",
    "对于六级控制器：",
    "莱泽尔：332254 RF/t",
    "艾洛蒂：442949 RF/t",
    "凯罗尼：664508 RF/t",
    "普雷蒂：885898 RF/t",
    "艾恩尼：1329016 RF/t",
    "以太：1771965 RF/t"

]);

mods.jei.JEI.addDescription([
    <environmentaltech:solar_cont_5>],
[
    "太阳能阵列是可用多种太阳能板组成的多方块结构。",
    "",
    "控制器与太阳能板等级越高，发电量越大。",
    "",
    "对于五级控制器：",
    "莱泽尔：118943 RF/t",
    "艾洛蒂：158510 RF/t",
    "凯罗尼：237886 RF/t",
    "普雷蒂：317141 RF/t",
    "艾恩尼：475772 RF/t",
    "以太：634282 RF/t"

]);

mods.jei.JEI.addDescription([
    <environmentaltech:solar_cont_4>],
[
    "太阳能阵列是可用多种太阳能板组成的多方块结构。",
    "",
    "控制器与太阳能板等级越高，发电量越大。",
    "",
    "对于四级控制器：",
    "莱泽尔：39771 RF/t",
    "艾洛蒂：53055 RF/t",
    "凯罗尼：79623 RF/t",
    "普雷蒂：106110 RF/t",
    "艾恩尼：159246 RF/t",
    "以太：212301 RF/t"

]);

mods.jei.JEI.addDescription([
    <environmentaltech:solar_cont_3>],
[
    "太阳能阵列是可用多种太阳能板组成的多方块结构。",
    "",
    "控制器与太阳能板等级越高，发电量越大。",
    "",
    "对于三级控制器：",
    "莱泽尔：12005 RF/t",
    "艾洛蒂：16023 RF/t",
    "凯罗尼：24059 RF/t",
    "普雷蒂：32095 RF/t",
    "艾恩尼：48167 RF/t",
    "以太：64190 RF/t"

]);

mods.jei.JEI.addDescription([
    <environmentaltech:solar_cont_2>],
[
    "太阳能阵列是可用多种太阳能板组成的多方块结构。",
    "",
    "控制器与太阳能板等级越高，发电量越大。",
    "",
    "对于二级控制器：",
    "莱泽尔：3050 RF/t",
    "艾洛蒂：4075 RF/t",
    "凯罗尼：6125 RF/t",
    "普雷蒂：8175 RF/t",
    "艾恩尼：12275 RF/t",
    "以太：12800 RF/t"

]);

mods.jei.JEI.addDescription([
    <environmentaltech:solar_cont_1>],
[
    "太阳能阵列是可用多种太阳能板组成的多方块结构。",
    "",
    "控制器与太阳能板等级越高，发电量越大。",
    "",
    "对于一级控制器：",
    "莱泽尔：549 RF/t",
    "艾洛蒂：729 RF/t",
    "凯罗尼：1098 RF/t",
    "普雷蒂：1152 RF/t",
    "艾恩尼：1152 RF/t",
    "以太：1152 RF/t"

]);

mods.jei.JEI.addDescription([
    <nuclearcraft:salt_fission_retriever>,
    <nuclearcraft:salt_fission_distributor>],
[
    "熔盐枯竭燃料回收器和熔盐燃料分配器是高级版本的熔岩反应堆出入口。",
    "",
    "不需要与容器接触（所有面都可设置为'默认'，并行不需要彼此连接），即可自动输出燃料（分配器），抽入枯竭燃料（回收器）。",
    "",
    "每个回收器和分配器最多可与4个容器交互。",
    "",
    "这样就可以设计出通过leu235优化的，只使用主动式冷却器的熔盐反应堆（因为规则相同了）。"

]);

mods.jei.JEI.addDescription([
    <nuclearcraft:heat_exchanger_controller>,
    <nuclearcraft:heat_exchanger_tube_thermoconducting>],
[
    "热交换器可以冷却热钠钾流体，配合熔盐反应堆实现闭环冷却系统，产出高压蒸汽，高压蒸汽可用于某些配方和发电。",
    "",
    "在多方块预览中查看热交换器的内部设计。",
    "",
    "热交换器需要输入热流体和冷流体进行工作。流程中只需要使用水作为冷流体，任意热钠钾流体作为热流体即可。",
    "",
    "在热交换器内部，使用热交换管道（冷热流体均可）来传输流体。工作方式与熔盐反应堆中的燃料容器或冷却剂加热器类似。",
    "",
    "要正常工作，冷热流体管道应并行放置，相互接触，流体流向相反。热流体流向一个方向，冷流体流向则相反。",
    "",
    "空手右击管道的各个面来更改输入/输出模式。Shift右击可更改反面的模式。",
    "",
    "放置新热交换管道时对现有管道按住Shift，可复制其侧面配置（不幸的是，可能会出bug）。",
    "",
    "建造热交换器最简单的方法：先配置单层内部结构（从中间方块开始），然后按住Shift依次放置剩余层，最后再建造外部框架。",
    "",
    "'输入分配'是原流体的输出端，类似于冷却剂加热器的'冷却液分配'，因此两条管线可以通过同时进入管道的'默认'端来连接。",
    "",
    "要使冷热管道交互，其接触面应设置为'禁用'。",
    "",
    "要从热交换器堆外部供应流体，管道需连接至热交换出入口，输入端和输出端均需连接。",
    "",
    "切记，热流体会在冷流体输入的一侧输出，反之亦然。",
    "",
    "要将管道连接至输出端的出入口，与出入口接触的面应设置为'产物输出'。所有连接的管道会通过该方块输出其产物。",
    "",
    "根据选择的熔盐反应堆设计，需要循环使用最多5种不同的钠钾流体。",
    "",
    "根据选择的熔盐反应堆设计，可能需要循环使用多种不同的钠钾流体。多方块预览中有可容纳不同种类数量钠钾流体的设计。"

]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_stage1anomaly>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在天堂维度可以找到一些染色的变化之壁。存在变化之壁的结构会告诉你图腾的形状、树告诉你使用何种方块来搭建图腾。站在图腾上，使用异常检测器。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "使用以下方块建造图腾（从上到下）：",
    "绿宝石块",
    "黑曜石",
    "黑曜石",
    "黑曜石",
    "用4个铁块以十字形环绕黑曜石"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_warrenblindfold>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "维度门里的箱子中包含四种不同的蜂窝。将它们与四个神话叠壳精华以及一个眼罩结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "使用以下蜂窝：烈焰蜂窝、锌蜂窝、钛蜂窝、染色蜂窝（品红）。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_monumentallysentientbeatball>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "孤寂界中有一些有趣的战利品，有本书会告诉答案！将献给肉丸人的贡品与正确的装饰方块结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "使用对应方块环绕物品：",
    "虹火 + 镶板神庙石",
    "蓝发 + 紫色ME控制器科幻方块",
    "AI图 + 巫师之路的鄙夷方砖",
    "病态淡消 + 金属镶板虚空石",
    "成瘾性曲奇 + 压缩空间壁",
    "猫耳 + ME控制器科幻方块",
    "意大利国旗 + 同伴爱之方块",
    "香肠三明治 + 铋纹路荧石",
    "猫咪笑脸 + 嵌套砖块陨石石砖"
]);


mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_chaoticchanneling>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "一个特定机器的配方，往里面放入特定物品……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "使用热力的磨粉机处理生命水晶矿石，将产物与4个背叛之星、4个混沌宝石结合。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_truepowerabomination>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "地方界的特定树桩处会生成。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将精铸福鲁伊克斯水晶、仲裁者之触、龙之晶核、憎恶蛋与以下Animus模组的生物灵魂结合：丛林蜘蛛、地狱蜘蛛、灵魂蜘蛛、末影蜘蛛、海洋蜘蛛。"
]);


mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_icydreadshard>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "药剂师蜂窝可与某些方块合成，制作不同药水精华。暮色森林会告诉你使用何种方块来制作正确的精华。将药水精华与寒霜怖惧碎片结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将寒霜怖惧碎片与以下药水精华结合：腾空 V (8:20) [黄金境云]、恐惧 (0:05) [伊塞斯砖块]、冰霜世界 V (0:05) [永恒之冰]、死灵诅咒 (0:50) [压缩腐肉块]。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_attunedfluixconstruct>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "福鲁伊克斯史学家召唤石可以让你获得相位福鲁伊克斯构装体，隐藏在结构中的各种说明会解释需要将它与哪些龙之进化的生物灵魂结合。推荐用超限附魔快速获得生物灵魂。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将相位福鲁伊克斯构装体与以下龙之进化的生物灵魂结合：腐化棘背兽、冰川兽、粘液甲虫、炎蝾螈、守门者仆从、鹿角甲虫、死亡猎犬、末影三子。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_gemvoracity>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在未知维度找到一面不属于它的旗帜，将其制作成嵌宝旗帜，与暴食宝石结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将暴食宝石与嵌宝糖果旗帜结合。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_gemvoracity2>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",    "","",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在正确的维度与正确的群系中使用贪食宝石，未知维度会有你需要的信息！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在糖果维度中，于9x9大小的平顶山（岩柱）（Mesa (Bryce)）群系中使用贪食宝石。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_stage2anomaly>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "要是有办法传送到某个不可破坏的墙壁之外就好了……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "使用盖亚宇宙魔方以达到正确的高度。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_infuserfabrial>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在晶体维度中可找到许多源质罐子，将里面的源质变为魔力水晶碎片。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将宝石之心与以下魔力水晶碎片结合：Luna、Ventus、Vitreus、Aer、Aqua、Terra、Perditio、Motus。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_apothecaryprisonkey>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "原始森林中可找到一些特殊蘑菇，用杵和臼将其制成花粉。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将注魔药剂师之石与以下花粉结合：白色、品红色、蓝色、棕色。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_dragonslayer>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "在秘境维度，可以与一些特殊的着甲敌人战斗，它们的盔甲会告诉你将何物与心中之心结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将低语心中之心与以下龙鳞结合：凇白、晶紫、翡绿、烬灰。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_wyvernmonument>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "树龙界中的大理石神殿有四根柱子，在柱子上放置聚能水晶，使用飞龙神殿激活法器。4个聚能水晶的共鸣星座要求可在本世界中找到，某个结构会告诉你星座对应的柱子方向。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "北方：南极座",
    "南方：时钟座",
    "东方：圣芒座",
    "西方：虚御座"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_oblivioncandle>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "点击蜡烛，它会告诉你需要做什么！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "穿过暴风维度中的迷宫，站在迷宫底部的蜡烛圈中心使用湮灭蜡烛。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_stoneofanima>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "暴风维度可找到许多石板，将它们与玉髓锭结合。部分石板由小Boss掉落。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将玉髓锭与以下石板结合：视野、力量、活力、高压、饱和、净化、扭曲、圣洁。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_ghoulspirit>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "格瑞克维度中有许多水晶块，用对应的魔力水晶碎片与浓缩恐惧血液结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将浓缩恐惧血液与以下魔力水晶碎片结合：Mythus、Auram、Vitreus、Potentia。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_taintedmeatball>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "末结地世界中隐藏了4个深渊国度符咒的制作说明。可能需要挖掘一些方块才能找到。将提示的符咒与咒波清理海绵结合。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将咒波清理海绵与以下四个深渊国度的符咒结合：J'zahar：连续、Yog-Sothoth：能量、Azathoth：范围、Cthulhu：能量。"
]);



mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_spellrecyclercrystal>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将正确种类的箱子，与正确的水晶，以正确的形状结合。下界上方的村民将指引你。去找神圣橡木。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "用魔力水晶以十字形环绕水晶箱子。"
]);


mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_furnaceguy>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将永燃炉心与正确的颜料结合。伽里弗雷的熔火熔炉会指引你。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将永燃炉心与以下颜料结合：淡木槿紫、鸭绿、靛蓝、绿松石。"
]);

mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_memoryrestorationritual>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将意志陷落法器与正确的用龙之晶制作的物品结合。悚怖净化召唤石会帮助你。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "使用拥有'真名'属性的物品重现以下配方：",
    "<烈焰粉> <渊素锭> <湮灭弹>",
    "<无线信号增幅器> <意志陷落法器> <生的袭击者腿肉>",
    "<定义锭> <神灵之布> <暴怒符文>"
]);

mods.jei.JEI.addDescription(<contenttweaker:sun_spirit_cheese>,
[
    "还有其他更纯净的方法，使用游戏内的工具即可！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "烈阳巨灵发射的冰结球可用生物复制机复制。"
]);


mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_runesofliberation>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将源语符文、通过记忆恢复仪式获得的四个真相之卷以及四个虚无世界模组的技能胸甲结合。武器匠召唤石中的物品会指引你对应技能的任务图标。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "将源语符文、通过记忆恢复仪式获得的四个真相之卷与以下四种胸甲结合：支配、嗜血、魔力、远征。"
]);


mods.jei.JEI.addDescription(<contenttweaker:puzzle_solution_biomeritual>,
[
    "拜托！至少试着解一下谜题嘛！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "说真的！解谜很有意思的！下一页有额外提示！",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "一切始于群系仪式召唤石。里面的书会指引你举行群系仪式的地点，以及许多不同维度中的结构。这些结构的战利品中有12个不同的群系核心。找到使用移地换形之花的正确维度后，根据群系仪式召唤石地面上的方块，在5x5的区域内改变群系。12个方块分别对应12种群系（确保东南西北方向正确）。奥术群系转换仪可以将群系转换为正确维度的群系，重现正确的群系布局。生物群系检查器在这里非常有用。完成后（小菜一碟，我懂），站在5x5区域的中心，使用移地换形之花。",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "想不到你居然不试着把线索连起来……",
    "",    "",    "",    "",    "",    "",    "",    "",    "",    "",  "",    "",    "",    "",    "",    "",    "",    "",    "",    "", 
    "下面列出了需要的群系、群系对应的方块数量，以及相对坐标。",
    "",
    "MY：秘境(Mysterium) [2](-2,-2)(2,2)",
    "NW：核泄露之地(Nuclear Wasteland) [2](-1,-2)(1,2)",
    "SB：AE2群系(Storage Cell) [2](0,-2)(0,2)",
    "CC：水晶巨峰(Crystal Chasms) [2](1,-2)(-1,2)",
    "BV：凶险的黑暗虚空(Dangerous Black Void) [2](2,-2)(-2,2)",
    "TS：暮色河流(Twilight Stream) [4](-2,-1)(2,-1)(-2,1)(2,1)",
    "AF：外星森林(Alien Forest) [2] (-1,-1)(1,1)",
    "ST：风暴之地(Stormland) [2] (0,-1)(0,1)",
    "TH：荆棘之地(Thornlands) [2](1,-1)(-1,1)",
    "TL：腐化之地(Tainted Lands) [2](-2,0)(2,0)",
    "IR：黄金(Iromine) [2](-1,0)(1,0)",
    "BO：泥塘(Bog) [1](0,0)",
    "",
    "在欧罗巴使用移地换形之花，位于以下群系布局的中心（上 = 北 = -z）（左 = 西 = -x）（下 = 南 = +z）（右 = 东 = +x）",
    "",
    "MY NW SB CC BV",
    "TS AF ST TH TS",
    "TL IR BO IR TL",
    "TS TH ST AF TS",
    "BV CC SB NW MY"
]);

mods.jei.JEI.addDescription([
    <fluxnetworks:fluxplug>,
    <fluxnetworks:fluxpoint>,
    <fluxnetworks:fluxcontroller>,
    <fluxnetworks:fluxstorage>,
    <fluxnetworks:herculeanfluxstorage>,
    <fluxnetworks:gargantuanfluxstorage>],
[
    "通量网络可无线传输能量，是本整合包中首选的能量传输方式。",
    "",
    "要创建自己的通量网络，首先需要任意一台通量网络设备。可在设备GUI中自定义网络名称和颜色。每种通量网络设备都需要与网络绑定才能工作。",
    "",
    "通量接入点可以从能量源向网络中添加能量。",
    "",
    "通量接出点可以从网络中向机器输出能量。",
    "",
    "通量存储器可作为网络的能量缓存。如果必须传输大量RF/t，则需要存储器以防止能量中断。",
    "",
    "由于接入接出点过多会引起卡顿，所以推荐与其他能量传输手段配合以减少接入接出点的使用。例如，使用单个通量接出点和能量管道为大片机器供能。",
    "",
    "基地应该至少有两个通量网络，一个用于将能量从发电机传输到储能设备（比如神龙能量核心），另一个用来将能量从储能设备传输到所有机器。"
]);

mods.jei.JEI.addDescription([
    <botania:altar>],
[
    "花药台需要水才能工作。可以用无底之瓮或带有潮汐护符的使用者来填充水。",
    "",
    "JEI中显示的材料需丢入花药台中。",
    "",
    "所有材料添加好后，丢入种子来完成配方。"
]);

mods.jei.JEI.addDescription([
    <extrabotany:spiritfuel>],
[
    "可通过直接食用梦魇燃料，或将其放入活石祭坛内获得精神燃料。"
]);


mods.jei.JEI.addDescription([
    <contenttweaker:catalyzation_chamber>],
[
    "催化室是一个3x3x3的多方块结构，在JEI中查看结构预览。",
    "",
    "使用世界盐右击结构来使结构成型。",
    "",
    "要使多方块正常工作，需在机器GUI中放入神秘奇境模组的催化石。",
    "",
    "每种催化石有不同效果：",
    "异形之石：将矿石转换成奇异矿簇",
    "转化之石：转化矿石的种类",
    "炼金术士之石：纯化矿物",
    "",
    "催化石有耐久度，但可以附上高等级的耐久魔咒，来变的几乎不会损坏。",
    "",
    "从顶部丢入矿物进行输入，机器会将产物从前方丢出。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:primordial_accelerator>],
[
    "元始加速器用于将元始珍珠变为元始晶粒。",
    "",
    "加速器是一个可自定义长度的多方块结构，在JEI中查看多方块预览，轨道越长，产出的晶粒就越多（收益递减）。最大长度为10格。",
    "",
    "可用管道将元始珍珠输入到加速器内。",
    "",
    "使用红石脉冲来激活该机器，元始晶粒会在终端附近掉落。",
    "",
    "晶粒可通过处理重新变为元始珍珠，需要一些坩埚自动化。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:heat_exchanger_math>],
[
    "要建造热交换器，首先需要计算熔盐反应堆加热的钠钾冷却剂的速度。每个冷却剂加热器的基础速度为1mB/t，效率提供乘数加成。例如，一个150%效率的溶解反应堆，每个冷却剂加热器的加热速度为1.5mB/t。",
    "",
    "每种冷却剂需要交换不同的热量来冷却，需要不同的热量来加热。在JEI中，冷却配方显示为由红变蓝的箭头，加热配方显示为由蓝变红的箭头，鼠标放在箭头上可显示所需热/冷却量。这些数字决定了冷却剂的处理速度，计算方式为：对于每个接触冷热流体的面，处理速度=冷却或加热所需热量*(1/管道导热倍率) mB/t。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:hand_framing_tool>],
[
    "与方块结合以设置镶框样式。",
    "",
    "左上：抽屉外壳。",
    "右上：抽屉边框。",
    "左中：抽屉正面。"
]);

mods.jei.JEI.addDescription([
    <immersiveengineering:metal_multiblock:11>,
    <immersiveengineering:metal_multiblock:12>,
    <contenttweaker:holographic_ore>,
    <contenttweaker:ultimate_ore>,
    <contenttweaker:matrix_ore>,
    <contenttweaker:psichic_stone>,
    <contenttweaker:runic_ore>],
[
    "斗轮式挖掘机可从沉浸工程模组的矿床中无限产出矿物。与正常矿脉不同，矿床并不实际存在于世界中。每个区块有20%概率生成矿脉。",
    "",
    "要鉴别矿床，在区块中放置岩芯钻井，输入能量后右击启动。钻井会生成岩芯样本，能显示该区块内的矿床和油藏名称。",
    "",
    "在对应区块内建造斗轮式挖掘机多方块来开采矿床。",
    "",
    "部分矿物不在世界中生成，只能通过斗轮式挖掘机获取。"
]);

mods.jei.JEI.addDescription([
    <immersivepetroleum:metal_multiblock:2>,
    <contenttweaker:stormlight_infused_crystal>],
[
    "采油机可从沉浸原油模组的油藏中无限产出矿物。与正常流体生成不同，油藏并不实际存在于世界中。每个区块有50%概率生成油藏。",
    "",
    "要鉴别油藏，在区块中放置岩芯钻井，输入能量后右击启动。钻井会生成岩芯样本，能显示该区块内的矿床和油藏名称。",
    "",
    "在对应区块内建造采油机多方块来开采油藏。"
]);

mods.jei.JEI.addDescription([
    <tconstruct:seared_furnace_controller>],
[
    "焦黑熔炉消耗熔岩进行工作，可并行处理多个物品。",
    "",
    "熔炉可以是任意尺寸的立方体，只要内部为空，控制器在侧面，储罐在边框即可。结构越大，可并行处理的配方就越多。"
]);

mods.jei.JEI.addDescription([
    <modularrouters:item_router>],
[
    "模块化路由器可以进行物流操作（类似于AE2），适用于小规模、短距离的自动化。",
    "",
    "路由器按照从左到右的循环顺序，根据模块放置区中的模块执行操作。模块可以执行简单的操作，如推拉方块，也可执行更复杂的操作，如破坏、放置或发射物品。",
    "",
    "每个模块的目标位置可通过Shift右击对应位置来指定。",
    "",
    "安装好模块后，可通过中键点击来配置模块。可设置过滤器或添加拓展。",
    "",
    "升级可放置在路由器对应的区域。",
    "",
    "鼠标放在任意模块化路由器模组的物品上时，按住Ctrl键查看其功能。"
]);

mods.jei.JEI.addDescription([
    <extrautils2:scanner>],
[
    "扫描红圈所对的方块空间。",
    "",
    "若空间内方块与目标方块相匹配，发出红石信号。",
    "",
    "目标方块可通过点击界面中的'设置为当前方块'按钮来设置。"
]);

mods.jei.JEI.addDescription([
    <extrautils2:user>],
[
    "模拟多种玩家点击行为。",
    "",
    "可在点击类型中循环，左击或右击，使用哪个栏位中的物品进行点击。",
    "",
    "例如：要为储罐填充熔岩，在第一格内放置熔焰护符，其他栏位放置卡莱恩能量之星；将模式设置为'对方块使用物品（Use Item on Block）'，'右击（Right Click）'，'仅使用左上角栏位（Upper Left Slot Only）'。",
    "",
    "例如：要为花药台填充水，在第一格内放置潮汐护符；将模式设置为'使用物品激活方块（Activate Block with Item）'，'右击（Right Click）'，'仅使用左上角栏位（Upper Left Slot Only）'。",
    "",
    "例如：要用剪刀收获树叶，在第一格内放置剪刀；将模式设置为'对方块使用物品（Use Item on Block）'，'左击（Left Click）'，'仅使用左上角栏位（Upper Left Slot Only）'。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:how_to_finish_meatballcraft>],
[
    "如果想要打通本整合包，下面是我能给你的最好建议！",
    "",
    "基建是重中之重！好的基建能让你轻松扩展基地，升级各类机器。确保被动合成各种资源来更多机器、方块和合成材料！解锁的模组越多，就需要铺设的基建就越多！",
    "",
    "积极进行自动化！扩展基建的最佳方法就是在解锁新材料和配方时，立即建设相关的自动化！如果某种材料出现在了支线任务中，最好也将其自动化！",
    "",
    "慢慢来！在推进主线之前，完成支线任务、建设相关自动化或便利设施几乎总是最佳选择！流程中会遇到很多难啃的配方，而完成支线任务能让你做好准备！这种做法也适用于武器和盔甲升级，支线内容通常能提供不错的装备升级！",
    "",
    "多花点时间查看JEI！许多物品有多种配方和获取方法，在不同阶段各有优劣！",
    "",
    "查看游戏内文档！它总不能是白写的吧！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:fission_automation>],
[
    "能够稳定地被动产出裂变同位素十分重要！",
    "",
    "你需要为每步燃料加工配备单独的裂变反应堆！能量来源章节中的任务列出了所有需要的裂变步骤！",
    "",
    "只要能够被动运行，速度就不是问题（之后另说）！每种燃料提供的5x5x5的多方块预览就够了！对于某些燃料（并非全部），也可使用棋盘状的凛冰冷却思路！",
    "",
    "对于每步处理，最好将输出的同位素分为两种，用于合成配方的缓存，以及用于后续裂变步骤的原料。压缩抽屉对某些步骤很有帮助！",
    "",
    "在第5章后期，将解锁两相裂变堆，用这个新的多方块来取代之前速度较慢的裂变堆，以加快处理速度！游戏后期会需要它的！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:draconic_upgrades_locations>],
[
    "所有的龙之进化模组升级可发现于以下跃迁器位面！",
    "",
    "移动速度 - 地盘界",
    "攻击伤害 - 地盘界",
    "护盾充能 - 地盘界",
    "护盾恢复 - 地盘界",
    "跳跃提升 - 地方界",
    "箭矢伤害 - 地方界",
    "范围攻击 - 地方界",
    "RF容量 - 地平界",
    "拉弓速度 - 谐律界",
    "挖掘速度 - 谐律界",
    "范围挖掘 - 共鸣界"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:berserker_forge_loop>],
[
    "狂战熔炉可用来复制意志晶体用于自动化。",
    "",
    "将多方块与恶魔坩埚或狂战坩埚放置在同一区块内。",
    "",
    "首先在坩埚中燃烧一些需要的特殊意志晶体。灵域内的意志可用来以较低成本制作意志晶体。意志晶体产出100点意志，意志碎段产出为10点。",
    "",
    "通过将输出的意志晶体循环输入回坩埚，然后制造更多晶体，最终会获得净收益！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:duplicating_enchants>,
    <bibliocraft:typesettingtable>,
    <bibliocraft:printingpress>],
[
    "收藏馆（Bibliocraft）模组可以复制附魔书！使用排版台和拓印机前，确保佩戴有单片眼镜，否则无法查看经验消耗信息！",
    "",
    "将想要复制的附魔书右击放入排版台左下的栏位，上方栏位放入拓印槽。空手Shift右击排版台来制作附魔片。此操作会基于魔咒种类和等级消耗经验。",
    "",
    "将附魔片右击放入拓印机中间最深的槽中，靠后的斜板上放置一些墨囊。将书右击放入长板的左侧，随后就会被转换为想要复制的附魔书！一个附魔片最多能消耗耐久制作3本附魔书，可使用其他模组进行修复。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:jei_tipsandtricks>],
[
    "如果记不得把某个物品放在哪了，又不想一格一格找，可以双击搜索栏，在JEI中搜索想要寻找的物品，然后玩家物品栏/容器物品栏中的相同物品会高亮显示。",
    "",
    "还可以在JEI中使用特定前缀缩小所查找物品的范围。",
    "",
    "可使用以下符号作为搜索前缀：",
    "# - 按物品提示文本过滤",
    "& - 按资源ID过滤物品（可能永远也用不到）",
    "^ - 按颜色过滤物品",
    "$ - 按矿物词典过滤物品",
    "@ - 按模组名称过滤",
    "% - 按创造模式标签栏名称过滤（可能永远也用不到）",
    "",
    "还可使用'-'（减号）来从搜索中剔除物品。只能在上述前缀之后使用该前缀。否则JEI不会进行搜索。",
    "",
    "例如，若想要搜索核电工艺的燃料，但不想搜索中出现枯竭燃料，可用以下形式搜索：",
    "",
    "@nuclearcraft 燃料 -枯竭",
    "",
    "若想进一步缩小搜索范围，可以在搜索末尾添加-桶 -熔融 -氧化，这样就可以搜索到所有不同类型的燃料，同时排除其枯竭、熔融和桶装形式。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:emptiness_tutorial>],
[
    "要进入虚域，需要使用裂缝定位器寻找裂缝。下界天花板是寻找裂缝的好地方。靠近裂缝时，定位器会发光。",
    "",
    "要打开裂缝，需要使用安装有元动能量电池的满充能神秘或虚空预言者法师护手。靠近咒波裂隙吸收其能量来为护手充能。",
    "",
    "护手充能完毕之后，右击裂缝将其打开！",
    "",
    "要进入邪术旋塔，需要使用安装有元动能量电池的满充能神秘或虚空预言者法师护手右击邪术锁孔。",
    "",
    "击败最终Boss！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:passive_packagedauto>],
[
    "封包机和解包机都可当做其他种类机器一样处理，只需稍加设置便可实现被动生产。对于像精制矿物粉这类物品来说很有用！",
    "",
    "有几点需要注意：",
    "A. 当使用石英纤维或其他能量传输手段时，封包机、解包机以及封包合成器工作机制与普通机器相同。只供能，别提供频道。",
    "B. 用于同一配方自动化的封包机和解包机都应使用相同的封包配方存储器。",
    "C. 可能会需要不止一个封包机。为编码器GUI中显示的每个配方包使用单独的封包机，设置会更简单。将鼠标放在每个配方包上，查看每个封包机需要制作的子配方包。",
    "D. 设置为'第一匹配'的封包机会无序合成满足材料需求的子配方包。将所有封包机都设置为该模式。",
    "",
    "遵循以下步骤，来设置被动化流水线。",
    "1. 给每个合成子配方包的封包机，配备存有其子配方包所需材料的单独抽屉墙（或其他容器）。",
    "2. 使用限制物品过滤器将物品从抽屉墙输送到对应封包机，过滤器设置为匹配子配方包材料数量。",
    "3. 将封包机合成的子配方包传输到与正确的封包合成器相连的封包机。",
    "4. 将最终产物从封包机中输出。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:passive_extended_crafting>],
[
    "合成拓展模组可通过自动化接口实现被动自动化。",
    "",
    "该方法速度较慢，如果要实现快速的被动合成，推荐使用封包合成（有自己的JEI信息框），但本方法易于实现，并且对某些资源来说速度也够了。",
    "",
    "在合成拓展的工作台（包括末影工作台）上放置一个自动化接口，点击'保存配方'按钮即可将配方设置为自动运行。",
    "",
    "自动化接口可在'配置'菜单中设置为自动输入。",
    "",
    "在自动化接口旁放置一个抽屉控制器，控制器与包含所有所需材料的抽屉墙连接，如此材料便可自动被抽入工作台！"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:woot_flusher>],
[
    "该物品会重置所有Woot工厂。",
    "",
    "要重置特定种类生物，运行以下命令：",
    "/woot flush *生物ID*",
    "",
    "要获得特定生物的ID，可以在JEI中将鼠标悬停在JEI中对应的刷怪蛋上，查看实体ID。",
    "格式为：*模组ID*:*生物ID*"
]);

mods.jei.JEI.addDescription([
    <projecte:collector_mk1>,
    <projecte:collector_mk2>,
    <projecte:collector_mk3>],
[
    "能量收集器可从光照中生成EMC。",
    "",
    "放置后会被动生成EMC。可通过在其上方放置荧石来加速。",
    "",
    "会自动将EMC传输到相邻的能量凝聚器或反物质继电器。",
    "",
    "在收集器中放入煤炭和其他燃料可消耗EMC将其转化为EMC值更高的物品，但该机制在本整合包中没有实际作用。"
]);

mods.jei.JEI.addDescription([
    <projecte:relay_mk1>,
    <projecte:relay_mk2>,
    <projecte:relay_mk3>],
[
    "反物质继电器就是EMC电池。",
    "",
    "可自动从相邻的能量收集器中获取EMC。",
    "",
    "可自动将EMC传输到相邻的能量凝聚器。"
]);

mods.jei.JEI.addDescription([
    <projecte:condenser_mk1>,
    <projecte:condenser_mk2>],
[
    "能量凝聚器是自动化EMC物品的最简单方法。将想要复制的物品标记在左上方的槽位里。",
    "",
    "用于复制物品的EMC可从能量收集器和继电器中获得，或者从输入凝聚器的其他EMC物品中获得。",
    "",
    "有很多方法生成高EMC值物品，将其输入凝聚器。",
    "",
    "凝聚器 MK2有单独的输入和输出物品栏，转化速度更快，更适合自动化。"
]);

mods.jei.JEI.addDescription([
    <dimdoors:stabilized_rift_signature>,
    <dimdoors:rift_signature>],
[
    "使用裂痕印记在两个不同地点分别右击来创建连接两点的裂隙。基础版的裂痕印记创造的裂隙不稳定，使用稳定版的裂痕印记来创造安全的稳定裂隙。",
    "",
    "在裂隙上放置铁质维度门便可通过门穿梭两地。"
]);

mods.jei.JEI.addDescription([
    <botania:enchanter>],
[
    "魔力附魔台可以不消耗附魔书为工具附魔。",
    "",
    "按照预览搭建结构，使用森林法杖右击青金石块来成型。",
    "",
    "将未附魔的物品放入附魔台中，在黑曜石圈内丢入附魔书。",
    "",
    "使用火花为附魔台提供魔力。每个魔咒的魔力消耗随等级呈指数增长，但可以接受超过铁砧上限的魔咒。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:buildcraft_heat_exchanger>,
    <buildcraftfactory:heat_exchange>],
[
    "BC模组的热交换器可按温度顺序，改变流体的状态：冷、热、炽热。",
    "",
    "要加热流体（冷 > 热），必须将其在热交换器中作为冷流体输入（查看预览以了解多方块结构、输入、输出），使用熔岩作为热流体输入。",
    "",
    "要冷却流体（热 > 冷），必须将其在热交换器中作为热流体输入，使用更低温度的流体作为冷流体输入",
    "",
    "在本整合包流程中，仅涉及重油的冷到炽热转变。"
]);

mods.jei.JEI.addDescription([
    <rf-capability-adapter:aecapabilityadapter>,
    <rf-capability-adapter:aecapabilityadapter_part>],
[
    "ME功能适配器可将频道传输到压缩空间中。",
    "",
    "将功能适配器与压缩空间机械相邻放置。在压缩空间内，将另一个功能适配器与配置到合适面（若外部的功能适配器在压缩空间机械的西侧，接口同样也需要设置为西）。",
    "",
    "方块形式的功能适配器可传输32个频道。",
    "",
    "面板形式的功能适配器可传输8个频道。"
]);


mods.jei.JEI.addDescription([
    <contenttweaker:getting_more_starlight>,
    <astralsorcery:blockaltar:*>],
[
    "星辉魔法的祭坛需要星能才能工作。不同配方需要的星能不同。若放置好配方后，产物没有出现在祭坛GUI中，则说明星能不足。",
    "",
    "一般情况下，夜晚露天时的星能就够用了，但是有些配方需要更多星能。",
    "",
    "所处的Y值越高，星能越强。",
    "",
    "特定区块的星能会高于其他区块，在夜晚使用汇星共振器来寻找这类区块。",
    "",
    "在祭坛周围按多方块结构（查看JEI预览）摆放星辉转继器（其中放置玻璃透镜）可以增强星能。但当多个多方块结构彼此距离过近时，反而会减少星能。",
    "",
    "将聚能水晶与祭坛链接同样可增加星能。使用聚能水晶多方块结构可以进一步提升增幅效果。"
]);

mods.jei.JEI.addDescription([
    <rftools:space_chamber_controller>,
    <rftools:space_chamber>,
    <rftools:space_chamber_card>],
[
    "空间仓是自动放置大型结构的最通用方法。",
    "",
    "要复制进行自动搭建的结构，将7个空间角落方块放置在结构空间范围的8个角落里，最后一个角落放置空间控制方块。",
    "",
    "使用智能扳手右击控制方块来设置结构。",
    "",
    "若结构设置正确，使用空间仓卡右击控制方块，结构将加载到空间仓卡中。",
    "",
    "将得到的空间仓卡放入建造机中来自动搭建记录的结构。"
]);


mods.jei.JEI.addDescription([
    <contenttweaker:betweenlands_potions>,
    <thebetweenlands:pestle>,
    <thebetweenlands:mortar>,
    <thebetweenlands:aspect_vial:*>,
    <thebetweenlands:dentrothyst_vial:*>],
[
    "研磨器与石杵可用于制作多种磨碎的物品。每个玩家存档中物品含有的要素都各不相同。可以使用壁虎笼子来测试磨碎物品的效果。",
    "",
    "要制作Armaniis，使用能让壁虎镇静下来，用可爱的眼神看着你的磨碎物品。",
    "",
    "要使用正确的磨碎物品来酿造药水，用杂草木或赛摩桶给炼药器加满沼泽水，放入正确的原料，然后搅拌（空手右击）数分钟。",
    "",
    "若原料正确，炼药器内流体的颜色将变深。酿造成功后，使用杂草木或赛摩桶将流体放入蒸馏器中（Shift右击）。使用木晶药瓶从蒸馏器中收集要素。"
]);

mods.jei.JEI.addDescription([
    <enderstorage:ender_storage:0>,
    <enderstorage:ender_storage:1>,
    <enderstorage:ender_pouch>],
[
    "末影箱子和末影蓄水槽可无线传输物品和流体。",
    "",
    "这些方块可使用染料染色顶部颜色槽来设置为不同频率。颜色频率相同的箱子和蓄水槽之间互相连接，共享物品栏/流体存储。",
    "",
    "末影袋子可通过Shift右击末影箱子来与其连接。可通过袋子直接访问物品栏，而无需打开箱子。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:custom_dimlets>,
    <rftoolsdim:dimlet_workbench>,
    <rftoolsdim:dimlet_parcel>,
    <rftoolsdim:material_absorber>,
    <rftoolsdim:liquid_absorber>,
    <rftoolsdim:biome_absorber>,
    <rftoolsdim:terrain_absorber>,
    <rftoolsdim:feature_absorber>,
    <rftoolsdim:time_absorber>],
[
    "维度卡用于控制用于控制RFTools Dimensions模组创建的自定义维度的属性。",
    "",
    "维度卡可作为战利品发现于部分RFTools维度，也可在维度卡工作台中使用维度卡包裹掉落的材料合成得来。",
    "",
    "维度卡有很多种类型，可用来控制自定义维度中的生物群系、流体、材料、生物、天空属性、结构生成、地形类型、特征、时间循环、效果以及天气。",
    "",
    "为了规划进度，某些特定的流体和材料被设置为这些维度的专属资源。",
    "",
    "在工作台中制作某些（绝大部分）维度卡都需要吸收器。尽管与流程进度相关的吸收器都有自己的特定配方，但“普通”的吸收器仍需要在世界中配置。",
    "",
    "材料吸收器：相邻放置总计128个方块，方块会被消耗",
    "",
    "流体吸收器：相邻放置128桶流体，流体将被消耗",
    "",
    "生物群系吸收器：放置在对应的生物群系",
    "",
    "地形吸收器：放置在拥有所需地形的维度（末地岛屿、下界等）",
    "",
    "特征吸收器：放置在拥有所需特征的维度（矿脉、洞穴等）；部分特征为某些RFTools维度专属，因此需要生成一些随机维度",
    "",
    "时间吸收器：在所需时间点使用红石脉冲激发，需重复此操作十次才能完全吸收（可使用计时器和时间之瓶作弊）"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:custom_dimensions>,
    <rftoolsdim:dimension_enscriber>,
    <rftoolsdim:empty_dimension_tab>,
    <rftoolsdim:realized_dimension_tab>,
    <rftoolsdim:dimension_builder>,
    <rftools:dialing_device>,
    <rftools:matter_transmitter>],
[
    "要使用RFTools模组创建自定义维度，首先需要一个空白维度表。",
    "",
    "尽管只使用维度表就能创建自定义维度，但此种方法随机性太大，样子很酷，但经常没什么用（你可能还是想试个几次）。要创建随机维度，将维度表放入维度刻录器，然后点击“Store”按钮。",
    "",
    "要控制维度的内容，需要使用维度刻录器为维度添加维度卡。查看对应的JEI信息框（在JEI中搜索'自定义维度卡'）来查看更多维度卡相关信息。",
    "",
    "要激活自定义维度，需要将其放入维度构建器。构建器会消耗能量以维持维度激活。只要维度还有能量，就能够进入。你不会想待在能量耗尽的维度的。会有坏事发生。",
    "",
    "要传送到自定义维度中，可以使用传送控制器将附近的物质传输器连接到目标维度。"
]);


mods.jei.JEI.addDescription([
    <contenttweaker:celestial_notes>,
    <thaumcraft:celestial_notes:*>],
[
    "要获得天象笔记，你需要准备魔导透镜、笔与墨，以及纸。",
    "",
    "将魔导透镜对准正确的方向，并在物品栏中备好其他两样物品来获得对应的天象笔记。",
    "",
    "每种笔记都可获取多次，但一个MC日只能获取一次。类似血魔法模组的不完善的仪式石、龙之进化模组的苍穹变换器，或者至尊法咒（？）之类的东西可能会有所帮助。",
    "",
    "不同笔记的需求：",
    "太阳，",
    "东南西北四方的空旷天空，",
    "月亮的多种月相（每晚均不相同）"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:gaia_3_tips>],
[
    "以下是盖亚守护者 III的一些战斗提示：",
    "",
    "仅可使用原版、植物魔法模组以及额外植物学模组的装备。所以记得给这些装备配些强力附魔！",
    "",
    "地上的红色地雷可以直接秒杀你，离它们远点！绿色地雷会造成缴械。蓝色地雷会造成缓慢和致盲效果。",
    "",
    "可以使用其他模组的饰品，建议带个磁铁，因为Boss会缴械。",
    "",
    "推荐使用的装备：",
    "昴星团战斗女仆服（最好携带超限附魔）",
    "超级王冠",
    "终极苹果（战斗开始前食用）",
    "附魔金苹果",
    "魔力之戒或类似物品",
    "环游者腰带",
    "",
    "近战武器：",
    "召雷者（最好携带超限附魔，推荐附魔生命窃取）",
    "王者圣剑（携带强力附魔，推荐附魔生命窃取）",
    "",
    "远程武器：",
    "水晶弓",
    "王之宝钥", 
    "百中弓"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:gaia_4_tips>],
[
    "以下是与盖亚守护者 IV的一些战斗提示：",
    "",
    "Boss会复制你拥有的所有正面状态效果（抗性提升、生命恢复等）。不要用状态效果强化自己！",
    "",
    "仅可使用原版、植物魔法模组以及额外植物学模组的装备。所以记得给这些装备配些强力附魔！",
    "",
    "地上的红色地雷可以直接秒杀你，离它们远点！绿色地雷会造成缴械。蓝色地雷会造成缓慢和致盲效果。",
    "",
    "可以使用其他模组的饰品，建议带个磁铁，因为Boss会缴械。",
    "",
    "推荐使用的装备：",
    "昴星团战斗女仆服（最好携带超限附魔）",
    "超级王冠",
    "魔力之戒或类似物品",
    "环游者腰带",
    "",
    "近战武器：",
    "召雷者（最好携带超限附魔，推荐附魔生命窃取）",
    "王者圣剑（携带强力附魔，推荐附魔生命窃取）",
    "",
    "远程武器：",
    "水晶弓",
    "王之宝钥", 
    "百中弓"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:energy_management_tipsandtricks>],
[
    "以下是一些基地能量管理的技巧提示：",
    "",
    "推荐使用集中式的能量存储系统，这可以确保基地有充足的能量运行，同时也便于排查问题。",
    "集中式能量存储空了，就说明你需要更多发电机；正在充能，则表示一切正常！",
    "对于集中式能量存储方案，你可以从末影接口模组的电容库起步，但神龙能量核心无疑是最佳选择，在第二章就可合成。",
    "",
    "使用通量网络模组进行无线能量传输是基地能量传输的最佳方式。",
    "为了避免能量循环流动的问题，你应该使用两个独立的通量网络，一个用来将能量从发电机传输到存储系统，另一个则从能量存储传输到机器。",
    "根据机器和发电机的能量带宽，在对应的通量接出点/接入点中禁用传输限制。",
    "",
    "为每台机器/发电机单独配备通量接出点/接入点不是个好主意，这样会导致卡顿。",
    "推荐使用其他能量传输手段（能量管道、能量导管、能量激光）将单个接出点/接入点与多台机器/发电机连接。确保能量传输速率满足需求即可。"
]);


mods.jei.JEI.addDescription([
    <contenttweaker:passive_crafting_subnets>],
[
    "注意：在AE2主网络中使用合成卡和缓存指令器仍会非常卡顿，但在本子网架构中十分实用。",
    "",
    "注意：在同一被动式合成子网中，将一个配方的输出作为另一配方的输入可能会造成卡顿。若想要自动化套娃配方，普通的被动式产线更好。",
    "",
    "对于可能需要更高处理速度的被动式封包合成配置，或在同一多方块结构中被动化多个配方的情况，使用缓存指令器的AE2合成子网十分有用。",
    "",
    "若想以此方法在同一多方块结构中自动化多个配方，需要注意：直接建造多个相同机器，进行正常的被动自动化可能更快、更高效。但对于一些产速需求量较低的物品，这是一个可行的策略。",
    "",
    "若想以此方法实现封包合成自动化，需要注意：此思路特别适合组合合成，但也适用于其他合成。",
    "",
    "该类型的子网由一个小型的AE2网络构成，包括：",
    "",
    "1) 单个机器的合成配置（装有样板、面向机器的接口，配置好配方的封包机和解包机等）。若想用此方法自动化多种机器，请构建多个这样的子网！为了提高处理速度，可以构建多个相同的合成配置，使用完全相同的样板或配方包。",
    "",
    "2) 某种仅用于存储配方输入的容器；当然也可以用存储总线读取从属于AE2主网络的配置过的接口。",
    "",
    "3) 用于存储配方输出的容器；这里推荐使用存储总线读取抽屉。",
    "",
    "4) 一个配置好目标物品和数量的缓存指令器。"
]);


mods.jei.JEI.addDescription([
    <xreliquary:infernal_tear>],
[
    "经验产率：",
    "",
    " . 下界之星 - 500xp （~19级）",
    " . 钻石 -  125xp （~8级）",
    " . 铁/锡/银/铜/钢/金锭，以及绿宝石 - 63xp （~5级）",
    " . 末地石/沙砾/地狱岩/砂岩 - 1xp",
    " . 黑曜石 - 5xp",
    " . 煤炭 - 4xp",
    " . 青金石 - 9xp",
    " . 火药 - 8xp",
    " . 木炭 - 2xp",
    " . 黏土 - 4xp",
    " . 灵魂沙 - 2xp",
    " . 地狱砖 - 4xp",
    " . 燧石 - 2xp"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:thaumatorium_automation>],
[
    "为了稳定生产JEI中显示的某些资源，你需要为神秘炼金塔配置一些自动化。此方法适用于被动生产和自动合成，具体取决于配置方式。",
    "",
    "若存在稳定的源质供应，注魔供应器可与源质注入装置（放置在神秘炼金塔上）一起使用，自动收集配方所需源质。",
    "",
    "神秘炼金塔可通过管道从侧面接收物品，其产生的掉落物可以通过任何远程物品收集器（如虚空箱子）收集。",
    "",
    "可使用记忆矩阵为同一神秘炼金塔编码多个配方。",
    "",
    "由于该配置会产生掉落物，可能会导致卡顿，因此如果你选择被动生产，最好使用某种自动停机机制来关闭它们（例如使用比较器或标准发信器）。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:runic_altar_automation>],
[
    "为了获取大量符文，可能需要自动化符文祭坛。此方法适用于被动生产和自动合成，具体取决于配置方式。注意，符文也可通过其他方法获得（如果你有创意的话）。",
    "",
    "在提供给定配方的正确材料时，花格箱可以直接把它们丢入祭坛。注意，活石应总是最后丢入；可通过在处理模式的样板的最后一个槽位标记活石（自动合成），或使用某些物品传输逻辑（被动生产）。若是自动合成，应将接口设置为阻挡模式，以确保花格箱内物品不会溢出。",
    "",
    "此外，活石还可以由独立的系统供应。当存在有效配方时，比较器可从符文祭坛中检测并发出强度为1的红石信号，我们需要利用这点来实现活石供应。",
    "",
    "必须使用魔力发射器为祭坛提供配方所需魔力。注意，当配方有效，且魔力充足时，比较器可从符文祭坛中检测并发出强度为2的红石信号。",
    "",
    "一旦有效物品和活石均存在，且祭坛魔力充足，便可通过使用者来使用森林法杖启动配方，可使用任意远程物品收集系统来获取输出。",
    "",
    "注意，植物魔法模组的符文在配方中不会消耗，收集系统需要考虑到这一点。",
    "",
    "由于该配置会产生掉落物，可能会导致卡顿，因此如果你选择被动生产，最好使用某种自动停机机制来关闭它们（例如使用比较器或标准发信器）。"
]);

mods.jei.JEI.addDescription([
    <contenttweaker:plasma_farm>],
[
    "核电工艺模组的聚变反应堆在工作时会产出等离子体。",
    "",
    "可使用建造机或范围泵抽取。",
    "",
    "在排空后，除非重启反应堆，否则等离子体不会重新填充。可使用红石电路定时开关反应堆来填充等离子体。"
]);
