{
  "preRequisites:11": [
    1002
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oWARNING: Bee genetics and breeding can get very complex, unless you know what you are doing, you should follow these three main rules to keep things simple:\n\n1. A princess and a drone, when combined, make a queen. If the drone and princess are the same species, the queen will be the same species. If you combine princess and drone from different species, you can create new ones (JEI will guide you with this). You should only use the advanced mutatron to create new bee species!\n\n2. A queen makes a princess and several drones, as well as combs, depending on the species (again JEI will guide you). You should only use the industrial apiary to run bees of the same species!\n\n3. Ignoble stock bees are bad, pristine bees are good! You should not use ignoble queens/princesses. There are ways to make ignobles work, but the methods are more advanced.\n\nIf you know what you are doing, bees follow the rules of Mendelian genetics. Every bee trait has a dominant and recessive gene, the portable analyzer will give you the genetic makeup of a given bee! Breeding bees to select specific traits can get you much faster and more efficient bees!\n\n§fBee genetics are surprisingly complex, not surprised they took over the universe!\nThe bee analyzer will help me to keep track of bee genes at the cost of a little honey.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "forestry:portable_alyzer"
      },
      "name:8": "Portable Analyzer"
    }
  },
  "questID:3": 20490,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 64,
          "id:8": "forestry:honey_drop"
        },
        "1:10": {
          "Count:3": 64,
          "id:8": "forestry:honey_drop"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "ignoreNBT:1": 1,
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "forestry:portable_alyzer"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}