{
  "preRequisites:11": [
    1032
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§7§oHere you can find a description of all the traits;\n\nAlien\nThe stats feel off... as if they\u0027re changing! Maybe time will tell?\n\nAnti-Air I-II\nDeals additional damage to flying creatures.\n\nAnti-Corrosion\nEvery tick, there is a small chance that the holder\u0027s poison is healed (when held in hand).\n\nApocalypse\nYour victim becomes moribund and is afflicted with increasing levels of Wither.\n\nAquadynamic\nThe tool is unhindered by water and loves rainy evenings.\n\nAridiculous\nThe tool works better in hotter environments.\n\nAutosmelt\nHarvested blocks get smelted.\n\nBaconlicious\nHitting things sometimes gives bacon.\n\nBaron\nOccasionally deals additional damage.\n\nBlazing\nSets targets on fire.\n\nBlind Bandit\nA mob called the \"Blind Bandit\" will sometimes be summoned for a limited time after you attack or are attacked. She will attack hostile mobs, and will also attack those who dare attack her (except you), piercing armor on mobs.\n\nBlizzard II\nFreezes enemies in a block of ice for 15 seconds with added knockback, and deals additional dragon frost damage.\n\nBloodlust\nAdds life essence to your soul network when killing.\n\nBody\nHigher Durability\n\nBone Shock\nDeals additional damage to non-arthropod creatures.\n\nBotanical I-II\nIncreases the amount of slots; the effect stacks greatly.\n\nBroodmother\nSpawn a Vespa larva during combat or when a block is harvested.\n\nBrown Magic\nPress the \"set portal\" key (default \"N\") to set a virtual portal on the block you are pointing at. By default, press \"Y\" to teleport there (if there is enough space).\n\nChad Thunder****\nEnemies struck by this weapon have thunderbolts rained down on them.\n\nCheap\nIncreases durability gained when repairing the tool.\n\nCheapskate\nYour tool has less durability.\n\nChunky\nMakes your tool or weapon drop Mob Chunks.\n\nCold-Blooded\nDeal increased damage to targets at full health.\n\nCoralium-Plagued\nApply the Coralium Plague on critical hits.\n\nCounterweight I-II\nIncreases tool efficiency when not touching the ground.\n\nCritikill\nAlways do a critical hit!\n\nCrude I-II\nBonus damage against unarmored targets.\n\nCrumbling\nThe tool breaks soft blocks that don\u0027t need a tool faster.\n\nDark Traveler\nSurrounding mobs get randomly afflicted with damage.\n\nDarkness\nDark influences don\u0027t wont on your enemy, so they\u0027re tortured instead!\n\nDemocratic People\u0027s Republic of Korea\nWhen attacking or defending, Supreme Leaders will spawn, exploding on opponents in the same manner as a creeper.\n\nDense\nYour tool lasts longer when it has less durability.\n\nDevil\u0027s Strength\nBonus damage to non-Overworld mobs.\n\nDirect\nTeleports mined things directly into your inventory.\n\nDiscounted\nSignificantly increases durability gained when repairing the tool.\n\nDread-Plagued\nApply the Dread Plague on critical hits.\n\nDuritae\nYour tool lasts longer ...most of the time.\n\nEcological\nRenewable resources are so good, they regenerate by themselves!\n\nElemental\nWhen gravity-affected blocks are destroyed, break all blocks of the same type above and below. Also, a chance to gain various benefits from a sucessful attack.\n\nEnderference\nPrevents Endermen from teleporting around for a short time.\n\nEndspeed\nProjectiles instantly travel to their destination.\n\nEnergy Eater\nBoosts the mining speed and damage by consuming energy!\n\nEnergy Repair\nRepairs from the energy stored in the inventory, but only when it\u0027s about to be damaged...\n\nEthereal Miner\nMining blocks prevents blocks above falling down.\n\nEvil Aura\nWhen held, creates an aura of evil that brings misfortune to the wielder.\n\nEvil Pressure\nEach hit has a chance to amplify negative effects present on mob.\n\nExperience Boost\nGives bonus XP when mining or slaying mobs.\n\nFamine\nGives Hunger. Restore 1 hunger points when hitting a non-undead entity or harvesting a block. \n\nFlaming Fury\nDeals additional damage while on fire.\n\nFlammable\nBlocking blocks fire damage and getting hit sets the attacker on fire.\n\nFractured I-II\nYour tools damage is increased.\n\nFreezing\nSuccessful hits slow your target more and more.\n\nFruit Salad\nA tool with this trait can store up to 5 types of fruits.\n\nGhastly\nIf the holder is attacked while sneaking, the attacker is inflicted with Slowness.\n\nGlitch\nDrops Glitch Heart sometimes when killing.\n\nGlobal Traveler\nShift-right-click a block in order for items from broken blocks and killed entities to get transported in there if it is an inventory.\n\nGlowing\nWhenever it gets too dark your tool sacrifices a part of itself to light up your way.\n\nHail Hydra\nRandom explosions plague your enemies. Also, when you are attacked, there is a chance to get Absorption.\n\nHe Who Must Not Be Named\nBonus damage accrued for each entity of the same type as the target close to it.\n\nHealer\nGuess you like the enemy so much you heal them every time you try to hurt them\n\nHeavy\nPrevents knockback.\n\nHellish\nDeal bonus damage to non-Nether mobs.\n\nHigh in Calcium\nDrops bones and bonemeal while breaking blocks.\n\nHive Defender\nDeals +8 extra damage against death worms and +4 damage against non-arthropods.\n\nHoly\nDeal bonus damage to undead enemies.\n\nIlluminati\nWhile the tool is in your hand, nearby entities (that do not hold a tool with this trait) glow, and you become invisible.\n\nI\u0027m a Superstar\nEffects depend on the player\u0027s attunement.\n\nInfernal Energy\nMassively increases tool efficiency when on fire.\n\nInferno II\nSets enemies on fire for 15 seconds with added knockbacks, and deals additional dragon flame damage.\n\nInsatiable\nDuring combat you deal more and more damage but also consume more and more durability.\n\nInstakill\nOne-shot kills. Slightly dangerous\n\nIn the Garage\nExtra damage in the shadow\n\n\nJaded\nMobs attacked with this tool have their ability to heal temporarily hindered.\n\nJagged\nEvery point durability lost increases damage.\n\nLaced\nPoisons creatures when hit.\n\nLaunch\nOccasionally make your enemy go flying. They like it...until they hit the ground\n\nLightweight\nIncreases the overall speed of your tool when mining and attacking.\n\nLiving I-II\nHeals itself via the user\u0027s Soul Network\n\nMagically Brittle\nHas a random chance of breaking when it takes damage. Can break \u0027unbreakable\u0027 tools.\n\nMagically Modifiable\nAdds 3 extra modifiers to a tool\n\nMagnetic I-II\nHitting things attracts nearby things?!\n\nMana\nMana can be used in place of durability, and can heal the tool over time.\n\nMana Eater\nBoosts the mining speed and damage by consuming mana!\n\nMana Repair\nRepairs from the mana stored in the player, but only when it\u0027s about to be damaged...\n\nMind\nMore Effecient\n\nMirabile Visu\nOccasionally, a gold or diamond ore will appear in stone immediately surrounding you (at the cost of durability).\n\nMoldable\nBlend additional modifiers into your tool.\n\nMomentum\nMining blocks increases your speed, as long as you keep going.\n\nMorgan Le Fay\nBonus magic damage (ranging from 0.0 to 5.0; Gaussian distributed) is afflicted (it is absolute).\n\nMusic of the Spheres\nThe tool doubles as a movable boombox.\n\nNature\u0027s Blessing\nA chance to drop bread per mob killed or block broken. Sometimes heals the player by a bit after killing a mob.\n\nNature\u0027s Power\nAfter attacking a mob: 20% chance to burn target. 20% chance to give player Speed. 20% chance to give player Strength.\n\nNature\u0027s Wrath\nAfter attacking a mob, there is a chance to burn the target, as well as to heal the player.\n\nOverflow\nThere is a 25% probability that this weapon directly wipes off half of target\u0027s health each attack.\n\nPayback\nBecome enraged and deal moar damage when severely injured\n\nPetramor\nYour tool loves stone, it literally wants to absorb it (for durability).\n\nPoisonous\nPoisons enemies on hit.\n\nPortly Gentleman\nShift-right-click an entity to capture it (costs durability based on entity health). Press the \"release entity\" key (default \"0\") in order to release it.\n\nPower of the Sun\nTorch works too. Mining and Fighting are effected by your light conditions\n\nPrecipitate\nThe less health you have, the speedier it is!\n\nPrickly\nNobody is safe from those thorns, they always hurt.\n\nProsperous\nMakes your tool or weapon randomly drop Prosperity Shards.\n\nPsi Eater\nBoosts the mining speed and damage by consuming psi!\n\nPsi Repair\nRepairs from the psi stored in the player, but only when it\u0027s about to be damaged...\n\nPurified\nDeal 25% extra damage to any Dread-Plagued entity.\n\nRadioactive I-III\nRandomly causes hunger or radiation poisoning :(\n\nReflect\nWhy are you hitting yourself\n\nRude Awakening\nDamage pierces armor (mobs only).\n\nRunic I-II\nConverts a portion of damage dealt into magic damage.\n\nShadow\nUses Mana to repair, can also  summon dark pixies when you attack mobs.\n\nSharp\nHitting an enemy leaves them bleeding for a short time.\n\nShock\nOccasionally shock your enemy with a bolt of thunder. Or lightning. Whatever\n\nShocking\nRunning around, breaking blocks or hitting things charges your tool. Hitting an enemy discharges it, dealing damage and providing a speed boost. Mining a block discharges it, giving a mining speed boost.\n\nShyre Synthesis\nPrevents the tool from taking damage when in direct sunlight.\n\nSlashing\nCritical hits gain 20% more damage!\n\nSlimey\nIt\u0027ll wash off.\n\nSlingshot\nYour tool become a slingshot for you to use for others!\n\nSOS!\nRecover when severely injured at a large cost\n\nSoul\nExtra 3 Modifiers\n\nSoul Harvest\nRegenerates soul power while mining.\n\nSoul Sap\nRegenerates soul power based on damage dealt.\n\nSpades\nThe lower your health, the more damage you do.\n\nSpiky\nBlocking and getting hurt deals damage to the attacker.\n\nSplintering I-II\nHit them more to deal more damage.\n\nSplinters\nBe careful not to catch a splinter!\n\nSqueaky\nYour tool is so soft and squeaky it gained silktouch, but deals no damage.\n\nStalwart\nHitting an entity can make you feel emboldened.\n\nStarfishy\nPress the \"set portal\" key (default \"N\") to set a virtual portal on the block you are pointing at. If you are on the brink of death, you have %d enori crystals to spare, and the portal has enough space above, then the crystals are consumed, you are teleported to the virtual portal, and you are spared. (The tool must be in your hand.)\n\nStiff\nBlocking reduces the damage taken even more.\n\nStonebound\nThe tool mines faster as it wears out, but does less damage.\n\nStop Being Selfish\nMore damage is added the closer other players are to the attacker.\n\nSuperheat\nDeal bonus damage to enemies on fire.\n\nSurf Wax America\nExtra damage while mounting\n\nSynergy\nWill repair itself if you have Steeleaves in your hotbar.\n\nTasty\nSmells so good.. You\u0027d rather eat your tool than starve.\n\nTerrafirma\nWhile this tool is in your hand (or this armor is worn), you will heal over time.\n\nThaumic\nA tool with this gains 1 extra slot, or 2 extra slots if either at least 3 parts have this trait, or the tool is made entirely out of parts with this trait.\n\nThermal Inversion\nHitting an enemy in a hot or cold environment will chill or burn them.\n\nToxic\nReleases a toxic cloud when critically-hitting enemies\n\nTweeting\nEver wanted to sound like a charger?\n\nTwilit\nMore damage outside the Twilight Forest.\n\nUndone\nCritical hits remove armor\n\nUnholy Touch\nDeals bonus damage to non-undead entity and applies Weakness \n\nUnnatural\nThe tool mines faster the higher its mining level is above the required one.\n\nUplifting\nOccasionally regenerates health on use.\n\nVanishing I-III\nChance to teleport enemies away.\n\nVile\nAdds an additional soul per kill to your Soul Shard\n\nVindictive\nBonus damage to players, and you gain some health by attacking.\n\nWeeee!\nPowerful enough to destroy everything below it! At least...harvest level-wise.\n\nWell-Established\nYou gain additional XP.\n\nWhispering\nWill occasionally whisper it\u0027s will to you\n\nWithering\nWithers enemies on hit.\n\nWritable\nMore words. More Modifiers. It\u0027s only logical!",
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 31,
        "id:8": "botania:cosmetic"
      },
      "name:8": "All the traits!!!"
    }
  },
  "questID:3": 201196,
  "tasks:9": {
    "0:10": {
      "index:3": 1,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}